Rhino.Runtime.Analytics
Provides tools for sending Google Analytics events using the Measurement Protocol.
See https://developers.google.com/analytics/devguides/collection/protocol/v1/devguide#event
for details.

Rhino.Runtime.Analytics.GoogleAnalyticsTrackingID
Google Analytics Tracking ID
Since: 6.0

Rhino.Runtime.Analytics.AppName
Name of Application. For example, "Ocelot". Do not include version numbers.
Maps to Google Analytics parameter 'an'
Since: 6.0

Rhino.Runtime.Analytics.AppPlatform
Platform application is running on. For example "Mac", "Windows". Again, don't include version numbers.
Maps to Google Analytics parameter 'ai'
Since: 6.0

Rhino.Runtime.Analytics.AppInstallerId
App Installer Id. In Rhino, we use this to differentiate between different builds such as "WIP" and "Commercial".
Maps to Google Analytics parameter 'aiid'
Since: 6.0

Rhino.Runtime.Analytics.AppVersion
Application version string.
Maps to Google Analytics parameter 'av'
Since: 6.0

Rhino.Runtime.Analytics.#ctor(System.String,System.String)
Construct Analytics class
TrackingID: Google Analytics Tracking ID
Name:
Name of Application (for example, "Ocelot")
Do not include version numbers.
Maps to Google Analytics parameter 'an'
Since: 6.0

Rhino.Runtime.Analytics.#ctor(System.String,System.String,System.String,System.String,System.String)
Construct Analytics class
TrackingID: Google Analytics Tracking ID
Name: Name of Application. For example, "Ocelot". Do not include version numbers. Maps to Google Analytics parameter 'an'
Platform: Platform application is running on. For example "Mac", "Windows". Again, don't include version numbers. Maps to Google Analytics parameter 'ai'
InstallerId: App Installer Id. In Rhino, we use this to differentiate between different builds such as "WIP" and "Commercial". Maps to Google Analytics parameter 'aiid'
Version:  Application version string. Maps to Google Analytics parameter 'av'
Since: 6.0

Rhino.Runtime.Analytics.Send(System.String,System.String,System.String,System.UInt32)
Sends a Google Analytics event using the Measurement Protocol. See https://developers.google.com/analytics/devguides/collection/protocol/v1/devguide#event for details.
This method is asyncrhonous and the return code is completely ignored. Validate the data you send
Category: Event category. We use the feature or subsystem, such as "installer" or "app" or "document" or "loft". Maps to the Google Analytics parameter "ec".
Action: Event action. A verb: "open" or "start" or "option" Maps to the Google Analytics parameter "ea".
Label: Event label. Maps to the Google Analytics parameter "el".
Value: Event value. Maps to the Google Analytics parameter "ev".
Since: 6.0

Rhino.Runtime.Analytics.Send(System.Collections.Specialized.NameValueCollection)
Advanced method for sending Google Analytics data.
It is the caller's responsibility to make sure that all parameters passed will result in a valid Google Analytics hit. Failure to do so will result in Google Analytics ignoring your hit, and the caller will get no data.
The Analytics class will populate data from the Application, the GoogleAnalyticsTrackingID, the User ID, and set the hit type "t" to "event". It also sets other information about the system.
data: Name-Value pairs of data to send. Any valid Google Analytics Measurement Protocol parameter is allowed. No input validation is performed.
Since: 6.0

Rhino.Runtime.Analytics.Send(System.String)
Sends a Google Analytics event using the Measurement Protocol. See https://developers.google.com/analytics/devguides/collection/protocol/v1/devguide#event for details.
Category: Event category. We use the feature or subsystem, such as "installer" or "app" or "document" or "loft". Maps to the Google Analytics parameter "ec".
Since: 6.0

Rhino.Runtime.Analytics.Send(System.String,System.String)
Sends a Google Analytics event using the Measurement Protocol. See https://developers.google.com/analytics/devguides/collection/protocol/v1/devguide#event for details.
Category: Event category. We use the feature or subsystem, such as "installer" or "app" or "document" or "loft". Maps to the Google Analytics parameter "ec".
Action: Event action. A verb: "open" or "start" or "option" Maps to the Google Analytics parameter "ea".
Since: 6.0

Rhino.Runtime.Analytics.Send(System.String,System.String,System.String)
Sends a Google Analytics event using the Measurement Protocol. See https://developers.google.com/analytics/devguides/collection/protocol/v1/devguide#event for details.
Category: Event category. We use the feature or subsystem, such as "installer" or "app" or "document" or "loft". Maps to the Google Analytics parameter "ec".
Action: Event action. A verb: "open" or "start" or "option" Maps to the Google Analytics parameter "ea".
Label: Event label. Maps to the Google Analytics parameter "el".
Since: 6.0

Rhino.Runtime.Analytics.UsageStatisticsEnabled
Determine if user allows automatic data collection from Rhino
Since: 6.0

Rhino.Runtime.Analytics.UserId
Returns a GUID that allows events to be aggregated by user. There is no way to determine who the
end user is based on this GUID, unless the user tells you their ID.  On Windows, this uses the
registry to store the ID.  On Mac, the Hardware UUID is used as the ID.
Since: 6.0