Rhino.Geometry.Brep.ExtendBrepFacesToConnect(Rhino.Geometry.BrepFace,Rhino.Geometry.Point3d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point3d,System.Double,System.Double,Rhino.Geometry.Brep@,Rhino.Geometry.Brep@)
Extends Faces to meet and trims the faces to each other. If input faces intersect without extending, the selection point indicates the side to keep
Face0: [in] first face to connect
f0_sel_pt: selection point on first face near the edge to extend.
Face1: [in] second surface
f1_sel_pt: selection point on second face near the edge to extend.
tol: [in] tolerance used for intersecting faces and simplifing extension curve
angleTol: [in] angle tolerance in radians used for simplifying extendsion curve
outBrep0: [out] first face extended and trimmed to connect with the second face
outBrep1: [out] second face extended and trimmed to connect with the first face
Returns: true if valid connection found

Rhino.Geometry.Brep.ExtendBrepFacesToConnect(Rhino.Geometry.BrepFace,System.Int32,Rhino.Geometry.BrepFace,System.Int32,System.Double,System.Double,Rhino.Geometry.Brep@,Rhino.Geometry.Brep@)
Extends Faces to meet and trims the faces to each other. If input faces intersect without extending, the selection point indicates the side to keep
Face0: [in] first face to connect
edgeIndex0: [in] edge to extend.
Face1: [in] second surface
edgeIndex1: [in] edge to extend.
tol: [in] tolerance used for intersecting faces and simplifing extension curve
angleTol: [in] angle tolerance in radians used for simplifying extendsion curve
outBrep0: [out] first face extended and trimmed to connect with the second face
outBrep1: [out] second face extended and trimmed to connect with the first face
Returns: true if valid connection found

Rhino.Geometry.Brep.IsManifold
Gets a value indicating whether or not the Brep is manifold.
Non-Manifold breps have at least one edge that is shared among three or more faces.
Since: 5.0

Rhino.Geometry.Brep.InsetFaces(System.Collections.Generic.IEnumerable{System.Int32},System.Double,System.Boolean,System.Boolean,System.Boolean,System.Double,System.Double)
Individually insets faces of a brep by offsetting the faces outer edges inward and inner edges out then splitting the face with the offset curves.
faceIndices: the indices of the faces to inset
distance: The distance to offset along the face
loose: If true, offset by moving edit points otherwise offset within tolerance.
ignoreSeams: If true, the seam edges are not offset and adjacent edges are extended to meet the seam. Otherwise offset normally.
creaseCorners: If true, splitting curves will be made between the creases on edge curves and creases on the inset curves.
tolerance: The fitting tolerance for the offset. When in doubt, use the document's absolute tolerance.
angleTolerance: The angle tolerance in radians for identifying creases when creasing corners.  When in doubt, use the document's angle tolerance.
Returns: The brep with inset faces on success. Null on error.