Rhino.Runtime.HostUtils.LoadAssemblyFrom(System.String)
Calls Assembly.LoadFrom in .NET 4.8. May call a different routine under .NET 7
path:
Returns:
Since: 8.0

Rhino.Runtime.HostUtils.GetPrinterFormMargins(System.String,System.String,System.Boolean,System.Double@,System.Double@,System.Double@,System.Double@)
Get limit margins for a given form (page size) and a given printer.
This is the physical limit area that a printer can print on a given page
printerName:
formName:
portrait:
leftMillimeters:
topMillimeters:
rightMillimeters:
bottomMillimeters:
Returns: true on success

Rhino.Runtime.HostUtils.GetPrinterDPI(System.String,System.Boolean)
Get the output resolution for a given printer.
printerName:
horizontal: get the horizontal or vertical resolution
Returns:
Dot per inch resolution for a given printer on success. 0 if an error occurred

Rhino.Runtime.HostUtils.SafeInvoke``1(System.EventHandler{``0},System.Object,``0)
Safetly invokes (catching exceptions) the method represented by the provided handler.
handler: Event handler
sender: Event sender
args: Event arguments
Remarks: All handlers will be called even one of it throws an exception.