Rhino.Display.ViewCaptureSettings.#ctor(Rhino.Display.ViewCaptureSettings)
Copy constructor
other: settings to copy data from

Rhino.Display.ViewCaptureSettings.Equals(Rhino.Display.ViewCaptureSettings)
Check if the contents of this object is the same as another object
other: other settings to compare against
Returns:

Rhino.Display.ViewCaptureSettings.ApplyDisplayModeThicknessScales
Should curves and edges have their thicknesses scaled based the on the display
mode settings for a view being captured (default is false)

Rhino.Display.ViewCaptureSettings.DrawRectangle
Rectangle where drawing is confined to on MediaSize

Rhino.Display.ViewCaptureSettings.SetMarginLeft(Rhino.UnitSystem,System.Double)
Set the distance from the left edge of the paper to the CropRectangle
lengthUnits: units that distance is defined in
distance: distance to set
Returns:
True if successful.
False if unsuccessful (this could happen if there is no set device_dpi)

Rhino.Display.ViewCaptureSettings.SetMarginTop(Rhino.UnitSystem,System.Double)
Set the distance from the top edge of the paper to the CropRectangle
lengthUnits: units that distance is defined in
distance: distance to set
Returns:
True if successful.
False if unsuccessful (this could happen if there is no set device_dpi)

Rhino.Display.ViewCaptureSettings.SetMarginRight(Rhino.UnitSystem,System.Double)
Set the distance from the right edge of the paper to the CropRectangle
lengthUnits: units that distance is defined in
distance: distance to set
Returns:
True if successful.
False if unsuccessful (this could happen if there is no set device_dpi)

Rhino.Display.ViewCaptureSettings.SetMarginBottom(Rhino.UnitSystem,System.Double)
Set the distance from the bottom edge of the paper to the CropRectangle
lengthUnits: units that distance is defined in
distance: distance to set
Returns:
True if successful.
False if unsuccessful (this could happen if there is no set device_dpi)

Rhino.Display.ViewCaptureSettings.TextDotPointSize
Font point size use for printing text dots. The default value is 10.0.
Since: 7.27

Rhino.Display.ViewCaptureSettings.HorizontalScale
Horizontal stretch to be applied to output. Useful for calibrating printers

Rhino.Display.ViewCaptureSettings.VerticalScale
Vertical stretch to be applied to output. Useful for calibrating printers