Rhino.PlugIns.RenderPlugIn.IsTextureSupported(Rhino.Render.RenderTexture)
Returns true if this renderer can render the texture natively without needing it to be baked into a bitmap, false otherwise.
By default, returns false for all textures.