Rhino.Geometry.BezierCurve.GetControlVertex3d(System.Int32)
Get location of a control vertex.
index:
Control vertex index (0 <= index < ControlVertexCount)
Returns:
If the bezier is rational, the euclidean location is returned.
Throws System.ArgumentOutOfRangeException: when index is out of range
Since: 5.0

Rhino.Geometry.BezierCurve.GetControlVertex4d(System.Int32)
Get location of a control vertex.
index:
Control vertex index (0 <= index < ControlVertexCount)
Returns:
Homogeneous value of control vertex. If the bezier is not
rational, the weight is 1.
Throws System.ArgumentOutOfRangeException: when index is out of range
Since: 5.0