Rhino.DocObjects.Texture.ProjectionMode
How texture is projected onto geometry

Rhino.DocObjects.Texture.WcsProjected
Is true if this texture uses world coordinate system (WCS) projection for texture mapping.
Notice: If this texture is used by an object that has an object coordinate system (OCS) frame
defined on a mapping channel then that OCS frame is used instead of the WCS.

Rhino.DocObjects.Texture.TreatAsLinear
If false, the texture color values should be correctly by the linear workflow pre-process gamma value (in the document)
if linear workflow is on.  Otherwise, if the values is true, the values should be used raw from the texture.

Rhino.DocObjects.Texture.WcsBoxProjected
Is true if this texture uses world coordinate system (WCS) box projection for texture mapping.
Notice: If this texture is used by an object that has an object coordinate system (OCS) frame
defined on a mapping channel then that OCS frame is used instead of the WCS.