Rhino.DocObjects.RhinoObject.SetTextureMapping(System.Int32,Rhino.Render.TextureMapping,Rhino.Geometry.Transform)
Sets texture mapping and mapping object transform for a channel
channel:
tm:
objectTransform: Mapping channel object transform
Returns:
Since: 6.26