Rhino.DocObjects.GripObject.GetSurfaceParameters(System.Double@,System.Double@)
Retrieves the 2d parameter space values of this GripObject from the surface it's associated with.
u:
v:
Returns: True on success. Output is unreliable if return is false.
Since: 6.0