Rhino.Runtime.TextFields.GetVolumeFromId(System.String)
returns a volume from a string guid
id:
Returns:

Rhino.Runtime.TextFields.ConvertVolumeUnit(System.Double,System.String)
Used to convert volume units.
volume:
unitSystem:
Returns: