Rhino.Display.DisplayPipeline.IsInTiledDraw(System.Drawing.Size@,System.Drawing.Rectangle@)
Returns true if the currently drawn frame is part of a tiled capture. Tiled captures
are performed when creating large raster outputs.
fullSize: Final full size area that is being created
currentTile: What portion of the fullSize area that is currently being drawn
Returns:
true if a tiled capture is being performed. If false, the fullSize parameter will have the
same size as currentTile

Rhino.Display.DisplayPipeline.DrawMeshShaded(Rhino.Geometry.Mesh,Rhino.Display.DisplayMaterial,System.Int32[])
Draws the shaded faces of a given mesh.
mesh: Mesh to draw.
material: Material to draw faces with.
faceIndices: Indices of specific faces to draw
Since: 5.0