Rhino.FileIO.File3dm.ReadEarthAnchorPoint(System.String)
Reads only the earth anchor point from an existing 3dm file
path: A location on disk or network.
Returns: The earth anchor point.

Rhino.FileIO.File3dm.EarthAnchorPoint
If set, this is the model's location on the earth.  This information is
used when the model is used with GIS information.