Rhino.Render.RenderContent.SaveToFile(System.String,Rhino.Render.RenderContent.EmbedFilesChoice)
Saves content to a file - RMTL, RENV or RTEX.
filename: Full path to the file to be saved.
embedFilesChoice:
Returns: The loaded content or null if an error occurred.

Rhino.Render.RenderContent.GenerateRenderContentPreview(Rhino.Render.LinearWorkflow,Rhino.Render.RenderContent,System.Int32,System.Int32,System.Boolean,Rhino.Render.PreviewJobSignature,Rhino.Render.PreviewAppearance,Rhino.Render.Utilities.PreviewRenderResult@)
Generate a render content preview
lwf: Linear Workflow
c: Render Content
width: Image width
height: Image height
bSuppressLocalMapping: Suppress Local Mapping
pjs: Preivew Job Signature
pa: Preivew Appearance
result: Reference to PreviewRenderResult value
Returns: The Bitmap of the render content preview

Rhino.Render.RenderContent.GenerateQuickContentPreview(Rhino.Render.RenderContent,System.Int32,System.Int32,Rhino.Render.PreviewSceneServer,System.Boolean,System.Int32,Rhino.Commands.Result@)
Generate a quick render content preview
c: Render Content
width: Image width
height: Image height
psc: PreviewSceneServer
bSuppressLocalMapping: SuppressLocalMapping
reason:  ContentChanged = 0, ViewChanged = 1, RefreshDisplay = 2, Other = 99
result: Rhino.Command.Result value for successfull quick image creation
Returns: The Bitmap of the quick render content preview