Rhino.Render.PreviewJobSignature.CppPointer
UnManaged pointer of the PreviewJobsingature

Rhino.Render.PreviewJobSignature.#ctor
Preview Job Signature constructor

Rhino.Render.PreviewJobSignature.#ctor(System.IntPtr)
Preview Job Signature constructor

Rhino.Render.PreviewJobSignature.#ctor(System.Int32,System.Int32,System.UInt32)
Preview Job Signature constructor

Rhino.Render.PreviewJobSignature.Dispose
Dispose

Rhino.Render.PreviewJobSignature.Compare(Rhino.Render.PreviewJobSignature)
Compare two Preview Job Signatures. True if they are the same, otherwise false.

Rhino.Render.PreviewJobSignature.ImageWidth
The Width of the rendered preview image

Rhino.Render.PreviewJobSignature.ImageHeight
The Height of the rendered preview image