Rhino.Collections.ArchivableDictionary.System#Collections#Generic#IDictionary{System#String,System#Object}#Add(System.String,System.Object)
This is not supported and always throws System.NotSupportedException at the moment.
key: Unused.
value: Unused.