Rhino.Geometry.InstanceDefinitionGeometry.GetObjectIds
list of object ids in the instance geometry table
Returns:
Since: 5.6

Rhino.Geometry.InstanceDefinitionGeometry.DeleteUserString(System.String)
Since: 8.9

Rhino.Geometry.InstanceDefinitionGeometry.DeleteAllUserStrings
Since: 8.9