Rhino.DocObjects.RhinoReplaceObjectEventArgs.ObjectId
Since: 5.0

Rhino.DocObjects.RhinoReplaceObjectEventArgs.OldRhinoObject
Since: 5.0

Rhino.DocObjects.RhinoReplaceObjectEventArgs.NewRhinoObject
Since: 5.0

Rhino.DocObjects.RhinoReplaceObjectEventArgs.Document
Since: 5.0