Rhino.Geometry.Mesh.CreateFromSubDControlNetWithTextureCoordinates(Rhino.Geometry.SubD)
Create a mesh from a SubD control net including texture coordinates
subd:
Returns: mesh representing control net on success, null on failure

Rhino.Geometry.Mesh.CreateFromCurvePipe(Rhino.Geometry.Curve,System.Double,System.Int32,System.Int32,Rhino.Geometry.MeshPipeCapStyle,System.Boolean,System.Collections.Generic.IEnumerable{Rhino.Geometry.Interval})
Constructs a new mesh pipe from a curve.
curve: A curve to pipe.
radius: The radius of the pipe.
segments: The number of segments in the pipe.
accuracy: The accuracy of the pipe.
capType: The type of cap to be created at the end of the pipe.
faceted: Specifies whether the pipe is faceted, or not.
intervals: A series of intervals to pipe. This value can be null.
Returns: A new mesh, or null on failure.
Since: 6.0

Rhino.Geometry.Mesh.SetCachedTextureCoordinatesFromMaterial(Rhino.DocObjects.RhinoObject,Rhino.DocObjects.Material)
Sets up cached texture coordinate set for each texture in the material.
Textures in the Material define which mapping channels are used and
the RhinoObject defines what texture mapping is used for each mapping channel.
After this method is called all necessary texture coordinate sets are cached
and correct texture coordinates for each texture can be fetched using
GetCachedTextureCoordinates(RhinoObject rhinoObject, Rhino.DocObjects.Texture texture)
If any texture coordinates are already cached they will not be re-computed.
rhinoObject: RhinoObject that defines texture mappings
material: Material with textures that define mapping channels

Rhino.Geometry.Mesh.GetCachedTextureCoordinates(Rhino.DocObjects.RhinoObject,Rhino.DocObjects.Texture)
Returns cached texture coordinate set based on the texture.
Make sure to set up cached texture coordinates for all textures in the material first by calling
SetCachedTextureCoordinatesFromMaterial(RhinoObject rhinoObject, Rhino.DocObjects.Material material)
If this function returns null then there are no texture coordinates available.
rhinoObject: RhinoObject that defines texture mappings
texture: Texture that defines the mapping channel
Returns: Cached texture coordinates if available and otherwise null

Rhino.Geometry.Mesh.Weld(System.Double)
Makes sure that faces sharing an edge and having a difference of normal greater
than or equal to angleToleranceRadians share vertices along that edge, vertex normals
are averaged.
angleToleranceRadians: Angle at which to weld vertices.
Since: 5.0

Rhino.Geometry.Mesh.GetShrinkWrapPluginService
Get the shrinkwrap plugin and pass back the shrinkwrap interface
Returns:

Rhino.Geometry.Mesh.ShrinkWrap(Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)
Returns a ShrinkWrapped mesh or
null when a mesh was not created or error.
parameters: A ShrinkWrapParameters object that specifies the configuration settings for the ShrinkWrap process.
token: A cancellation token
Returns:
Since: 8.0

Rhino.Geometry.Mesh.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},Rhino.Geometry.ShrinkWrapParameters,Rhino.Geometry.MeshingParameters)
Creates a unified ShrinkWrap mesh from a collection of GeometryBase objects.
returns null or error on failure
geometryBases:
parameters: A ShrinkWrapParameters object that specifies the configuration settings for the ShrinkWrap process.
meshingParameters: GeometryBase objects are converted to meshes first using the MeshingParameters provided. Those meshes are then used in the ShrinkWrap process.
Returns: