Rhino.ApplicationSettings.ViewSettings.DefinedViewSetCPlane
Gets or sets the 'named views set CPlane' value.
When true, restoring a named view causes the construction plane saved with that view to also restore.
Since: 5.0

Rhino.ApplicationSettings.ViewSettings.DefinedViewSetProjection
Gets or sets the 'named views set projection' value.
When true, restoring a named view causes the viewport projection saved with the view to also restore.
Since: 5.0