Rhino.Runtime.IShrinkWrapService.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},Rhino.Geometry.ShrinkWrapParameters,Rhino.Geometry.MeshingParameters)
Create a mesh from a collection of geometry base objects
Null on error or incompatible settings
geometryBases:
parameters:
meshingParameters:
Returns: