Rhino.Geometry.HiddenLineDrawing.Flatten
Flatten, or project, all full curves to the x-y plane in HLD-coordinates.
Returns: true if successful, false otherwise.

Rhino.Geometry.HiddenLineDrawing.RejoinCompatibleVisible
///
Join consecutive visible curves from a single FullCurve
Returns: true if successful, false otherwise.
Returns: true if successful, false otherwise.
Since: 8.0