Rhino.DocObjects.InstanceDefinition.CreatePreviewBitmap(System.Guid,Rhino.Display.DefinedViewportProjection,Rhino.DocObjects.DisplayMode,System.Drawing.Size,System.Boolean)
Creates a preview bitmap of the instance definition.
definitionObjectId: Id of one of this definition's objects to draw selected.
definedViewportProjection: The view projection.
displayMode: The display mode.
bitmapSize: The bitmap size in pixels.
applyDpiScaling: Specify true to apply DPI scaling (Windows-only).
Returns: The preview bitmap if successful, null otherwise.
Since: 6.21