Rhino.DocObjects.Tables.InstanceDefinitionTable.Modify(Rhino.DocObjects.InstanceDefinition,System.String,System.String,System.Boolean)
Modifies the instance definition name and description.
Does not change instance definition ID or geometry.
idef: The instance definition to be modified.
newName: The new name.
newDescription: The new description string.
quiet:
If true, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful.
Since: 5.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.Modify(Rhino.DocObjects.InstanceDefinition,System.String,System.String,System.String,System.String,System.Boolean)
Modifies the instance definition name, description, and url.
Does not change instance definition ID or geometry.
idef: The instance definition to be modified.
newName: The new name.
newDescription: The new description string.
newUrl: The new URL or hyperlink.
newUrlTag: The new description of the URL or hyperlink.
quiet:
If true, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful.
Since: 7.16

Rhino.DocObjects.Tables.InstanceDefinitionTable.Modify(System.Int32,System.String,System.String,System.Boolean)
Modifies the instance definition name and description.
Does not change instance definition ID or geometry.
idefIndex: The index of the instance definition to be modified.
newName: The new name.
newDescription: The new description string.
quiet:
If true, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful.
Since: 5.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.Modify(System.Int32,System.String,System.String,System.String,System.String,System.Boolean)
Modifies the instance definition name, description, and url.
Does not change instance definition ID or geometry.
idefIndex: The index of the instance definition to be modified.
newName: The new name.
newDescription: The new description string.
newUrl: The new URL or hyperlink.
newUrlTag: The new description of the URL or hyperlink.
quiet:
If true, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful.
Since: 7.16