Rhino.Geometry.BezierSurface.GetBoundingBox(System.Boolean)
Bounding box solver. Gets the world axis aligned bounding box for the surface.
Returns:
The bounding box of the geometry in world coordinates or BoundingBox.Empty
if not bounding box could be found.
Since: 7.1