Rhino.PlugIns.PlugIn.AddToHelpMenu
Called by Rhino to determine if the plug-in name should be added to the Rhino Help/Plug-ins menu.

Rhino.PlugIns.PlugIn.DisplayHelp(System.IntPtr)
Called by Rhino if AddToHelpMenu is true and menu item associated with this plug-in is selected.
windowHandle: Native Window handle of the active Rhino interface.
Returns: true  = Help displayed successfully, false = Error displaying help