Rhino.UI.IStackedDialogPageService.SetNativeParent(System.IntPtr,System.Object)
Sets the parent on a host returned from GetNativePageWindow
hwndParent:
host:
Returns:

Rhino.UI.IStackedDialogPageService.NativeHandle(System.Object)
Gets the native window handle associated with the host object if there is one.
host:
Returns: