Rhino.DocObjects.Tables.RestoreLayerProperties
Since: 6.14

Rhino.DocObjects.Tables.RestoreLayerProperties.None
Restore nothing

Rhino.DocObjects.Tables.RestoreLayerProperties.Current
Restore current layer

Rhino.DocObjects.Tables.RestoreLayerProperties.Visible
Restore layer visibility

Rhino.DocObjects.Tables.RestoreLayerProperties.Locked
Restore layer locked status

Rhino.DocObjects.Tables.RestoreLayerProperties.Color
Restore layer color

Rhino.DocObjects.Tables.RestoreLayerProperties.Linetype
Restore layer linetype

Rhino.DocObjects.Tables.RestoreLayerProperties.PrintColor
Restore layer print color

Rhino.DocObjects.Tables.RestoreLayerProperties.PrintWidth
Restore layer print width

Rhino.DocObjects.Tables.RestoreLayerProperties.ViewportVisible
Restore per-viewport layer visibility

Rhino.DocObjects.Tables.RestoreLayerProperties.ViewportColor
Restore per-viewport layer color

Rhino.DocObjects.Tables.RestoreLayerProperties.ViewportPrintColor
Restore per-viewport layer print color

Rhino.DocObjects.Tables.RestoreLayerProperties.ViewportPrintWidth
Restore per-viewport layer print width

Rhino.DocObjects.Tables.RestoreLayerProperties.RenderMaterial
Restore render material

Rhino.DocObjects.Tables.RestoreLayerProperties.SectionStyle
Section style

Rhino.DocObjects.Tables.RestoreLayerProperties.NewDetailOn
New Detail On

Rhino.DocObjects.Tables.RestoreLayerProperties.All
Restore all layer properties