Rhino.Display.DisplayPipelineAttributes.SetCurveThicknessUsage(Rhino.Display.DisplayPipelineAttributes.CurveThicknessUse)
Sets usage, pixel thickness (CurveThickness) or a scale thickness (CurveThicknessScale)

Rhino.Display.DisplayPipelineAttributes.GetCurveThicknessUsage
Gets current usage, pixel thickness (CurveThickness) or a scale thickness (CurveThicknessScale)

Rhino.Display.DisplayPipelineAttributes.CurveThicknessScale
Scale thickness for curves

Rhino.Display.DisplayPipelineAttributes.GetSurfaceEdgeThicknessUsage
Helper function for setting the SurfaceEdgeThicknessFlags
Returns:

Rhino.Display.DisplayPipelineAttributes.SetSurfaceEdgeThicknessUsage(Rhino.Display.DisplayPipelineAttributes.SurfaceEdgeThicknessUse)
Helper function for getting the SurfaceEdgeThicknessFlags
Returns:

Rhino.Display.DisplayPipelineAttributes.SetSurfaceNakedEdgeThicknessUsage(Rhino.Display.DisplayPipelineAttributes.SurfaceNakedEdgeThicknessUse)
This is a helper function that combines setting SurfaceNakeEdgeUseNormalThickness and SurfaceNakedEdgeThicknessUsageFlags settings to correspond
to the behavor of the Settings page.

Rhino.Display.DisplayPipelineAttributes.GetSurfaceNakedEdgeThicknessUsage
This is a helper function that combines getting SurfaceNakeEdgeUseNormalThickness and SurfaceNakedEdgeThicknessUsageFlags settings to correspond
to the behavor of the Settings page.

Rhino.Display.DisplayPipelineAttributes.SetSurfaceIsoThicknessUsage(Rhino.Display.DisplayPipelineAttributes.SurfaceIsoThicknessUse)
This is a helper function that combines setting IsoThicknessUsed and SurfaceNakedEdgeThicknessUsageFlags settings to correspond
to the behavor of the Settings page.

Rhino.Display.DisplayPipelineAttributes.GetSurfaceIsoThicknessUsage
This is a helper function that combines getting IsoThicknessUsed and SurfaceNakedEdgeThicknessUsageFlags settings to correspond
to the behavor of the Settings page.

Rhino.Display.DisplayPipelineAttributes.SetSurfaceIsoApplyPattern(System.Boolean,System.Boolean,System.Boolean)
u:
v:
w:

Rhino.Display.DisplayPipelineAttributes.GetSurfaceIsoApplyPattern(System.Boolean@,System.Boolean@,System.Boolean@)
u: Gets mode in the u direction
v: Gets mode in the v direction
w: Gets mode in the w direction

Rhino.Display.DisplayPipelineAttributes.SurfaceIsoThicknessUsed


Rhino.Display.DisplayPipelineAttributes.SurfaceEdgeApplyPattern
Turn pattern application on or off

Rhino.Display.DisplayPipelineAttributes.SurfaceNakedEdgeApplyPattern
Turn pattern application on or off

Rhino.Display.DisplayPipelineAttributes.ShowSurfaceEdge
Turn Surface Edge visibility on or off

Rhino.Display.DisplayPipelineAttributes.ShowSurfaceNakedEdge
Turn Surface Naked Edge visibility on or off

Rhino.Display.DisplayPipelineAttributes.SetSurfaceIsoColorUsage(Rhino.Display.DisplayPipelineAttributes.SurfaceIsoColorUse)
Helper function for setting SurfaceIsoColorsUsed and SurfaceIsoSingleColor
use:

Rhino.Display.DisplayPipelineAttributes.GetSurfaceIsoColorUsage
Helper function for getting SurfaceIsoColorsUsed and SurfaceSingleIsoColor

Rhino.Display.DisplayPipelineAttributes.FrontMaterialShine
Get or set the front material shine (0 to Rhino.DocObjects.MaxShine). You must call DisplayModeDescription.UpdateDisplayMode() to commit this change.

Rhino.Display.DisplayPipelineAttributes.BackMaterialShine
Get or set the back material shine (0 to Rhino.DocObjects.MaxShine). You must call DisplayModeDescription.UpdateDisplayMode() to commit this change.

Rhino.Display.DisplayPipelineAttributes.FrontMaterialTransparency
Get or set the front material transparency (0 to 100). You must call DisplayModeDescription.UpdateDisplayMode() to commit this change.

Rhino.Display.DisplayPipelineAttributes.BackMaterialTransparency
Get or set the back material transparency (0 to 100). You must call DisplayModeDescription.UpdateDisplayMode() to commit this change.

Rhino.Display.DisplayPipelineAttributes.SubDSmoothInteriorColorReduction
Color reduction percentage

Rhino.Display.DisplayPipelineAttributes.SubDCreaseInteriorColorReduction
Color reduction percentage

Rhino.Display.DisplayPipelineAttributes.SubDNonManifoldColorReduction
Color reduction percentage

Rhino.Display.DisplayPipelineAttributes.SubDBoundaryColorReduction
Color reduction percentage

Rhino.Display.DisplayPipelineAttributes.SubDSmoothInteriorEdgeColorUsage
Edge color usage

Rhino.Display.DisplayPipelineAttributes.SubDCreaseInteriorEdgeColorUsage
Edge color usage

Rhino.Display.DisplayPipelineAttributes.SubDNonManifoldEdgeColorUsage
Edge color usage

Rhino.Display.DisplayPipelineAttributes.SubDBoundaryEdgeColorUsage
Edge color usage

Rhino.Display.DisplayPipelineAttributes.SubDReflectionPlaneColorUsage
SubD replection plane color use

Rhino.Display.DisplayPipelineAttributes.SubDReflectionPlaneColorReduction
SubD replection plane color reduction percentage

Rhino.Display.DisplayPipelineAttributes.SubDSmoothInteriorThicknessScale
Edge thickness scale

Rhino.Display.DisplayPipelineAttributes.SubDCreaseInteriorThicknessScale
Edge thickness scale

Rhino.Display.DisplayPipelineAttributes.SubDNonManifoldThicknessScale
Edge thickness scale

Rhino.Display.DisplayPipelineAttributes.SubDBoundaryThicknessScale
Edge thickness scale

Rhino.Display.DisplayPipelineAttributes.SubDSmoothInteriorEdgeThickness
Edge thickness (pixels).

Rhino.Display.DisplayPipelineAttributes.SubDCreaseInteriorEdgeThickness
Edge thickness (pixels).

Rhino.Display.DisplayPipelineAttributes.SubDNonManifoldEdgeThickness
Edge thickness (pixels).

Rhino.Display.DisplayPipelineAttributes.SubDBoundaryEdgeThickness
Edge thickness (pixels).

Rhino.Display.DisplayPipelineAttributes.SubDThicknessUsage
Thickness usage, pixel thickness or a scale thickness

Rhino.Display.DisplayPipelineAttributes.SubDSmoothInteriorApplyPattern
Apply pattern to the edge

Rhino.Display.DisplayPipelineAttributes.SubDCreaseInteriorApplyPattern
Apply pattern to the edge

Rhino.Display.DisplayPipelineAttributes.SubDNonManifoldApplyPattern
Apply pattern to the edge

Rhino.Display.DisplayPipelineAttributes.SubDBoundaryApplyPattern
Apply pattern to the edge

Rhino.Display.DisplayPipelineAttributes.SubDReflectionPlaneAxisLineOn
Apply Turnh on or off the reflection plane axis line

Rhino.Display.DisplayPipelineAttributes.SubDSmoothInteriorEdgeColor
Edge color

Rhino.Display.DisplayPipelineAttributes.SubDCreaseInteriorEdgeColor
Edge color

Rhino.Display.DisplayPipelineAttributes.SubDNonManifoldEdgeColor
Edge color

Rhino.Display.DisplayPipelineAttributes.SubDBoundaryEdgeColor
Edge color

Rhino.Display.DisplayPipelineAttributes.SubDReflectionAxisLineColor
Reflection axis line color

Rhino.Display.DisplayPipelineAttributes.SubDReflectionPlaneColor
Reflection plane color