Rhino.Geometry.Intersect.Intersection.MeshMeshFast(Rhino.Geometry.Mesh,Rhino.Geometry.Mesh)
This is an old overload kept for compatibility. Overlaps and near misses are ignored.
meshA: First mesh for intersection.
meshB: Second mesh for intersection.
Returns: An array of intersection line segments, or null if no intersections were found.
Since: 5.0
7.0