Rhino.Geometry.Curve.CreateTweenCurves(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Int32)
Creates curves between two open or closed input curves. Uses the control points of the curves for finding tween curves.
That means the first control point of first curve is matched to first control point of the second curve and so on.
There is no matching of curves direction. Caller must match input curves direction before calling the function.
curve0: The first, or starting, curve.
curve1: The second, or ending, curve.
numCurves: Number of tween curves to create.
Returns: An array of joint curves. This array can be empty.
Since: 5.2
6.0

Rhino.Geometry.Curve.CreateTweenCurves(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Int32,System.Double)
Creates curves between two open or closed input curves. Uses the control points of the curves for finding tween curves.
That means the first control point of first curve is matched to first control point of the second curve and so on.
There is no matching of curves direction. Caller must match input curves direction before calling the function.
curve0: The first, or starting, curve.
curve1: The second, or ending, curve.
numCurves: Number of tween curves to create.
tolerance:
Returns: An array of joint curves. This array can be empty.
Since: 6.0

Rhino.Geometry.Curve.CreateTweenCurvesWithMatching(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Int32)
Creates curves between two open or closed input curves. Make the structure of input curves compatible if needed.
Refits the input curves to have the same structure. The resulting curves are usually more complex than input unless
input curves are compatible and no refit is needed. There is no matching of curves direction.
Caller must match input curves direction before calling the function.
curve0: The first, or starting, curve.
curve1: The second, or ending, curve.
numCurves: Number of tween curves to create.
Returns: An array of joint curves. This array can be empty.
Since: 5.2
6.0

Rhino.Geometry.Curve.CreateTweenCurvesWithMatching(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Int32,System.Double)
Creates curves between two open or closed input curves. Make the structure of input curves compatible if needed.
Refits the input curves to have the same structure. The resulting curves are usually more complex than input unless
input curves are compatible and no refit is needed. There is no matching of curves direction.
Caller must match input curves direction before calling the function.
curve0: The first, or starting, curve.
curve1: The second, or ending, curve.
numCurves: Number of tween curves to create.
tolerance:
Returns: An array of joint curves. This array can be empty.
Since: 6.0

Rhino.Geometry.Curve.CreateTweenCurvesWithSampling(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Int32,System.Int32)
Creates curves between two open or closed input curves. Use sample points method to make curves compatible.
This is how the algorithm works: Divides the two curves into an equal number of points, finds the midpoint between the
corresponding points on the curves and interpolates the tween curve through those points. There is no matching of curves
direction. Caller must match input curves direction before calling the function.
curve0: The first, or starting, curve.
curve1: The second, or ending, curve.
numCurves: Number of tween curves to create.
numSamples: Number of sample points along input curves.
Returns: >An array of joint curves. This array can be empty.
Since: 5.2
6.0

Rhino.Geometry.Curve.CreateTweenCurvesWithSampling(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Int32,System.Int32,System.Double)
Creates curves between two open or closed input curves. Use sample points method to make curves compatible.
This is how the algorithm works: Divides the two curves into an equal number of points, finds the midpoint between the
corresponding points on the curves and interpolates the tween curve through those points. There is no matching of curves
direction. Caller must match input curves direction before calling the function.
curve0: The first, or starting, curve.
curve1: The second, or ending, curve.
numCurves: Number of tween curves to create.
numSamples: Number of sample points along input curves.
tolerance:
Returns: >An array of joint curves. This array can be empty.
Since: 6.0

Rhino.Geometry.Curve.ProjectToMesh(Rhino.Geometry.Curve,Rhino.Geometry.Mesh,Rhino.Geometry.Vector3d,System.Double)
Projects a curve to a mesh using a direction and tolerance.
curve: A curve.
mesh: A mesh.
direction: A direction vector.
tolerance: A tolerance value.
Returns: A curve array.
Since: 5.0

Rhino.Geometry.Curve.ProjectToMesh(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.Vector3d,System.Double)
Projects a curve to a set of meshes using a direction and tolerance.
curve: A curve.
meshes: A list, an array or any enumerable of meshes.
direction: A direction vector.
tolerance: A tolerance value.
Returns: A curve array.
Since: 5.0

Rhino.Geometry.Curve.ProjectToMesh(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.Vector3d,System.Double)
Projects a curve to a set of meshes using a direction and tolerance.
curves: A list, an array or any enumerable of curves.
meshes: A list, an array or any enumerable of meshes.
direction: A direction vector.
tolerance: A tolerance value.
Returns: A curve array.
Since: 5.0

Rhino.Geometry.Curve.Smooth(System.Double,System.Boolean,System.Boolean,System.Boolean,System.Boolean,Rhino.Geometry.SmoothingCoordinateSystem)
Smooths a curve by averaging the positions of control points in a specified region.
smoothFactor: The smoothing factor, which controls how much control points move towards the average of the neighboring control points.
bXSmooth: When true control points move in X axis direction.
bYSmooth: When true control points move in Y axis direction.
bZSmooth: When true control points move in Z axis direction.
bFixBoundaries: When true the curve ends don't move.
coordinateSystem: The coordinates to determine the direction of the smoothing.
Returns: The smoothed curve if successful, null otherwise.
Since: 6.0

Rhino.Geometry.Curve.Smooth(System.Double,System.Boolean,System.Boolean,System.Boolean,System.Boolean,Rhino.Geometry.SmoothingCoordinateSystem,Rhino.Geometry.Plane)
Smooths a curve by averaging the positions of control points in a specified region.
smoothFactor: The smoothing factor, which controls how much control points move towards the average of the neighboring control points.
bXSmooth: When true control points move in X axis direction.
bYSmooth: When true control points move in Y axis direction.
bZSmooth: When true control points move in Z axis direction.
bFixBoundaries: When true the curve ends don't move.
coordinateSystem: The coordinates to determine the direction of the smoothing.
plane: If SmoothingCoordinateSystem.CPlane specified, then the construction plane.
Returns: The smoothed curve if successful, null otherwise.
Since: 6.0

Rhino.Geometry.Curve.DivideEquidistant(System.Double)
Calculates 3d points on a curve where the linear distance between the points is equal.
distance: The distance between division points.
Returns: An array of equidistant points, or null on error.
Since: 5.0

Rhino.Geometry.Curve.Trim(System.Double,System.Double)
Removes portions of the curve outside the specified interval.
t0:
Start of the trimming interval. Portions of the curve before curve(t0) are removed.
t1:
End of the trimming interval. Portions of the curve after curve(t1) are removed.
Returns: Trimmed portion of this curve is successful, null on failure.
Since: 5.0

Rhino.Geometry.Curve.Trim(Rhino.Geometry.Interval)
Removes portions of the curve outside the specified interval.
domain:
Trimming interval. Portions of the curve before curve(domain[0])
and after curve(domain[1]) are removed.
Returns: Trimmed curve if successful, null on failure.
Since: 5.0

Rhino.Geometry.Curve.PullToMesh(Rhino.Geometry.Mesh,System.Double)
Makes a polyline approximation of the curve and gets the closest point on the mesh for each point on the curve.
Then it "connects the points" so that you have a polyline on the mesh.
mesh: Mesh to project onto.
tolerance: Input tolerance (RhinoDoc.ModelAbsoluteTolerance is a good default)
Returns: A polyline curve on success, null on failure.
Since: 5.0

Rhino.Geometry.Curve.RibbonOffset(Rhino.Geometry.RibbonOffsetParameters,Rhino.Geometry.Curve[]@,Rhino.Geometry.Curve[]@,Rhino.Geometry.Brep[]@)
Ribbon offset method to mimic RibbonOffset command
ribbonParameters: The ribbon offset parameters
railCurves: on success an array of split curves representing the sweep rail segments, null on failure
crossSectionCurves: on success an array of cross section curves used during brep creation, null on failure
brepSurfaces: on success and array of breps representing the ribbon surfaces, null on failure
Returns: return an offset curve on success, null on failure