Rhino.Geometry.Collections.MeshVertexColorList.Add(System.Drawing.Color)
Adds a new vertex color to the end of the color list.
color: Color to append, Alpha channels will be ignored.
Returns: The index of the newly added color.
Since: 5.0