Rhino.Geometry.BrepEdgeFilletDistance.#ctor(System.Double,System.Double)
Construct a fillet distance
edgeParameter: The parameter along the edge where to apply the fillet distance
filletDistance: The distance to apply

Rhino.Geometry.BrepEdgeFilletDistance.EdgeParameter
The parameter along the BrepEdge where to apply a fillet distance (radius)

Rhino.Geometry.BrepEdgeFilletDistance.FilletDistance
Distance to fillet