Rhino.DocObjects.Linetype.AlwaysModelDistances
Linetype patterns and widths are typically interpreted as distances on
the printed output when printing. In this case AlwaysModelDistances is
false (default). When set to true, the linetype pattern and width will
be interpreted as being in world distances. This is useful for cases
like modeling a road as a single curve.