Rhino.DocObjects.Font.FontOrigin.AppleFont
Set from an Apple CTFont. The PostScriptName() and FamilyName() match a
font installed on device running MacOS or iOS. The FaceName() matches
the "typeface" name shonw in the MacOS FontBook app.