Rhino.Render.CustomRenderMeshes.CustomRenderMeshProviderAttribute.#ctor(System.Boolean)
Constructor
nonObjectIdsOnly:

Rhino.Render.CustomRenderMeshes.CustomRenderMeshProviderAttribute.NonObjectIdsOnly
If set to true, this will quickly return false for HasCustomRenderMeshes if the objectId is in the document.