Rhino.Render.PreviewRenderedEventArgs.PreviewJobSignature
The Preview Job Signature associated with the rendered preview

Rhino.Render.PreviewRenderedEventArgs.Bitmap
The Bitmap of the rendered preview

Rhino.Render.PreviewRenderedEventArgs.Quality
The Bitmap of the rendered preview