Rhino.Geometry.AnnotationBase.SetOverrideDimStyle(Rhino.DocObjects.DimensionStyle)
Set a style including overrides for this annotation object.
The DimensionStyle OverrideStyle must have the override fields marked
as overridden and must have it's Id set to nil.
Use DimensinoStyle.SetFieldOverride(Field field) and related functions
to manage override settings. To override a field, the field value must be set
and the field must be marked as an override.
The DimensionStyle passed in here must not be in the dimstyle table
OverrideStyle:
Returns:
Since: 6.0

Rhino.Geometry.AnnotationBase.SetRichText(System.String,Rhino.DocObjects.DimensionStyle)
rtfText:
dimstyle:
Since: 6.0

Rhino.Geometry.AnnotationBase.TextHasRtfFormatting
Since: 6.0

Rhino.Geometry.AnnotationBase.FormatRtfString(System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.String)
rtf_in:
clear_bold:
set_bold:
clear_italic:
set_italic:
clear_underline:
set_underline:
clear_facename:
set_facename:
facename:
Returns:
Since: 6.0

Rhino.Geometry.AnnotationBase.FirstCharProperties(System.String,System.Boolean@,System.Boolean@,System.Boolean@,System.String@)
rtf_str:
bold:
italic:
underline:
facename:
Returns:
[Obsolete("Use AnnotationBase.FirstCharFont instead")]
Since: 6.0