Rhino.Geometry.HiddenLineDrawingParameters.AddGeometry(Rhino.Geometry.GeometryBase,System.Object)
Add geometry that should be included in the calculation
geometry:
Currently only curves, meshes, breps, surfaces, and extrusions are supported
tag: arbitrary data to be associated with this geometry
Returns:
true if the type of geometry can be added for calculations.
Currently only curves, meshes, breps, surfaces and extrusions are supported
Since: 6.0

Rhino.Geometry.HiddenLineDrawingParameters.AddGeometry(Rhino.Geometry.GeometryBase,System.Object,System.Boolean)
Add geometry that should be included in the calculation
geometry:
Currently only curves, meshes, breps, surfaces, and extrusions are supported
tag: arbitrary data to be associated with this geometry
occluding_sections: sections of this geometry occlude
Returns:
true if the type of geometry can be added for calculations.
Currently only curves, meshes, breps, surfaces and extrusions are supported
Since: 6.0

Rhino.Geometry.HiddenLineDrawingParameters.AddGeometry(Rhino.Geometry.GeometryBase,Rhino.Geometry.Transform,System.Object)
Add geometry that should be included in the calculation
geometry:
Currently only points, point clouds, curves, meshes, breps, surfaces, and extrusions are supported
xform:
tag: arbitrary data to be associated with this geometry
Returns:
true if the type of geometry can be added for calculations.
Currently only points, point clouds, curves, meshes, breps, surfaces and extrusions are supported
Since: 6.0

Rhino.Geometry.HiddenLineDrawingParameters.AddGeometry(Rhino.Geometry.GeometryBase,Rhino.Geometry.Transform,System.Object,System.Boolean)
Add geometry that should be included in the calculation
geometry:
Currently only points, point clouds, curves, meshes, breps, surfaces, and extrusions are supported
xform:
tag: arbitrary data to be associated with this geometry
occluding_sections: sections of this geometry occlude
Returns:
true if the type of geometry can be added for calculations.
Currently only points, point clouds, curves, meshes, breps, surfaces and extrusions are supported
Since: 6.0

Rhino.Geometry.HiddenLineDrawingParameters.AddGeometryAndPlanes(Rhino.Geometry.GeometryBase,System.Object,System.Collections.Generic.List{Rhino.Geometry.Plane})
Add geometry and its active clipping planes to be included in the calculation
geometry:
Currently only curves, meshes, breps, surfaces, and extrusions are supported
tag: arbitrary data to be associated with this geometry
clips: Active clipping planes for this object
Returns:
true if the type of geometry can be added for calculations.
Currently only curves, meshes, breps, surfaces and extrusions are supported
Since: 6.0

Rhino.Geometry.HiddenLineDrawingParameters.AddGeometryAndPlanes(Rhino.Geometry.GeometryBase,System.Object,System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Plane})
Add geometry and its active clipping planes to be included in the calculation
geometry:
Currently only curves, meshes, breps, surfaces, and extrusions are supported
tag: arbitrary data to be associated with this geometry
occluding_sections: sections of this geometry occlude
clips: Active clipping planes for this object
Returns:
true if the type of geometry can be added for calculations.
Currently only curves, meshes, breps, surfaces and extrusions are supported
Since: 6.0

Rhino.Geometry.HiddenLineDrawingParameters.AddGeometryAndPlanes(Rhino.Geometry.GeometryBase,Rhino.Geometry.Transform,System.Object,System.Collections.Generic.List{Rhino.Geometry.Plane})
Add geometry and its active clipping planes to be included in the calculation
geometry:
Currently only points, point clouds, curves, meshes, breps, surfaces, and extrusions are supported
xform:
tag: arbitrary data to be associated with this geometry
clips: Active clipping planes for this object
Returns:
true if the type of geometry can be added for calculations.
Currently only points, point clouds, curves, meshes, breps, surfaces and extrusions are supported
Since: 6.0

Rhino.Geometry.HiddenLineDrawingParameters.AddGeometryAndPlanes(Rhino.Geometry.GeometryBase,Rhino.Geometry.Transform,System.Object,System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Plane})
Add geometry and its active clipping planes to be included in the calculation
geometry:
Currently only points, point clouds, curves, meshes, breps, surfaces, and extrusions are supported
xform:
tag: arbitrary data to be associated with this geometry
occluding_sections: sections of this geometry occlude
clips: Active clipping planes for this object
Returns:
true if the type of geometry can be added for calculations.
Currently only points, point clouds, curves, meshes, breps, surfaces and extrusions are supported
Since: 6.0