Rhino.Render.ChangeQueue.ChangeQueue.MaterialFromOriginalInstanceId(System.Guid)
Get the RenderMaterial from the ChangeQueue material cache from the original instance id
id: The original instance id
Returns: RenderMaterial

Rhino.Render.ChangeQueue.ChangeQueue.TextureFromOriginalInstanceId(System.Guid)
Get the RenderTexture from the ChangeQueue content cache from the original instance id
id: The original instance id
Returns: RenderTexture

Rhino.Render.ChangeQueue.ChangeQueue.EnvironmentFromOriginalInstanceId(System.Guid)
Get the RenderEnvironment from the ChangeQueue content cache from the original instance id
id: The original instance id
Returns: RenderEnvironment