Rhino.Geometry.RadialDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Update Dimension geometry from point locations
plane: Dimension's plane
centerpoint: Dimension's center point
radiuspoint: Point on dimension radius
dimlinepoint: Point on dimension line
rotationInPlane: Rotation around plane origin
Returns:
Since: 6.0