Rhino.DocObjects.BasepointZero
Specifies enumerated constants used to indicate the zero level convention relating to a location on Earth.
This is used in conjunction with the Rhino.DocObjects.EarthAnchorPoint class.
Since: 5.0