Rhino.Geometry.MeshUnsafeLock.VertexColorsArray(System.Int32@)
Retrieves a pointer to the raw mesh vertex colors array, which uses RGBA integers
or throws an exception if none is available.
length: The length of the array. This value is returned by reference (out in C#).
Returns: The beginning of the vertex array. Item 0 is the first vertex,
and item length-1 is the last valid one.
Throws System.InvalidOperationException: The mesh does not have vertex normals.

Rhino.Geometry.MeshUnsafeLock.FaceNormalsArray(System.Int32@)
Retrieves a pointer to the raw mesh face normals array, which uses vectors
defined with single precision floating point numbers, or throws an exception if none is available.
length: The length of the array. This value is returned by reference (out in C#).
Returns: The beginning of the vertex array. Item 0 is the first vertex,
and item length-1 is the last valid one.
Throws System.InvalidOperationException: The mesh does not have face normals.