Rhino.Geometry.SubDEdge.FaceCount
Number of faces for this edge
Since: 7.0

Rhino.Geometry.SubDEdge.ControlNetLine
Line representing the control net end points
Since: 7.0

Rhino.Geometry.SubDEdge.VertexFrom
Start vertex for this edge
Since: 7.0

Rhino.Geometry.SubDEdge.VertexTo
End vertex for this edge
Since: 7.0

Rhino.Geometry.SubDEdge.Tag
identifies the type of subdivision edge
Since: 7.0

Rhino.Geometry.SubDEdge.FaceAt(System.Int32)
Retrieve a SubDFace from this edge
index:
Returns:
Since: 7.0