Rhino.Geometry.SubDVertexTag
ON_SubDVertexTag identifies the type of subdivision vertex.  Different tags use
different subdivision algorithms to determine where the subdivision point and
limit point are located.  There are toplological constraints that restrict which
tags can be assigned.