Rhino.FileIO.SerializationOptions.WriteRenderMeshes
Gets or sets a value indicating whether to write render meshes

Rhino.FileIO.SerializationOptions.WriteAnalysisMeshes
Gets or sets a value indicating whether to write analysis meshes