Rhino.Render.CustomRenderMeshes.RenderMeshes.#ctor(Rhino.RhinoDoc,System.Guid,System.Guid,System.UInt32)
Create a new render primitives collection.
doc: The Rhino document with which this collection will be associated.
objectId: The ObjectId that this collection is for.
renderMeshProviderId: The RenderMeshProvider that created this collection - if this is the first in the stack, typically this will be ON_nil_uuid.
runningHash: The running hash of this collection - each RenderMeshProvider will update the hash with its own modification hash.
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshes.Hash
The running hash for these render meshes.