Rhino.DocObjects.Tables.NamedViewTable.Selection
Returns the current selection in the Named Views panel. If more than one such panel is open,
it will return the selection in the most recently opened panel.