Rhino.DocObjects.Tables.ObjectTable.InvalidateBoundingBox
Destroys the cached scene bounding box so that it will be regenerated again from scratch next time the view is regenerated

Rhino.DocObjects.Tables.ObjectTable.GetSelectedObjectTypes
Since: 6.0