Rhino.DocObjects.DimensionStyle.Field.DimensionLengthDisplay
Dimension length display. See ON_DimStyle::DimensionLengthDisplay() for a descpription of this parameter.

Rhino.DocObjects.DimensionStyle.Field.AlternateDimensionLengthDisplay
Alternate dimension length display. See ON_DimStyle::AlternateDimensionLengthDisplay() for a descpription of this parameter.