Rhino.Geometry.Arc.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Initializes a new arc from end points and a tangent vector.
If the tangent is parallel with the endpoints this will result in an Invalid arc.
pointA: Start point of arc.
tangentA: Tangent at start of arc.
pointB: End point of arc.
Since: 5.0

Rhino.Geometry.Arc.Trim(Rhino.Geometry.Interval)
Sets arc's angle domain (in Radians) as a sub-domain of the circle.
domain:
0 < domain[1] - domain[0] <= 2.0 * RhinoMath.Pi.
Returns: true on success, false on failure.
Since: 5.0