Rhino.Geometry.Transform.ChangeBasis(Rhino.Geometry.Plane,Rhino.Geometry.Plane)
Computes a change of basis transformation. A basis change is essentially a remapping
of geometry from one coordinate system to another.
plane0: Coordinate system in which the geometry is currently described.
plane1: Target coordinate system in which we want the geometry to be described.
Returns:
A transformation matrix which orients geometry from one coordinate system to another on success.
Transform.Unset on failure.
Since: 5.0

Rhino.Geometry.Transform.ChangeBasis(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Computes a change of basis transformation. A basis change is essentially a remapping
of geometry from one coordinate system to another.
initialBasisX: can be any 3d basis.
initialBasisY: can be any 3d basis.
initialBasisZ: can be any 3d basis.
finalBasisX: can be any 3d basis.
finalBasisY: can be any 3d basis.
finalBasisZ: can be any 3d basis.
Returns:
A transformation matrix which orients geometry from one coordinate system to another on success.
Transform.Unset on failure.
Since: 5.0