Rhino.ApplicationSettings.AppearanceSettings.SetToDarkMode
Set UI to the default dark mode color scheme
Returns: true on sucess

Rhino.ApplicationSettings.AppearanceSettings.SetToLightMode
Set UI to the default light mode color scheme
Returns: true on sucess

Rhino.ApplicationSettings.AppearanceSettings.UsingDefaultDarkModeColors
Determine if Rhino is running with default dark mode color settings
Returns:

Rhino.ApplicationSettings.AppearanceSettings.UsingDefaultLightModeColors
Determine if Rhino is running with default light mode color settings
Returns: