Rhino.DocObjects.Environment.BackgroundColor
The background color.
Since: 8.0

Rhino.DocObjects.Environment.BackgroundImage
The background image texture.
Since: 8.0

Rhino.DocObjects.Environment.BackgroundProjection
The background projection.
Since: 8.0