Rhino.Render.ChangeQueue.MeshInstance.AncestryRecord.ReferenceId
The ModelObjectId of the InstanceObject

Rhino.Render.ChangeQueue.MeshInstance.AncestryRecord.DefinitionId
The ModelObjectId of the InstanceDefinition

Rhino.Render.ChangeQueue.MeshInstance.AncestryRecord.ReferenceAttributes
The object attributes from the InstanceObject

Rhino.Render.ChangeQueue.MeshInstance.AncestryRecord.Transform
The transform from the InstanceObject

Rhino.Render.ChangeQueue.MeshInstance.AncestryRecord.Dispose
Dispose