Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader.Add(Rhino.FileIO.BinaryArchiveReader)
Adds a new Rhino.Geometry.Interval at the end of this array.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader.Get(System.Int32)
Get the Guid at index
index:
Returns:
Since: 6.0