Rhino.Geometry.Vector2f.YAxis
Gets the value of the vector with components 0,1.

Rhino.Geometry.Vector2f.Unitize
Unitizes the vector in place. A unit vector has length 1 unit.
An invalid or zero length vector cannot be unitized.
Returns: true on success or false on failure.

Rhino.Geometry.Vector2f.Reverse
Reverses this vector in place (reverses the direction).
If this vector contains RhinoMath.UnsetValue, the
reverse will also be invalid and false will be returned.
Remarks: Similar to Negate, that is only provided for CLR language compliance.
Returns: true on success or false if the vector is invalid.

Rhino.Geometry.Vector2f.PerpendicularTo(Rhino.Geometry.Vector2f)
Sets this vector to be perpendicular to another vector.
Result is not unitized.
other: Vector to use as guide.
Returns: true on success, false if input vector is zero or invalid.

Rhino.Geometry.Vector2f.Add(Rhino.Geometry.Vector2f,Rhino.Geometry.Vector2f)
Sums up two vectors.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
vector1: A vector.
vector2: A second vector.
Returns: A new vector that results from the component-wise addition of the two vectors.

Rhino.Geometry.Vector2f.Subtract(Rhino.Geometry.Vector2f,Rhino.Geometry.Vector2f)
Subtracts the second vector from the first one.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
vector1: A vector.
vector2: A second vector.
Returns: A new vector that results from the component-wise difference of vector1 - vector2.

Rhino.Geometry.Vector2f.Negate(Rhino.Geometry.Vector2f)
Computes the reversed vector.
(Provided for languages that do not support operator overloading. You can use the - unary operator otherwise)
Remarks: This is similar to Reverse(), but is static for CLR compliance, and with default name.
vector: A vector to negate.
Returns: A new vector where all components were multiplied by -1.

Rhino.Geometry.Vector2f.Add(Rhino.Geometry.Point2f,Rhino.Geometry.Vector2f)
Sums up a point and a vector, and returns a new point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
point: A point.
vector: A vector.
Returns: A new point that results from the addition of point and vector.

Rhino.Geometry.Vector2f.Length
Computes the length (or magnitude, or size) of this vector.
This is an application of Pythagoras' theorem.
If this vector is invalid, its length is considered 0.