Rhino.Geometry.Extrusion.CreatePipeExtrusion(Rhino.Geometry.Cylinder,System.Double,System.Boolean,System.Boolean)
Gets an extrusion form of a pipe.
cylinder: IsFinite must be true.
otherRadius:
If cylinder.Radius is less than other radius, then the cylinder will be the inside
of the pipe.
capBottom: If true, the end at cylinder.Height1 will be capped.
capTop: If true, the end at cylinder.Height2 will be capped.
Returns: Extrusion on success. null on failure.
Since: 5.0

Rhino.Geometry.Extrusion.GetBrepFormComponentIndex(Rhino.Geometry.ComponentIndex)
Convert a component index that identifies a part of this extrusion
to a component index that identifies a part of the Brep created
by Extrusion.ToBrep(false).
extrusionComponentIndex: The extrusion component index.
Returns: The Brep component index if successful. Otherwise, Rhino.Geometry.ComponentIndex.Unset is returned.

Rhino.Geometry.Extrusion.SetMesh(Rhino.Geometry.Mesh,Rhino.Geometry.MeshType)
Sets a specified type of mesh for this extrusion.
mesh: The mesh.
meshType: The mesh type.
Returns: True on success.