Grasshopper.Rhinoceros.ModelManifest.Synchronised
ModelManifest keeps Synchronised content up to date with the twin object in the Rhino document.

Grasshopper.Rhinoceros.ModelManifest.Frozen
ModelManifest keeps a reference to Frozen content as a cache in case it is requested again.
This content Is discarded When some change occur on it.

Grasshopper.Rhinoceros.ModelManifest.EnableSynchronisedContent(System.Boolean)
Enables-disables synchronised content creation.
enable:
Returns: