Grasshopper.Kernel.Geometry.Node3List
Represents a list of (un)sorted nodes.

Grasshopper.Kernel.Geometry.Node3List.Append(Grasshopper.Kernel.Geometry.Node3)
Add a single node to this list. This will reset all sorting flags and caches.
node: Node to add

Grasshopper.Kernel.Geometry.Node3List.AppendRange(System.Collections.Generic.IEnumerable{Grasshopper.Kernel.Geometry.Node3})
Add a range of nodes to this list. This will reset all sorting flags and caches.
nodes: Nodes to add

Grasshopper.Kernel.Geometry.Node3List.Insert(System.Int32,Grasshopper.Kernel.Geometry.Node3)
Insert a single node into this list. This will reset all sorting flags and caches.
node: Node to add
index: Index at which to insert the node

Grasshopper.Kernel.Geometry.Node3List.InsertRange(System.Int32,System.Collections.Generic.IEnumerable{Grasshopper.Kernel.Geometry.Node3})
Insert a range of nodes into this list. This will reset all sorting flags and caches.
nodes: Nodes to add
index: Index at which insertion begins

Grasshopper.Kernel.Geometry.Node3List.Remove(Grasshopper.Kernel.Geometry.Node3)
Remove a single node from this list. Sorting flags are maintained but caches are destroyed.
node: Node to remove.
Returns: True on success, false if the provided Node does not occur in this list.

Grasshopper.Kernel.Geometry.Node3List.RemoveAt(System.Int32)
Remove the node at the specified index. Sorting flags are maintained but caches are destroyed.
index: Index of node to remove

Grasshopper.Kernel.Geometry.Node3List.Node(System.Int32)
Get or set a node. Be sure to call ExpireSequence() if your change affects sorting caches.
i: Index of node

Grasshopper.Kernel.Geometry.Node3List.Count
Get the number of nodes contained in this list.

Grasshopper.Kernel.Geometry.Node3List.Capacity
Gets or sets the capacity of this list (i.e. the number of items this list can contain without resizing)

Grasshopper.Kernel.Geometry.Node3List.CullDuplicates
Removes all duplicates from this list. It also removes ALL null references.

Grasshopper.Kernel.Geometry.Node3List.NullifyDuplicates
Set all duplicate nodes to NULL

Grasshopper.Kernel.Geometry.Node3List.CullNullRefs
Remove all null references from this list.

Grasshopper.Kernel.Geometry.Node3List.JitterNodes(System.Double)
Randomly mutate all node locations
amount: Maximum distance to move in x and y directions.

Grasshopper.Kernel.Geometry.Node3List.ExpireSequence
Call this method when you made a change that potentially invalidates the sorting flags and caches.

Grasshopper.Kernel.Geometry.Node3List.Sort(Grasshopper.Kernel.Geometry.Node3List.NodeListSort)
Sort the list using a sorting type.
type: Type of sorting algorithm.

Grasshopper.Kernel.Geometry.Node3List.RenumberNodes
Reset all indices of all nodes by renumbering them in their current order.
Nulls are ignored but they do affect the numbering.

Grasshopper.Kernel.Geometry.Node3List.NearestNodes(System.Double,System.Double,System.Double,System.Int32,System.Double,System.Double)
Perform a brute force node search for the N nearest nodes in the set.
x: X coordinate of search start.
y: Y coordinate of search start.
z: Z coordinate of search start.
N:
min_dist_squared: Minimum distance threshold, use any negative value to ignore this setting.
max_dist_squared: Maximum distance threshold.
Returns: The N (or fewer) results, sorted by ascending distance.

Grasshopper.Kernel.Geometry.Node3List.BoundingBox(System.Double,System.Boolean,System.Double@,System.Double@,System.Double@,System.Double@,System.Double@,System.Double@)
Compute the bounding box of all Nodes.
GrowthFactor: Factor by which to grow the boundingbox
ForceSquareLeaves: If True, the boundingbox will be renormalized

Grasshopper.Kernel.Geometry.Node3List.CreateTree(System.Double,System.Boolean,System.Int32)
Create a Node3Tree that contains all the Nodes in this list.
GrowthFactor: Factor by which to grow the boundingbox of the topmost Leaf
SquareLeaves: If True, the boundingbox will be normalized
GroupLimit: Maximum number of Nodes that are allowed to share a single Leaf