Grasshopper.Kernel.Special.GH_Relay
Represents a relay object for wire organisation.

Grasshopper.Kernel.Special.GH_Relay.ResolveDisplayName
Determine the display name from first principles, and
cause all upstream and downstread relays to also resolve
their name.

Grasshopper.Kernel.Special.GH_Relay.SafeDelete
Safely delete this relay and reconnect all wires.
This method does not trigger a new solution, nor does
it modify the document undo stack. Instead it returns a
list of all undo actions.

Grasshopper.Kernel.Special.GH_Relay.SafeDisconnect
Safely disconnect this relay and reconnect all wires.
This method does not trigger a new solution, nor does
it modify the document undo stack. Instead it returns a
list of all undo actions.

Grasshopper.Kernel.Special.GH_Relay.DisplayName
Gets or sets the display name to use for this relay.