Grasshopper.Kernel.Special.GH_Group
Represents a group of Grasshopper objects.

Grasshopper.Kernel.Special.GH_Group.ObjectIDs
Gets the list of all object IDs that are contained in this group.

Grasshopper.Kernel.Special.GH_Group.RemoveCyclicalGroups(System.Guid)
Iterate over all objects in this group, figure out if _they_ are groups,
then iterate over all objects in those groups etc. until we run out or find the specific ID.
id: Group instance id to search for.

Grasshopper.Kernel.Special.GH_Group.Objects
Gets the actual objects contained within this group.
The instance cache will be rebuild if it doesn't exist.

Grasshopper.Kernel.Special.GH_Group.ObjectsRecursive
Gets the objects contained in this group and all subgroups.

Grasshopper.Kernel.Special.GH_Group.Colour
Gets or sets the colour of this group.

Grasshopper.Kernel.Special.GH_Group.Border
Gets or sets the border style of the group object.

Grasshopper.Kernel.Special.GH_Group.EditMode
Gets or sets a value indicating whether or not this group is currently in Edit mode.
Edit Mode is currently not functional, but in future releases it is supposed to become
a state where objects can be removed from/added to a group.

Grasshopper.Kernel.Special.GH_Group.ContentBoxes
Recursively gets the boxes of the group content.
If the group contains another group with a border style = Blob,
the child group boxes will also be included.

Grasshopper.Kernel.Special.GH_Group.SolveContentBoxes(System.Collections.Generic.List{System.Drawing.RectangleF},System.Int32)
Recursive function used to collect content boundingboxes throughout a group-hierarchy.
cloud: List of boxes to grow.
inflate: Additional padding factor (in pixels) for every new level of groups.

Grasshopper.Kernel.Special.GH_Group.InstanceGuidsChanged(System.Collections.Generic.SortedDictionary{System.Guid,System.Guid})
Whenever the InstanceIDs of objects were changed, the group needs to be informed.
map: InstanceId map of before and after keys/values.

Grasshopper.Kernel.Special.GH_Group.GroupID
Defines the ID for group objects.

Grasshopper.Kernel.Special.GH_Group.ExpireCaches
Expire all display and instance caches. Call this function whenever you change the group.

Grasshopper.Kernel.Special.GH_Group.AddObject(System.Guid)
Add a new object to this group. The ID must represent a top-level object in the document that owns this group.
id: ID of object to include.

Grasshopper.Kernel.Special.GH_Group.RemoveObject(System.Guid)
Remove an object from this group.
id: ID of object to remove.