Grasshopper.Utility
Class with useful static methods.

Grasshopper.Utility.#ctor
This class only provids static (Shared in VB) methods and cannot be constructed.

Grasshopper.Utility.DocumentTolerance
Returns the Absolute Tolerance of the model document
Returns:

Grasshopper.Utility.DocumentAngleTolerance
Returns the Angle Tolerance in degrees for the model document
Returns:

Grasshopper.Utility.DocumentUnits
Returns the unit system for the model document
Returns:

Grasshopper.Utility.SetDefaultTolerances(System.Double,System.Double)
Utility function to set absolute and angle tolerance fields.
absoluteTolerance: Value to set model absolute tolerance
angleToleranceDegrees: Value to set model angle tolerance in degrees

Grasshopper.Utility.SetDefaultUnits(System.String)
Utility function to set model unit fields
modelUnits: Value to set default model units

Grasshopper.Utility.TernaryIf``1(System.Boolean,``0,``0)
Type safe implementation of the IIf conditional statement.
Type of statement.
condition: If True, A is returned.
A: Value to return when condition evaluates to true.
B: Value to return when condition evaluates to false.

Grasshopper.Utility.LikeOperator(System.String,System.String)
Exposes the VB.NET Like operator as a static method.

Grasshopper.Utility.InvokeMethod(System.Object,System.String)
Call a method via its name.
target: Object to invoke on.
method: Name of method to invoke.
Returns: The return value of the method.

Grasshopper.Utility.InvokeMethod(System.Object,System.String,System.Object[])
Call a method via its name.
target: Object to invoke on.
method: Name of method to invoke.
params: Arguments for method.
Returns: The return value of the method.

Grasshopper.Utility.InvokeMethodSafe(System.Object,System.String)
Call a method via its name. No exceptions are thrown.
target: Object to invoke on.
method: Name of method to invoke.
Returns: The return value of the method.

Grasshopper.Utility.InvokeMethodSafe(System.Object,System.String,System.Object[])
Call a method via its name. No exceptions are thrown.
target: Object to invoke on.
method: Name of method to invoke.
params: Arguments for method.
Returns: The return value of the method.

Grasshopper.Utility.InvokeGetter(System.Object,System.String)
Call a getter property via its name.
target: Object to invoke on.
property: Name of property to invoke.
Returns: The return value of the method.

Grasshopper.Utility.InvokeGetterSafe(System.Object,System.String)
Call a getter property via its name.  No exceptions are thrown.
target: Object to invoke on.
property: Name of property to invoke.
Returns: The return value of the method.

Grasshopper.Utility.InvokeSetter(System.Object,System.String,System.Object)
Call a setter property via its name.
target: Object to invoke on.
property: Name of property to invoke.

Grasshopper.Utility.InvokeSetterSafe(System.Object,System.String,System.Object)
Call a setter property via its name.  No exceptions are thrown.
target: Object to invoke on.
property: Name of property to invoke.

Grasshopper.Utility.InvokeDownloader(System.String,System.String,System.Boolean)
Start an asynchronous download operation.
The download runs in a separate appdomain. After triggering that process this method returns immediately.
sourceUri: Uri of data to download.
targetUri: Uri of file on local disk where to store downloaded data.
silent: If true the download will not display any user interface.

Grasshopper.Utility.FixNewlines(System.String)
Make sure all newlines in a string adhere to the current platform standard.
text: Text to fix.

Grasshopper.Utility.FixNewlines(System.String,System.String)
Make sure all newlines in a string have a specific pattern.
text: Text to fix.
newLinePattern: Newline string to use.
Returns: Fixed string