Grasshopper.GUI.Base.GH_DigitScrollerEventArgs
Arguments passed via GH_digitScrollerBase.ValueChanged events.

Grasshopper.GUI.Base.GH_DigitScrollerEventArgs.Scroller
Gets the instance of the scroller that raised the event.

Grasshopper.GUI.Base.GH_DigitScrollerEventArgs.Value
Gets the new value of the slider. This value is cached, so even if the
slider subsequently updates, this property remains constant.

Grasshopper.GUI.Base.GH_DigitScrollerEventArgs.Intermediate
Gets a value indicating whether the change was an intermediate one.