Grasshopper.Kernel.IGH_Author
Provides of collection of basic author details.

Grasshopper.Kernel.IGH_Author.Name
Gets the name of the author.

Grasshopper.Kernel.IGH_Author.Email
Gets the email of the author.

Grasshopper.Kernel.IGH_Author.Phone
Gets the phone number of the author.

Grasshopper.Kernel.IGH_Author.Company
Gets the Company name of the author.

Grasshopper.Kernel.IGH_Author.Address
Gets the address of the author.

Grasshopper.Kernel.IGH_Author.Website
Gets the website of the author.

Grasshopper.Kernel.IGH_Author.Copyright
Gets the copyright message for these details.

Grasshopper.Kernel.IGH_Author.IsEmpty
Gets whether any data has been assigned to this object.