Grasshopper.Folders
Provides access to all standard Grasshopper file and folder locations.

Grasshopper.Folders.#ctor
This class only exposes static (Shared in VB) methods and cannot be constructed.

Grasshopper.Folders.ShowFolderInExplorer(System.String)
Open a specific folder in Windows Explorer.

Grasshopper.Folders.AppDataFolder
Gets the appdata folder for Grasshopper.

Grasshopper.Folders.PluginFolder
Gets the directory that contains the Grasshopper.dll file.

Grasshopper.Folders.Desktop
Gets the desktop directory of the current user profile.

Grasshopper.Folders.TutorialFiles
Gets an array of all the tutorial files.
This includes all the files with the *.gh or *.ghx extension
in the Tutorials folder. Subfolders are not traversed.

Grasshopper.Folders.FileViewerApplication
Gets the location where the FileViewer.exe should be.
If the application is not present, null is returned.

Grasshopper.Folders.ImageStitcherApplication
Gets the location where the ImageStitcher.exe should be.
If the application is not present, null is returned.

Grasshopper.Folders.DownloaderApplication
Gets the location where the Downloader.exe should be.
If the application is not present, null is returned.

Grasshopper.Folders.SDKDownloaderApplication
Gets the location where the SDKDownloader.exe should be.
If the application is not present, null is returned.

Grasshopper.Folders.VersionHistoryUrl
Gets the url of the version history data.

Grasshopper.Folders.VersionHistoryFile
Gets the text file location where Grasshopper will save the latest version information.

Grasshopper.Folders.SettingsFolder
Gets the folder into which all Grasshopper settings are stored.
This folder might not exist until some settings are actually saved.

Grasshopper.Folders.ToolsFolder
Gets the directory that contains the additional executables that ship with Grasshopper.

Grasshopper.Folders.IconFolder
Gets the directory that contains the icon files that ship with Grasshopper.

Grasshopper.Folders.CursorFolder
Gets the directory that contains the cursor files that ship with Grasshopper.

Grasshopper.Folders.TutorialFolder
Gets the directory that contains the tutorial files that ship with Grasshopper.

Grasshopper.Folders.AutoSaveFolder
Gets the directory in windows ApplicationData that contains the Grasshopper autosave files.
Returns: A directory path.

Grasshopper.Folders.DefaultAssemblyFolder
Gets the standard directory in windows ApplicationData that contains 3rd party GHA files.
Returns: A directory path.

Grasshopper.Folders.DefaultAssemblyFolderVersion6
Gets the standard directory in windows ApplicationData that contains 3rd party GHA files on v6.
Returns: A directory path.

Grasshopper.Folders.DefaultAssemblyFolderVersion7
Gets the standard directory in windows ApplicationData that contains 3rd party GHA files on v7.
Returns: A directory path.

Grasshopper.Folders.DefaultUserObjectFolder
Gets the standard directory in windows ApplicationData that contains GHUSER files.
Returns: A directory path.

Grasshopper.Folders.DefaultClusterFolder
Gets the standard directory in windows ApplicationData that contains GHCLUSTER files.
Returns: A directory path.

Grasshopper.Folders.DefaultTemplateFolder
Gets the standard directory in windows ApplicationData that contains template files.
Returns: A directory path.

Grasshopper.Folders.CustomAssemblyFolders
Gets or sets all custom assembly folders.

Grasshopper.Folders.AssemblyFolders
Gets a list of all the directories from which GHA assemblies are loaded.
Note: this is not the same as all folders from which GHA files were loaded at startup.
This list includes the default Grasshopper folders, custom GHA folders and the locations
provided by Rhino.Runtime.HostUtils.GetAssemblySearchPaths().
Folders which do not contain GHA files are omitted, as are duplicate entries.
Returns: A list of load target directories.

Grasshopper.Folders.UserObjectFolders
Gets a list of all the directories from which GHUSER files are loaded.
GHUSER files are loaded from subfolders as well.
Returns: A list of load target directories.

Grasshopper.Folders.ClusterFolders
Gets a list of all the directories from which GHCLUSTER files are loaded.
GHUSER files are loaded from subfolders as well.
Returns: A list of load target directories.

Grasshopper.Folders.TemplateFolders
Gets a list of all the directories from which template files are loaded.
Templates are not loaded from subfolders.
Returns: A list of load target directories.

Grasshopper.Folders.ContainsFiles(System.String,System.String,System.IO.SearchOption)
Test whether a certain folder contains a certain kind of file.
folder: Folder to search.
mask: File name mask.
search: File search option.

Grasshopper.Folders.RemoveDuplicateEntries(System.Collections.Generic.List{System.String})
Remove all duplicate entries from a list of strings.