Grasshopper.Kernel.Types.GH_Arc
Represents a 3D circular arc. GH_Arc re-implements the OpenNURBS OnArc class.

Grasshopper.Kernel.Types.GH_Arc.#ctor
Default constructor

Grasshopper.Kernel.Types.GH_Arc.#ctor(Rhino.Geometry.Arc)
Create a duplicate of another arc
arc: Arc to copy. If null, a default arc will be created.

Grasshopper.Kernel.Types.GH_Arc.#ctor(Grasshopper.Kernel.Types.GH_Arc)
Create a duplicate of another arc
other: Arc to copy. If null, a default arc will be created.

Grasshopper.Kernel.Types.GH_Arc.DuplicateGeometry
Create a duplicate of this arc.

Grasshopper.Kernel.Types.GH_Arc.DuplicateArc
Create a duplicate of this arc.

Grasshopper.Kernel.Types.GH_Arc.IsValid
Gets the validity of this instance.

Grasshopper.Kernel.Types.GH_Arc.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Kernel.Types.GH_Arc.Boundingbox
Gets the boundingbox for this geometry.
Returns: The boundingbox for this piece of geometry or
Boundingbox.Empty if the geometry is null or invalid.

Grasshopper.Kernel.Types.GH_Arc.EmitProxy
Returns a proxy that represents this arc. Do not call this function unless you're