Grasshopper.Kernel.GH_MarkovChain
Represents a database with multi-depth markov chains.

Grasshopper.Kernel.GH_MarkovChain.Level1
Gets all level 1 patterns stored in this chain database.

Grasshopper.Kernel.GH_MarkovChain.Level2
Gets all level 2 patterns stored in this chain database.

Grasshopper.Kernel.GH_MarkovChain.Level3
Gets all level 3 patterns stored in this chain database.

Grasshopper.Kernel.GH_MarkovChain.PatternCount
Gets the total number of patterns stored in this database.

Grasshopper.Kernel.GH_MarkovChain.AppendPattern(Grasshopper.Kernel.GH_MarkovPattern)
Append a new pattern to the database or grow a pattern which already exists.
pattern: Pattern to incorporate.

Grasshopper.Kernel.GH_MarkovChain.ExtendHistory(System.Guid)
Append a new ID to the history record and cache the implied pattern.
new_id: Most recent ID in history.

Grasshopper.Kernel.GH_MarkovChain.Description
Gets a description of the entire Markov database.

Grasshopper.Kernel.GH_MarkovChain.Clear
Reset the markov database.

Grasshopper.Kernel.GH_MarkovChain.SuggestEvents
Suggests the likely future events based on the past three events and the recorded history.
Events are returned in order of likelyhood.

Grasshopper.Kernel.GH_MarkovChain.FindPattern(System.Guid)
Finds the pattern in the level 1 chain that matches the given ID.

Grasshopper.Kernel.GH_MarkovChain.FindPattern(System.Guid,System.Guid)
Finds the pattern in the level 2 chain that matches the given ID.

Grasshopper.Kernel.GH_MarkovChain.FindPattern(System.Guid,System.Guid,System.Guid)
Finds the pattern in the level 3 chain that matches the given ID.

Grasshopper.Kernel.GH_MarkovChain.ReduceDataset
Reduce the data set by removing the least significant members.

Grasshopper.Kernel.GH_MarkovChain.WriteToDisc
Write the Markov database to disc.

Grasshopper.Kernel.GH_MarkovChain.ReadFromDisc
Read the markov database from the disc.