Grasshopper.GUI.Canvas.IGH_TooltipAwareObject
Implement this interface if you want your object to participate in Grasshopper Canvas tooltips.

Grasshopper.GUI.Canvas.IGH_TooltipAwareObject.TooltipEnabled
Gets the tooltip enabled value. If False, no further tooltip functions will be called.

Grasshopper.GUI.Canvas.IGH_TooltipAwareObject.IsTooltipRegion(System.Drawing.PointF)
Determine whether the specified pixel should result in a tooltip when the cursor hovers over it.
canvasPoint: Point in Canvas coordinates.

Grasshopper.GUI.Canvas.IGH_TooltipAwareObject.SetupTooltip(System.Drawing.PointF,Grasshopper.GUI.GH_TooltipDisplayEventArgs)
This function is called when a tooltip it about to be displayed.
canvasPoint: The pixel coordinate on the canvas of the cursor.
e: Tooltip display arguments.