Grasshopper.GUI.Base.GH_SliderRailDisplay
Enumerates the possible slider rail displays.

Grasshopper.GUI.Base.GH_SliderRailDisplay.None
No rail is drawn.

Grasshopper.GUI.Base.GH_SliderRailDisplay.Simple
A rail consisting of a single line is drawn.

Grasshopper.GUI.Base.GH_SliderRailDisplay.Etched
A rail consisting of an etched line is drawn.

Grasshopper.GUI.Base.GH_SliderRailDisplay.Filled
A thick rail with a filled out left portion is drawn.