Grasshopper.Kernel.Types.GH_SubD
Represents a 3D subdivision surface.

Grasshopper.Kernel.Types.GH_SubD.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.