Grasshopper.Kernel.Undo.GH_UndoServer
Provides access to a documents undo data.

Grasshopper.Kernel.Undo.GH_UndoServer.MaxRecords
Gets or sets the maximum number of undo records that can be stored.
Remarks: The number of redo records is logically limited to the same number. THIS SETTING IS CURRENTLY IGNORED

Grasshopper.Kernel.Undo.GH_UndoServer.UndoCount
Number of undo records currently in the stack.

Grasshopper.Kernel.Undo.GH_UndoServer.RedoCount
Number of redo records currently in the stack.

Grasshopper.Kernel.Undo.GH_UndoServer.FirstUndoName
Gets the name of the last item in the undo stack (the first item to be undone).

Grasshopper.Kernel.Undo.GH_UndoServer.FirstRedoName
Gets the name of the last item in the redo stack (the first item to be redone).

Grasshopper.Kernel.Undo.GH_UndoServer.UndoGuids
Gets a sorted list of all the undo Guids in this server.

Grasshopper.Kernel.Undo.GH_UndoServer.UndoNames
Gets a sorted list of all the undo Guids in this server.

Grasshopper.Kernel.Undo.GH_UndoServer.RedoGuids
Gets a sorted list of all the redo Guids in this server.

Grasshopper.Kernel.Undo.GH_UndoServer.RedoNames
Gets a sorted list of all the redo Guids in this server.

Grasshopper.Kernel.Undo.GH_UndoServer.FindRecord(System.Guid)
Find the record with the given ID.
id: Record ID to search for.
Returns: The record with a matching ID or null if no such record could be found.

Grasshopper.Kernel.Undo.GH_UndoServer.UndoRecords
Gets the internal list of undo records.

Grasshopper.Kernel.Undo.GH_UndoServer.RedoRecords
Gets the internal list of redo records.

Grasshopper.Kernel.Undo.GH_UndoServer.RemoveRecord(System.Guid)
Remove the record with the specified ID from the undo or redo stack.
id: ID of record to remove.
Returns: True on success, false on failure.

Grasshopper.Kernel.Undo.GH_UndoServer.Clear
Clear both undo and redo lists.

Grasshopper.Kernel.Undo.GH_UndoServer.ClearRedo
Clear the undo list.

Grasshopper.Kernel.Undo.GH_UndoServer.ClearUndo
Clear the redo list.
Remarks:

Grasshopper.Kernel.Undo.GH_UndoServer.MergeRecords(System.Int32)
Attempt to merge the N most recent records into one.
The name of the merged record will be identical to the
name of the oldest record.
count: Number of most recent records to merge.
Returns: True if merge was successful.

Grasshopper.Kernel.Undo.GH_UndoServer.PushUndoRecord(Grasshopper.Kernel.Undo.GH_UndoRecord)
Add a new undo record to the undo stack, this function clears the Redo stack.
record: Record to add.

Grasshopper.Kernel.Undo.GH_UndoServer.PushUndoRecord(System.String,Grasshopper.Kernel.Undo.GH_UndoAction)
Add a new undo record to the undo stack, this function clears the Redo stack.
name: Name of undo record.
action: Undo action.
Returns: The ID of the newly created undo record.

Grasshopper.Kernel.Undo.GH_UndoServer.PopUndoRecord
Pops the most recent undo record. Do this if you think that the last undo record is bogus.

Grasshopper.Kernel.Undo.GH_UndoServer.PushRedoRecord(Grasshopper.Kernel.Undo.GH_UndoRecord)
Push another record onto the redo stack.
record: Record to push

Grasshopper.Kernel.Undo.GH_UndoServer.PopRedoRecord
Push another record onto the redo stack.
Returns: The popped record or null if the redo stack was already empty.

Grasshopper.Kernel.Undo.GH_UndoServer.PerformUndo
Performs a single Undo step when possible and migrates the record onto the redo stack.
This function may throw all kinds of exceptions, if you're calling it from a UI thread,
use a Try..Catch block to prevent crashes.

Grasshopper.Kernel.Undo.GH_UndoServer.PerformRedo
Performs a single Redo step if possible and migrates the record onto the undo stack.
This function may throw all kinds of exceptions, if you're calling it from a UI thread,
use a Try..Catch block to prevent crashes.

Grasshopper.Kernel.Undo.GH_UndoServer.PerformUndo(System.Guid)
Performs a single Undo step when possible and migrates the record onto the redo stack.
This function may throw all kinds of exceptions, if you're calling it from a UI thread,
use a Try..Catch block to prevent crashes.
id: ID of record to undo.

Grasshopper.Kernel.Undo.GH_UndoServer.PerformRedo(System.Guid)
Performs a single Redo step when possible and migrates the record onto the undo stack.
This function may throw all kinds of exceptions, if you're calling it from a UI thread,
use a Try..Catch block to prevent crashes.
id: ID of record to redo.