Grasshopper.Kernel.GH_PreviewMeshArgs
This class is passed to objects that implement IGH_PreviewData during mesh drawing operations.

Grasshopper.Kernel.GH_PreviewMeshArgs.Viewport
Gets the Viewport in which we're currently drawing.

Grasshopper.Kernel.GH_PreviewMeshArgs.Pipeline
Gets the Display Pipeline we're currently drawing with.

Grasshopper.Kernel.GH_PreviewMeshArgs.Material
Gets the material in which meshes ought to be drawn.

Grasshopper.Kernel.GH_PreviewMeshArgs.MeshingParameters
Gets the meshing parameters which ought to be used for meshing breps and surfaces.
If this property returns a null reference, meshes are supposed to be omitted.