Grasshopper.GUI.Ribbon.GH_LayoutPanel
Represents a panel on a ribbon layout.

Grasshopper.GUI.Ribbon.GH_LayoutPanel.#ctor
Create a new blank Panel

Grasshopper.GUI.Ribbon.GH_LayoutPanel.#ctor(System.String)
Create a new empty Panel.
name: Name of panel.

Grasshopper.GUI.Ribbon.GH_LayoutPanel.#ctor(Grasshopper.GUI.Ribbon.GH_LayoutPanel)
Duplicate another Panel.
other: Panel to duplicate

Grasshopper.GUI.Ribbon.GH_LayoutPanel.Name
Gets or sets the name of this panel.
Panels must have a non-zero name or they will be "unnamed".

Grasshopper.GUI.Ribbon.GH_LayoutPanel.Items
Gets the list of Items for this tab.

Grasshopper.GUI.Ribbon.GH_LayoutPanel.Sort
Sort all items in this panel based on name.