Grasshopper.Kernel.Parameters.Param_Number


Grasshopper.Kernel.Parameters.Param_Number.AngleParameter
Gets or sets a value indicating whether this parameter behaves as an angle.
If IsAngleParameter = True, then a Degrees/Radians option will be available in the menu.

Grasshopper.Kernel.Parameters.Param_Number.UseDegrees
Gets or sets whether this parameter uses degrees instead of radians.