Grasshopper.GUI.Canvas.GH_CanvasDocumentChangedEventArgs
These arguments are used in the DocumentChanged event on GH_Canvas.

Grasshopper.GUI.Canvas.GH_CanvasDocumentChangedEventArgs.NewDocument
Gets the document which has just been loaded into the canvas.

Grasshopper.GUI.Canvas.GH_CanvasDocumentChangedEventArgs.OldDocument
Gets the document which was previously loaded into the canvas.