Grasshopper.Kernel.GH_GHXHarvester
Provides static methods for harvesting data from GHX and GH files.

Grasshopper.Kernel.GH_GHXHarvester.#ctor
This class only provides static (Shared in VB) methods and cannot be constructed.

Grasshopper.Kernel.GH_GHXHarvester.HarvestPivots(System.String)
Harvest all attribute pivots from a GHX/GH archive.
file: File to parse.
Returns: A list of all attribute pivots or null on failure.

Grasshopper.Kernel.GH_GHXHarvester.HarvestPivots(GH_IO.Serialization.GH_Archive)
Harvest all attribute pivots from a GHX/GH archive.
archive: Archive to parse.
Returns: A list of all attribute pivots or null on failure.

Grasshopper.Kernel.GH_GHXHarvester.HarvestPivots(GH_IO.Serialization.GH_IReader)
Harvest all attribute pivots from a GHX/GH node.
node: Node to parse.
Returns: A list of all attribute pivots or null on failure.

Grasshopper.Kernel.GH_GHXHarvester.HarvestBoundingBoxes(System.String)
Harvest all attribute bounding boxes from a GHX/GH archive.
file: File to parse.
Returns: A list of all attribute bounding boxes or null on failure.

Grasshopper.Kernel.GH_GHXHarvester.HarvestBoundingBoxes(GH_IO.Serialization.GH_Archive)
Harvest all attribute bounding boxes from a GHX/GH archive.
archive: Archive to parse.
Returns: A list of all attribute bounding boxes or null on failure.

Grasshopper.Kernel.GH_GHXHarvester.HarvestBoundingBoxes(GH_IO.Serialization.GH_IReader)
Harvest all attribute bounding boxes from a GHX/GH node.
node: Node to parse.
Returns: A list of all attribute bounding boxes or null on failure.