Grasshopper.Kernel.GH_ExternalFileType
Enumerates the possible external files that Grasshopper is interested in.

Grasshopper.Kernel.GH_ExternalFileType.Unknown
Unknown (invalid) file type.

Grasshopper.Kernel.GH_ExternalFileType.Assembly
File represents a GHA assembly.
Remarks:

Grasshopper.Kernel.GH_ExternalFileType.UserObject
File represents a GHUSER archive.

Grasshopper.Kernel.GH_ExternalFileType.Cluster
File represents a GHCLUSTER archive.