Grasshopper.Kernel.GH_StateServer
Maintains all the recorded states for this document.

Grasshopper.Kernel.GH_StateServer.Names
Gets a list of all the state names in this server.

Grasshopper.Kernel.GH_StateServer.Owner
Gets the document that owns this server.

Grasshopper.Kernel.GH_StateServer.NewStateFromDocument
Displays UI for new state creation. If the user aborts, then null is returned.
If the user successfully defines a new state, it is appended to this server.

Grasshopper.Kernel.GH_StateServer.RestoreState(System.String,System.Int32@,System.Int32@)
Restore a certain state.
name: Name of state to restore. Name is case-sensitive.
restored_objects: Number of objects successfully restored.
missing_objects: Number of objects that could not be found.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_StateServer.RestoreState(System.Int32,System.Int32@,System.Int32@)
Restore a certain state.
index: Index of state to restore.
restored_objects: Number of objects successfully restored.
missing_objects: Number of objects that could not be found.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_StateServer.RestoreState(System.Int32,System.Boolean,System.Int32@,System.Int32@)
Restore a certain state.
index: Index of state to restore.
recompute: If True, a new solution will be started right away.
restored_objects: Number of objects successfully restored.
missing_objects: Number of objects that could not be found.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_StateServer.RemoveState(System.Int32)
Remove a certain state. This method adds an undo record to the document.
index: Index of state to remove.
Returns: True on success, false on failure.