Grasshopper.GUI.Canvas.GH_CanvasValidator
Abstract implementation of IGH_CanvasValidator.
Inherit from this class rather than implementing IGH_CanvasValidator from scratch.

Grasshopper.GUI.Canvas.GH_CanvasValidator.Canvas
Gets the canvas this validator is associated with.

Grasshopper.GUI.Canvas.GH_CanvasValidator.Document
Gets the document (if it exists) that is currently loaded in the canvas.

Grasshopper.GUI.Canvas.GH_CanvasValidator.AddedToCanvas(Grasshopper.GUI.Canvas.GH_Canvas)
Override this method if you want to be informed when this validator gets assigned to a canvas.
But *always* call the base class method.

Grasshopper.GUI.Canvas.GH_CanvasValidator.RemovedFromCanvas(Grasshopper.GUI.Canvas.GH_Canvas)
Override this method if you want to be informed when this validator gets removed from a canvas.
But *always* call the base class method.