Grasshopper.Kernel.Data.GH_IndexRuleType
Enumerates the pre-defined index rule types.

Grasshopper.Kernel.Data.GH_IndexRuleType.None
Represents no rule.

Grasshopper.Kernel.Data.GH_IndexRuleType.Digit
Match a specific digit.

Grasshopper.Kernel.Data.GH_IndexRuleType.Range
Match a specific range.

Grasshopper.Kernel.Data.GH_IndexRuleType.RepeatingDigitPattern
Match a specific repeating digit pattern.

Grasshopper.Kernel.Data.GH_IndexRuleType.RepeatingRangePattern
Match a specific repeating range pattern.

Grasshopper.Kernel.Data.GH_IndexRuleType.AnyDigit
Match any one digit.

Grasshopper.Kernel.Data.GH_IndexRuleType.AnyDigits
Match any number of digits.