Grasshopper.Kernel.GH_UndoOperation
Enumerates all possible types of undo operation.

Grasshopper.Kernel.GH_UndoOperation.ClearUndoStack
The stack with all undo records has been cleared.

Grasshopper.Kernel.GH_UndoOperation.ClearRedoStack
The stack with all redo records has been cleared.
This always happens when a new undo record is added.

Grasshopper.Kernel.GH_UndoOperation.RecordAdded
A new undo record is added to the list.
There will be a ClearRedoStack event after this one.

Grasshopper.Kernel.GH_UndoOperation.RecordRemoved
A specific record has been deleted. This is not a typical operation
and is usually due to user intervention. Removal can occur from both
the undo and the redo stack.

Grasshopper.Kernel.GH_UndoOperation.Undo
An undo operation was successfully completed.
This means a record has been moved from the undo
stack to the redo stack.

Grasshopper.Kernel.GH_UndoOperation.Redo
A redo operation was successfully completed.
This means a record has been moved from the redo
stack back onto the undo stack.
This does not count as a RecordAdded operation.