Grasshopper.Plugin.Commands
Contains command logic for all standard Grasshopper commands.

Grasshopper.Plugin.Commands.Run_Grasshopper
Run the _Grasshopper command logic.
Returns: True on success, false on failure.

Grasshopper.Plugin.Commands.Run_GrasshopperScripted
Run the -_Grasshopper command logic (the scripted version).
Returns: True on success, false on failure.

Grasshopper.Plugin.Commands.Run_GrasshopperOpen
Run the GrasshopperOpen command logic.
Returns: True if a file was opened.

Grasshopper.Plugin.Commands.Run_GrasshopperDeveloperSettings
Run the _GrasshopperDeveloperSettings command logic.
Returns: True on success, false on failure.

Grasshopper.Plugin.Commands.Run_GrasshopperUnloadPlugin
Run the _GrasshopperUnloadPlugin command logic.
Returns: True on success, false on failure.

Grasshopper.Plugin.Commands.Run_GrasshopperReloadAssemblies
Run the _GrasshopperReloadMemoryAssemblies command logic.
Returns: List of assemblies that were reloaded.

Grasshopper.Plugin.Commands.Run_GrasshopperExportHelp
Run the _GrasshopperExportHelp command logic.
Returns: True on success, false on failure.

Grasshopper.Plugin.Commands.Run_GrasshopperGetSDKDocumentation
Run the _GrasshopperDownloadSDKDocumentation command logic.
Returns: True on success, false on failure.

Grasshopper.Plugin.Commands.Run_GrasshopperBake
Run the _GrasshopperBake command logic.
This command requires either the BakeDocument or the BakeObject fields to be set.
This command is typically run from within the Grasshopper GUI, it should be hidden from the user.
Returns: True on success, false on failure. (Redraw required on success)

Grasshopper.Plugin.Commands.Run_GrasshopperFolders
Run the _GrasshopperFolder command.
Returns: True on success, false on cancel.

Grasshopper.Plugin.Commands.m_bake_doc


Grasshopper.Plugin.Commands.m_bake_obj


Grasshopper.Plugin.Commands.BakeDocument
Gets or sets the document that will be baked. If you set the document,
default Bake behaviour kicks in and all selected objects will be baked.

Grasshopper.Plugin.Commands.BakeObject
Gets or sets the active object for baking operations.
If you do not set a document, then you can choose to set the active object.
Specific bake behaviour kicks in.