Grasshopper.Kernel.Geometry.Node2Leaf
Represents a single element in a recursive quad-tree Node structure.

Grasshopper.Kernel.Geometry.Node2Leaf.#ctor
Blank constructor

Grasshopper.Kernel.Geometry.Node2Leaf.#ctor(System.Double,System.Double,System.Double,System.Double)
Box constructor. Create an empty leaf with a specific box.

Grasshopper.Kernel.Geometry.Node2Leaf.#ctor(Grasshopper.Kernel.Geometry.Node2Leaf)
Copy constructor
other: Leaf to mimic

Grasshopper.Kernel.Geometry.Node2Leaf.Nodes
Gets the indices of all nodes which are contained in this leaf.

Grasshopper.Kernel.Geometry.Node2Leaf.SubDivide(Grasshopper.Kernel.Geometry.Node2List,System.Collections.Generic.List{System.Int32},System.Int32)
Builds a subtree from a Node list.
nodes: All the nodes that are supposed to be included in this tree.
index_subset: A subset of nodes on which to perform the subdivision. Pass a null-pointer to use ALL nodes.
If the list is not null, used indices will be extracted from the list, in order to reduce the number of pointless inclusion tests.
group_limit: The number of allowed Nodes per Leaf. If a Leaf contains more than N nodes, it will subdivide.

Grasshopper.Kernel.Geometry.Node2Leaf.x_min
Gets the left bounary of the Leaf space.

Grasshopper.Kernel.Geometry.Node2Leaf.x_max
Gets the right bounary of the Leaf space.

Grasshopper.Kernel.Geometry.Node2Leaf.y_min
Gets the bottom bounary of the Leaf space.

Grasshopper.Kernel.Geometry.Node2Leaf.y_max
Gets the top bounary of the Leaf space.

Grasshopper.Kernel.Geometry.Node2Leaf.x_mid
Gets the vertical center axis of the Leaf space.

Grasshopper.Kernel.Geometry.Node2Leaf.y_mid
Gets the horizontal center axis of the Leaf space.

Grasshopper.Kernel.Geometry.Node2Leaf.SolveProximity(Grasshopper.Kernel.Geometry.Node2List,Grasshopper.Kernel.Geometry.Node2Proximity)
Recursive method that solves a proximity search.
nodes: Node set to search
prox: Proximity object to search with