Grasshopper.Kernel.Types.IGH_GeometricGoo
Base interface for all Data inside Grasshoper that could pass for Geometry

Grasshopper.Kernel.Types.IGH_GeometricGoo.DuplicateGeometry
Make a complete duplicate of this geometry. No shallow copies.
Remarks: Each class that implements this interface should also provide a type specific duplication method

Grasshopper.Kernel.Types.IGH_GeometricGoo.Boundingbox
Gets the (cached) boundingbox for this geometry.
Not all geometry types cache boundingbox results.
Returns: The boundingbox for this piece of geometry or
Boundingbox.Empty if the geometry is null or invalid.

Grasshopper.Kernel.Types.IGH_GeometricGoo.GetBoundingBox(Rhino.Geometry.Transform)
Compute an aligned boundingbox.
xform: Transformation to apply to geometry for BoundingBox computation.
Returns: The world aligned boundingbox of the transformed geometry.

Grasshopper.Kernel.Types.IGH_GeometricGoo.Transform(Rhino.Geometry.Transform)
Transforms the object or a deformable representation of the object.
xform: Transformation matrix.
Returns: Transformed geometry. If the local geometry can be transformed accurately,
then the returned instance equals this instance. Not all geometry types can be accurately
transformed under all circumstances though, if this is the case, this function will
return an instance of another IGH_GeometricGoo derived type which can be transformed.

Grasshopper.Kernel.Types.IGH_GeometricGoo.Morph(Rhino.Geometry.SpaceMorph)
Morph the object or a deformable representation of the object.
xmorph: Spatial deform.
Returns: Deformed geometry. If the local geometry can be deformed accurately,
then the returned instance equals this instance. Not all geometry types can be accurately
deformed though, if this is the case, this function will
return an instance of another IGH_GeometricGoo derived type which can be deformed.

Grasshopper.Kernel.Types.IGH_GeometricGoo.ReferenceID
Gets or sets the Guid of the object that is referenced.
Not all IGH_GeometricGoo implementations support referenced geometry.

Grasshopper.Kernel.Types.IGH_GeometricGoo.IsReferencedGeometry
Gets a value indicating whether or not this geometry is referenced.
Not all IGH_GeometricGoo implementations support referenced geometry.

Grasshopper.Kernel.Types.IGH_GeometricGoo.IsGeometryLoaded
Gets a value indicating whether or not this geometry is currently loaded (assuming it is referenced).
Not all IGH_GeometricGoo implementations support referenced geometry.

Grasshopper.Kernel.Types.IGH_GeometricGoo.LoadGeometry
If the geometry is referenced and currently unloaded, forces loading of the geometry.
Not all IGH_GeometricGoo implementations support referenced geometry.

Grasshopper.Kernel.Types.IGH_GeometricGoo.LoadGeometry(Rhino.RhinoDoc)
If the geometry is referenced and currently unloaded, forces loading of the geometry.
Not all IGH_GeometricGoo implementations support referenced geometry.
doc: Document to use for loading.

Grasshopper.Kernel.Types.IGH_GeometricGoo.ClearCaches
Clears all caches. Typically if the geometry is referenced, this will erase the local copy.