Grasshopper.Kernel.Special.GH_ValueListItem


Grasshopper.Kernel.Special.GH_ValueListItem.Selected
Gets or sets whether this item is selected.

Grasshopper.Kernel.Special.GH_ValueListItem.Name
Gets or sets the name of this constant.

Grasshopper.Kernel.Special.GH_ValueListItem.Expression
Gets or sets the expression of this constant.
If you set the expression through this property you must also expire the Value.

Grasshopper.Kernel.Special.GH_ValueListItem.BoxName
Gets or sets the bounds for the name of this item.
Item bounds are used and maintained by the Attributes of the ValueList object.

Grasshopper.Kernel.Special.GH_ValueListItem.BoxLeft
Gets or sets the bounds for the U area to the left of this item.
Item bounds are used and maintained by the Attributes of the ValueList object.

Grasshopper.Kernel.Special.GH_ValueListItem.BoxRight
Gets or sets the bounds for the U area to the right of this item.
Item bounds are used and maintained by the Attributes of the ValueList object.

Grasshopper.Kernel.Special.GH_ValueListItem.Value
Gets the (cached) result of this constant

Grasshopper.Kernel.Special.GH_ValueListItem.ExpireValue
Expires the cached value. Call this method if you have reason to believe
that the current value is no longer valid.

Grasshopper.Kernel.Special.GH_ValueListItem.IsVisible
Gets whether this item is visible, i.e. if the NameBox has a height larger than zero.