Grasshopper.GUI.GH_SettingsCategory
Base implementation of IGH_SettingsCategory.
Derive from this class and provide an empty constructor to play ball.

Grasshopper.GUI.GH_SettingsCategory.#ctor(System.String,System.Drawing.Bitmap)
Create a new top-level category.
name: Category name, keep it short.
icon: Category icon. If you supply an icon, it must be 48x48 pixels.
If you supply a null instance, a generic Settings icon will be assigned.

Grasshopper.GUI.GH_SettingsCategory.#ctor(System.String,System.String,System.Drawing.Bitmap)
Create a new nested category.
name: Category name, keep it short.
parent: Name of parent category. If the parent category hasn't been defined,
the category will be placed under a "Misc" category.
icon: Category icon. If you supply an icon, it must be 48x48 pixels.
If you supply a null instance, a generic Settings icon will be assigned.