Grasshopper.GUI.GH_GooProxyList.DataItem.Path
Path this item represents.
Path may be null, if the path is not null, the proxy ought to be null.

Grasshopper.GUI.GH_GooProxyList.DataItem.Proxy
Proxy this item represents.
Proxy may be null. If the proxy is null and the path is null, this represents a null data item.

Grasshopper.GUI.GH_GooProxyList.DataItem.Selected
Selected state of this item.

Grasshopper.GUI.GH_GooProxyList.DataItem.Bounds
Bounds (with scrolling taken into account).

Grasshopper.GUI.GH_GooProxyList.DataItem.Dragging
Dragging state of this item.