Grasshopper.GUI.IconEditor.IGH_IconObject
Represents a procedural object inside an Icon image.

Grasshopper.GUI.IconEditor.IGH_IconObject.ObjectID
Gets the icon object ID.

Grasshopper.GUI.IconEditor.IGH_IconObject.Pivot
Gets or sets the pivot point for this object.

Grasshopper.GUI.IconEditor.IGH_IconObject.Size
Gets or sets the size of the object container.
Setting the Size does not adjust the geometry,
call Resize() instead.

Grasshopper.GUI.IconEditor.IGH_IconObject.Image
Gets the object image.
Do not store pointers to this image as it might be
disposed at any time.

Grasshopper.GUI.IconEditor.IGH_IconObject.Contains(System.Drawing.PointF)
Tests a floating point coordinate for shape inclusion.
pt: Point to test for inclusion.
Returns: True if pt is inside the object boundary.

Grasshopper.GUI.IconEditor.IGH_IconObject.Resize(System.Drawing.Size)
Set a new size for this object and resize the geometry to adapt to the new container.
newSize: New size for this object.

Grasshopper.GUI.IconEditor.IGH_IconObject.Grips
Gets a list of Icon object grips.
Returns: A list of grips or null if this object does not support grips.

Grasshopper.GUI.IconEditor.IGH_IconObject.RenderObject(System.Drawing.Graphics)
Draw this object inside the specified graphics surface.
G: Graphics object to draw with.