Grasshopper.Kernel.GH_Arrange
Enumerates possible types of object arrangement.

Grasshopper.Kernel.GH_Arrange.MoveToFront
Put the objects on the top of the stack.

Grasshopper.Kernel.GH_Arrange.MoveForwards
Objects are inserted above the first occluding object.

Grasshopper.Kernel.GH_Arrange.MoveToBack
Put the objects on the bottom of the stack.

Grasshopper.Kernel.GH_Arrange.MoveBackwards
Objects are inserted below the first occluded object.