Grasshopper.Kernel.Types.GH_GeometricGooWrapper
Utility class for maintaining all kinds of IGH_GeometricGoo types.

Grasshopper.Kernel.Types.GH_GeometricGooWrapper.FindType(System.String,System.Type)
Attempts to a find a type based on a description.

Grasshopper.Kernel.Types.GH_GeometricGooWrapper.ScriptVariable
This function will be called when the local IGH_Goo instance
disapears into a user Script. This would be an excellent place to
cast your IGH_Goo type to a simple data type.
Returns: The object that represents this IGH_Goo instance in a script.