Grasshopper.GUI.Base.GH_ColourPickerEventArgs
Arguments passed via GH_SliderBase.ValueChanged events.

Grasshopper.GUI.Base.GH_ColourPickerEventArgs.ColourPicker
Gets the instance of the picker that raised the event.

Grasshopper.GUI.Base.GH_ColourPickerEventArgs.Colour
Gets the new value of the colour picker. This value is cached, so even if the
picker subsequently updates, this property remains constant.

Grasshopper.GUI.Base.GH_ColourPickerEventArgs.Original
Gets the original value of the colour picker. This value is cached, so even if the
picker subsequently updates, this property remains constant.

Grasshopper.GUI.Base.GH_ColourPickerEventArgs.Intermediate
Gets a value indicating whether the change was an intermediate one.