Grasshopper.Kernel.Data.GH_TreeIndex
Represents a single unique location in a DataTree.

Grasshopper.Kernel.Data.GH_TreeIndex.#ctor(Grasshopper.Kernel.Data.GH_Path,System.Int32)
Create a new instance of the GH_TreeIndex structure with preset path and item index.

Grasshopper.Kernel.Data.GH_TreeIndex.Path
Gets or sets the Path identifier.

Grasshopper.Kernel.Data.GH_TreeIndex.Item
Gets or sets the item index.