Grasshopper.GUI.GH_PageCurl
Provides methods for computing the shape and size of page curls, as well as the GDI paths and brushes required to draw them.

Grasshopper.GUI.GH_PageCurl.RenderTopology(System.Drawing.Graphics)
Draw debugging topology information about the page-curl into a graphics context.
g: Graphics object to draw with.

Grasshopper.GUI.GH_PageCurl.CurlTip
Gets the corner coordinate of the fold.

Grasshopper.GUI.GH_PageCurl.CurlEdge
Gets the edge of the page curl.

Grasshopper.GUI.GH_PageCurl.CurlPath
Gets the graphics path for the part of the curl that represents the backside of the fold.

Grasshopper.GUI.GH_PageCurl.CurlBrush
Gets the brush that can be used for drawing the curl backside.

Grasshopper.GUI.GH_PageCurl.CurlShadowSize
Gets the size of the shadow underneath the curl.

Grasshopper.GUI.GH_PageCurl.CurlShadowPath
Gets the graphics path for the curl shadow.

Grasshopper.GUI.GH_PageCurl.CurlShadowBrush
Gets a brush that can be used for drawing the curl shadow gradient.

Grasshopper.GUI.GH_PageCurl.BackgroundPath
Gets the graphics path for the background that the curl fold has exposed.

Grasshopper.GUI.GH_PageCurl.BackgroundShadowPath
Gets the graphics path for the fold shadow on the exposed area.

Grasshopper.GUI.GH_PageCurl.BackgroundShadowBrush
Gets a brush that can be used for drawing the fold shadow gradient.

Grasshopper.GUI.GH_PageCurl.CurlInterior
Gets a graphics path desribing the entire curl + background shape.