Grasshopper.GUI.Ribbon.GH_Layout
Represents a complete ribbon layout.

Grasshopper.GUI.Ribbon.GH_Layout.#ctor
Create a new Ribbon layout

Grasshopper.GUI.Ribbon.GH_Layout.#ctor(Grasshopper.GUI.Ribbon.GH_Layout)
Duplicate an existing layout.
other: Layout to duplicate.

Grasshopper.GUI.Ribbon.GH_Layout.Name
Gets the name of the layout as indicated by the filepath or "unnamed"

Grasshopper.GUI.Ribbon.GH_Layout.FilePath
Gets or sets the file path of the custom layout.
Typically the path should only be set during Save operations.
The FilePath field is not included in (de)serialization.

Grasshopper.GUI.Ribbon.GH_Layout.Tabs
Gets the internal list of ribbon tab names.
Eventhough items define tabs, this separate list is required in order to specify the order of tabs.

Grasshopper.GUI.Ribbon.GH_Layout.FindTab(System.String)
Find the first tab which matches the given name.
name: Name to search for (not case sensitive)
Returns: The first tab that matches the name, or null if no matching tab could be found.

Grasshopper.GUI.Ribbon.GH_Layout.TabCount
Gets the total number of Tabs defined in this layout.

Grasshopper.GUI.Ribbon.GH_Layout.PanelCount
Gets the total number of Panels defined in this layout.

Grasshopper.GUI.Ribbon.GH_Layout.ItemCount
Gets the total number of Items defined in this layout.

Grasshopper.GUI.Ribbon.GH_Layout.Items
Gets an enumerator for all the items in this layout.

Grasshopper.GUI.Ribbon.GH_Layout.AddTab
Add a new tab to this layout. The tab will receive a default name.

Grasshopper.GUI.Ribbon.GH_Layout.AddTab(System.String)
Add a new tab to this layout. If a tab with a similar name already exists, nothing is done.
name: Name of tab.

Grasshopper.GUI.Ribbon.GH_Layout.AddItem(System.String,System.String,System.Guid)
Add a new item to this layout.
category: Item category. If no category with this name exists yet, it will be created.
subcategory: Item subcategory. If no subcategory with this name exists yet, it will be created.
id: ID of item.

Grasshopper.GUI.Ribbon.GH_Layout.AddItem(System.String,System.String,System.Guid,Grasshopper.Kernel.GH_Exposure)
Add a new item to this layout.
category: Item category. If no category with this name exists yet, it will be created.
subcategory: Item subcategory. If no subcategory with this name exists yet, it will be created.
id: ID of item.
exposure: Exposure of item.

Grasshopper.GUI.Ribbon.GH_Layout.AddItem(System.String,System.String,Grasshopper.GUI.Ribbon.GH_LayoutItem)
Add a new item to this layout.
category: Item category. If no category with this name exists yet, it will be created.
subcategory: Item subcategory. If no subcategory with this name exists yet, it will be created.
item: Item to add.

Grasshopper.GUI.Ribbon.GH_Layout.Serialize
Serialize this layout as an xml string.

Grasshopper.GUI.Ribbon.GH_Layout.Serialize(System.String)
Serialize this layout to a *.ghlayout file.
filepath: File to serialize to.
Returns: True on success, false on failure.

Grasshopper.GUI.Ribbon.GH_Layout.Deserialize(System.String)
Deserialize this layout from a *.ghlayout file.
If this function returns False, the state of this object
is undefined.
filepath: File to deserialize from.
Returns: True on success, false on failure.