Grasshopper.GUI.GH_QuickImageEditor.CanvasImage
Gets or sets the canvas image.

Grasshopper.GUI.GH_QuickImageEditor.ViewportImage
Gets or sets the viewport image.

Grasshopper.GUI.GH_QuickImageEditor.FrameCrop
Gets or sets the cropping rectangle.

Grasshopper.GUI.GH_QuickImageEditor.FrameFocus
Gets or sets the rectangle of the focus frame.

Grasshopper.GUI.GH_QuickImageEditor.FrameViewport
Gets or sets the rectangle of the viewport frame.

Grasshopper.GUI.GH_QuickImageEditor.ViewportName
Gets or sets the viewport name to include.
If the name string is null or empty, the active viewport is used.