Grasshopper.Kernel.Types.GH_LinearDimension
Represents an implementation of a Rhino linear dimension.

Grasshopper.Kernel.Types.GH_LinearDimension.#ctor
Default constructor, creates an invalid linear dimension.

Grasshopper.Kernel.Types.GH_LinearDimension.#ctor(Rhino.Geometry.LinearDimension)
Create a duplicate of an existing linear dimension.
dimension: Linear dimension to duplicate

Grasshopper.Kernel.Types.GH_LinearDimension.#ctor(Rhino.Geometry.LinearDimension,Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle)
Create a duplicate of an existing linear dimension.
dimension: Linear dimension to duplicate
style: Annotation style to use

Grasshopper.Kernel.Types.GH_LinearDimension.#ctor(Grasshopper.Kernel.Types.GH_LinearDimension)
Create a duplicate of another GH_LinearDimension. This constructor also copies reference data.
other: GH_LinearDimension to duplicate

Grasshopper.Kernel.Types.GH_LinearDimension.#ctor(System.Guid)
Create a new referenced linear dimension that references a Rhino dimension with the specified ID.
ref_guid: ID of dimension object to reference.

Grasshopper.Kernel.Types.GH_LinearDimension.DuplicateAnnotation
Create a duplicate of this annotation.

Grasshopper.Kernel.Types.GH_LinearDimension.DuplicateLinearDimension
Create a duplicate of this linear dimension.

Grasshopper.Kernel.Types.GH_LinearDimension.ToString
Format the dimension using default grasshopper formatting logic.

Grasshopper.Kernel.Types.GH_LinearDimension.CastFrom(System.Object)
Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_LinearDimension.CastTo``1(``0@)
Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.