Grasshopper.GUI.RemotePanel.RcpLayoutControl.EditModeChanged
Raised when the EditMode state of this control changes.

Grasshopper.GUI.RemotePanel.RcpLayoutControl.EditMode
Gets or sets whether this control is in editmode. If you set this property you must also call Invalidate().

Grasshopper.GUI.RemotePanel.RcpLayoutControl.RcpLayout
Gets or sets the layout to display in this control.

Grasshopper.GUI.RemotePanel.RcpLayoutControl.GroupBounds
Gets the area available for Group objects.

Grasshopper.GUI.RemotePanel.RcpLayoutControl.LayoutGroups
Layout all groups from top to bottom.

Grasshopper.GUI.RemotePanel.RcpLayoutControl._dragMode
Current drag mode.

Grasshopper.GUI.RemotePanel.RcpLayoutControl._dragItem
Item currently being dragged (can be an RcpGroup).

Grasshopper.GUI.RemotePanel.RcpLayoutControl._dragOffset
Offset from mouse cursor to item bound location.

Grasshopper.GUI.RemotePanel.RcpLayoutControl._dragInsert
Insertion index for dragged items.

Grasshopper.GUI.RemotePanel.RcpLayoutControl._dragHint
Cache for the group insertion hint.

Grasshopper.GUI.RemotePanel.RcpLayoutControl._activeItem
Maintains a pointer to the active item. Items become active by capturing a mouse event.