Grasshopper.Kernel.Special.GH_PieChartPair
PieChart atomic data

Grasshopper.Kernel.Special.GH_PieChartPair.tag
Text ID for pie chart pair

Grasshopper.Kernel.Special.GH_PieChartPair.val
Valence of pie chart pair.