Grasshopper.Kernel.GH_Format
Provides standard Grasshopper formatting functions.

Grasshopper.Kernel.GH_Format.#ctor
This class cannot be instantiated, use the Shared methods directly.

Grasshopper.Kernel.GH_Format.TreatAsCollection(System.Object)
This method is used in Scripting components to determine whether a certain class was
'intended' as a collection or as a single piece of  data .
obj: Object to test.
Returns: True if we think the object was intended as a collection.

Grasshopper.Kernel.GH_Format.FormatKeys(System.Windows.Forms.Keys)
Format a keys enumeration as though it's a menu shortcut
keys: Key  data  to format

Grasshopper.Kernel.GH_Format.FormatDoubleValidity(System.Double,System.String)
If the number is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
Returns: A string describing why the number is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatComplexValidity(Grasshopper.Kernel.Types.Complex,System.String)
If the complex number is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
Returns: A string describing why the complex number is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatIntervalValidity(Rhino.Geometry.Interval,System.String,System.Boolean,System.Boolean)
If the point is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
testSingleton: If true, Intervals that have no length are considered invalid.
testDecreasing: If true, Intervals that are decreasing are considered invalid.
Returns: A string describing why the point is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatPointValidity(Rhino.Geometry.Point3d,System.String)
If the point is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
Returns: A string describing why the point is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatVectorValidity(Rhino.Geometry.Vector3d,System.String,System.Boolean,System.Boolean)
If the point is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
testZero: If True, zero-length vectors are considered to be invalid.
testUnit: If True, non-unit-length vectors are considered to be invalid.
Returns: A string describing why the point is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatPlaneValidity(Rhino.Geometry.Plane,System.String,System.Boolean)
If the plane is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
testUnitAxes: If True, planes with non-unit axis vectors are considered to be invalid.
Returns: A string describing why the plane is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatRectangleValidity(Rhino.Geometry.Rectangle3d,System.String)
If the rectangle is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
Returns: A string describing why the rectangle is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatBoxValidity(Rhino.Geometry.Box,System.String)
If the box is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
Returns: A string describing why the box is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatBoundingBoxValidity(Rhino.Geometry.BoundingBox,System.String)
If the box is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
Returns: A string describing why the box is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatLineValidity(Rhino.Geometry.Line,System.String)
If the line is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
Returns: A string describing why the line is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatCircleValidity(Rhino.Geometry.Circle,System.String)
If the circle is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
Returns: A string describing why the circle is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatArcValidity(Rhino.Geometry.Arc,System.String)
If the arc is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
Returns: A string describing why the arc is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatTransformValidity(Rhino.Geometry.Transform,System.String)
If the transform is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
Returns: A string describing why the transform is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatMeshFaceValidity(Rhino.Geometry.MeshFace,System.String)
If the number is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
Returns: A string describing why the point is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatCurveValidity(Rhino.Geometry.Curve,System.String)
If the curve is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
Returns: A string describing why the curve is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatSurfaceValidity(Rhino.Geometry.Surface,System.String)
If the surface is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
Returns: A string describing why the surface is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatBrepValidity(Rhino.Geometry.Brep,System.String)
If the brep is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
Returns: A string describing why the brep is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatExtrusionValidity(Rhino.Geometry.Extrusion,System.String)
If the extrusion is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
Returns: A string describing why the extrusion is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatSubDValidity(Rhino.Geometry.SubD,System.String)
If the brep is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
Returns: A string describing why the brep is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatMeshValidity(Rhino.Geometry.Mesh,System.String)
If the mesh is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
Returns: A string describing why the mesh is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatPointCloudValidity(Rhino.Geometry.PointCloud,System.String)
If the pointcloud is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
Returns: A string describing why the pointcloud is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatHatchValidity(Rhino.Geometry.Hatch,System.String)
If the hatch is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
Returns: A string describing why the hatch is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatTextDotValidity(Rhino.Geometry.TextDot,System.String)
If the text dot is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
Returns: A string describing why the text dot is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatAnnotationValidity(Rhino.Geometry.AnnotationBase,System.String)
If the annotation is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
Returns: A string describing why the annotation is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatLightValidity(Rhino.Geometry.Light,System.String)
If the light is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
Returns: A string describing why the light is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatInstanceReferenceValidity(Rhino.Geometry.InstanceReferenceGeometry,System.String)
If the instance reference is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
Returns: A string describing why the instance reference is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatDetailViewValidity(Rhino.Geometry.DetailView,System.String)
If the detail view is invalid, return a string describing why.
val: Value to format.
identifier: Name used to refer to the value in the format.
Returns: A string describing why the detail view is invalid or String.Empty if the value is not invalid.

Grasshopper.Kernel.GH_Format.FormatFilePath(System.String,System.Int32)
Format a filepath so that it doesn't exceed a string length.
If the filepath filename is already longer than maxLength it will be returned intact.
path: Path for format.
maxLength: Maximum number of characters to use.
Returns: The formatted path.

Grasshopper.Kernel.GH_Format.FormatFilePath(System.String,System.Int32,System.Drawing.Font)
Format a filepath so that it doesn't exceed width.
If the filepath filename is already longer than maxLength it will be returned intact.
path: Path to format.
maxWidth: Maximum allowed width (in pixels)
font: Font to use for measuring.
Returns: The formatted path.