Grasshopper.GUI.HTML.GH_HtmlListType
Enumerates different list types in HTML.

Grasshopper.GUI.HTML.GH_HtmlListType.Unordered
Represents a list with bulleted items.

Grasshopper.GUI.HTML.GH_HtmlListType.Ordered
Represents a list with numbered items.