Grasshopper.Kernel.Special.GH_PanelAttributes


Grasshopper.Kernel.Special.GH_PanelAttributes.m_zuiAnimator
Represents the Zoom Fade animation parameters.

Grasshopper.Kernel.Special.GH_PanelAttributes.PanelBounds
Gets the bounds (in integer accuracy) of the entire panel.

Grasshopper.Kernel.Special.GH_PanelAttributes.TitleBounds
Gets the bounds of the panel title. If there is no title
the height of this box will be 0.

Grasshopper.Kernel.Special.GH_PanelAttributes.ContentBounds
Gets the bounds of the panel content. The content is basically
the PanelBounds minus the TitleBounds and margins.

Grasshopper.Kernel.Special.GH_PanelAttributes.ScrollerBounds
Gets the bounds of the panel scrollbar track.
These bounds may have a width of zero if the scrollbar is not active.

Grasshopper.Kernel.Special.GH_PanelAttributes.ScrollGripBounds
Gets the bounds of the panel scrollbar grip.
These bounds may have be empty if the scrollbar is not active.

Grasshopper.Kernel.Special.GH_PanelAttributes.ScrollGripControlBounds
Gets the bounds of the panel scrollbar grip in control coordinates rather than canvas coordinates.

Grasshopper.Kernel.Special.GH_PanelAttributes.IndexBounds
Gets the bounds of the panel index column.
These bounds will have a width of zero if the indices are not displayed.

Grasshopper.Kernel.Special.GH_PanelAttributes.ItemBounds
Gets the bounds of the panel item column.

Grasshopper.Kernel.Special.GH_PanelAttributes.ZuiButtonBounds(Grasshopper.GUI.Canvas.GH_Canvas)
Gets the rectangle (in canvas control coordinates) in which the Zui buttons will be displayed.
canvas: Canvas to work in.
Returns: The layout rectangle for ZUI buttons, or Rectangle.Empty if the panel is not visible.

Grasshopper.Kernel.Special.GH_PanelAttributes.m_marginLeft
Represents the number of pixels between the left edge of the panel and the text content in case
of non-multiline user text.

Grasshopper.Kernel.Special.GH_PanelAttributes.m_marginRight
Represents the number of pixels between the right edge of the panel and the text content in case
of non-multiline user text.

Grasshopper.Kernel.Special.GH_PanelAttributes.m_marginTop
Represents the number of pixels between the top edge of the panel (or the bottom edge of the title box)
and the text content.

Grasshopper.Kernel.Special.GH_PanelAttributes.m_marginTopPoints
Control space coordinates for the top margin line.

Grasshopper.Kernel.Special.GH_PanelAttributes.m_marginLeftPoints
Control space coordinates for the left margin line.

Grasshopper.Kernel.Special.GH_PanelAttributes.m_marginRightPoints
Control space coordinates for the right margin line.

Grasshopper.Kernel.Special.GH_PanelAttributes.MarginTop
Gets or sets the value for the top margin.
Use MarginTopActual to get the adjusted margin for the current layout.

Grasshopper.Kernel.Special.GH_PanelAttributes.MarginLeft
Gets or sets the value for the left margin.
Use MarginLeftActual to get the adjusted margin for the current layout.

Grasshopper.Kernel.Special.GH_PanelAttributes.MarginRight
Gets or sets the value for the right margin.
Use MarginRightActual to get the adjusted margin for the current layout.

Grasshopper.Kernel.Special.GH_PanelAttributes.MarginTopActual
Gets the actual current value for the top margin.

Grasshopper.Kernel.Special.GH_PanelAttributes.MarginLeftActual
Gets the actual current value for the left margin.

Grasshopper.Kernel.Special.GH_PanelAttributes.MarginRightActual
Gets the actual current value for the right margin.

Grasshopper.Kernel.Special.GH_PanelAttributes.RelevantElement(System.Drawing.Point)
Find the relevant element at the given point.
point: Point in control coordinates.
Returns: The most relevant ZUI element at the given point.