Grasshopper.Kernel.Types.GH_Box
Represents a 3D oriented Box volume.

Grasshopper.Kernel.Types.GH_Box.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Kernel.Types.GH_Box.Brep
Differs from Rhino.Geometry.Brep.FromBox() because it  Handles degenerate cases.

Grasshopper.Kernel.Types.GH_Box.Geometry(Rhino.Geometry.Brep@,Rhino.Geometry.Curve@,Rhino.Geometry.Point@)
Convert the box to a GeometryBase instance.
brp: If the box is at most degenerate in one direction, the brp parameter will be filled out.
crv: If the box is degenerate in exactly two directions, the crv parameter will be filled out.
pt: If the box is degenerate in all three directions, the pt parameter will be filled out.
Returns: True on success, false on failure.