Grasshopper.GUI.GH_MultilineGooEditor
Utility class that adds certain multi-line features to standard windows Textboxes.

Grasshopper.GUI.GH_MultilineGooEditor.ParsePaths
Gets or sets whether paths are to be parsed as paths.

Grasshopper.GUI.GH_MultilineGooEditor.Modified
Gets or sets whether the contents of this text box have been modified.
You don't typically need to use the setter.

Grasshopper.GUI.GH_MultilineGooEditor.SetDataList(System.Collections.Generic.IEnumerable{Grasshopper.Kernel.Types.IGH_Goo})
Assign a list of data to the textbox.
data: Data to assign. Null items and items which cannot emit proxies will be represented by empty lines.

Grasshopper.GUI.GH_MultilineGooEditor.GetDataList``1(``0)
Get the text box content as a list of goo.
Type of data to retrieve.
defaultInstance: Base instance to use.
Returns: A list of data as represented by the textbox contents.

Grasshopper.GUI.GH_MultilineGooEditor.SetDataTree(Grasshopper.Kernel.Data.IGH_Structure)
Assign a list of data to the textbox.
data: Data to assign. Null items and items which cannot emit proxies will be represented by empty lines.

Grasshopper.GUI.GH_MultilineGooEditor.GetDataTree``1
Get the text box content as a list of goo.
Type of data to retrieve.
Returns: A list of data as represented by the textbox contents.