Grasshopper.Kernel.GH_SolutionSpan
Represents the time interval for a GH_Document solution.

Grasshopper.Kernel.GH_SolutionSpan.#ctor(System.DateTime,System.DateTime)
Creates a new instance of the GH_SolutionSpan structure.
t0: Time of solution start.
t1: Time of solution end.

Grasshopper.Kernel.GH_SolutionSpan.StartTime
Gets the time at which this solution was started.

Grasshopper.Kernel.GH_SolutionSpan.EndTime
Gets the time at which this solution was finished.