Grasshopper.Kernel.Types.GH_Leader
Represents an implementation of a Rhino leader.

Grasshopper.Kernel.Types.GH_Leader.#ctor
Default constructor, creates an invalid leader.

Grasshopper.Kernel.Types.GH_Leader.#ctor(Rhino.Geometry.Leader)
Create a duplicate of an existing leader.
leader: Leader to duplicate

Grasshopper.Kernel.Types.GH_Leader.#ctor(Rhino.Geometry.Leader,Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle)
Create a duplicate of an existing annotation.
leader: Annotation to duplicate
style: Annotation style to use

Grasshopper.Kernel.Types.GH_Leader.#ctor(System.Guid)
Create a new referenced leader that references a Rhino leader with the specified ID.
ref_guid: ID of leader object to reference.

Grasshopper.Kernel.Types.GH_Leader.#ctor(Grasshopper.Kernel.Types.GH_Leader)
Create a duplicate of another GH_Leader. This constructor also copies reference data.
other: GH_Leader to duplicate

Grasshopper.Kernel.Types.GH_Leader.DuplicateAnnotation
Create a duplicate of this annotation.

Grasshopper.Kernel.Types.GH_Leader.DuplicateLeader
Create a duplicate of this leader.

Grasshopper.Kernel.Types.GH_Leader.ToString
Format the leader using default grasshopper formatting logic.

Grasshopper.Kernel.Types.GH_Leader.CastFrom(System.Object)
Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_Leader.CastTo``1(``0@)
Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.