Grasshopper.Kernel.GH_DocumentTreeNode
Represents a single node in a document tree.

Grasshopper.Kernel.GH_DocumentTreeNode.#ctor(Grasshopper.Kernel.GH_Document)
Create a new node instance.
node: Node base document.

Grasshopper.Kernel.GH_DocumentTreeNode.Document
Gets the document at this node.

Grasshopper.Kernel.GH_DocumentTreeNode.SubNodes
Gets a collection of subnodes.