Grasshopper.GUI.Canvas.GH_ObjectResponse
Lists the possible responses an object can give when confronted with a UI event.

Grasshopper.GUI.Canvas.GH_ObjectResponse.Ignore
Event was ignored.

Grasshopper.GUI.Canvas.GH_ObjectResponse.Capture
Event caused the object to become active.

Grasshopper.GUI.Canvas.GH_ObjectResponse.Release
Object was active, but event caused object to become inactive.

Grasshopper.GUI.Canvas.GH_ObjectResponse.Handled
Something happened, but no capture is needed.