Grasshopper.GUI.Canvas.GH_Skin
Provides static access to typical Palletes and other GUI colours.

Grasshopper.GUI.Canvas.GH_Skin.DefaultPalette(Grasshopper.Kernel.IGH_ActiveObject)
Get the default palette as implied by the object state.
Locked and Hidden flags are ignored.

Grasshopper.GUI.Canvas.GH_Skin.LoadSkin
Instantiate all palette and gui defaults.
This function reads the colour values out of grasshopper_gui.xml settings database if it exists.

Grasshopper.GUI.Canvas.GH_Skin.SaveSkin
Store all palette and gui defaults.
This function writes the colour values out to grasshopper_gui.xml settings database.

Grasshopper.GUI.Canvas.GH_Skin.canvas_mono
Canvas monochromatic flag. If True, the canvas background is a solid colour.

Grasshopper.GUI.Canvas.GH_Skin.canvas_mono_color
If canvas_mono is set to true, this colour specified the solid background fill for the canvas.

Grasshopper.GUI.Canvas.GH_Skin.canvas_back
Specifies canvas background colour.

Grasshopper.GUI.Canvas.GH_Skin.canvas_edge
Specifies canvas edge colour.

Grasshopper.GUI.Canvas.GH_Skin.canvas_grid
Specifies canvas grid colour.

Grasshopper.GUI.Canvas.GH_Skin.canvas_shade
Specifies the colour of the canvas drop shadow.

Grasshopper.GUI.Canvas.GH_Skin.canvas_grid_col
Specifies the interval of the canvas grid columns.

Grasshopper.GUI.Canvas.GH_Skin.canvas_grid_row
Specifies the interval of the canvas grid rows.

Grasshopper.GUI.Canvas.GH_Skin.canvas_shade_size
Specifies the size of the canvas drop shadow.

Grasshopper.GUI.Canvas.GH_Skin.wire_default
Specifies the default wire colour.

Grasshopper.GUI.Canvas.GH_Skin.wire_empty
Specifies the colour for empty (null) wires.

Grasshopper.GUI.Canvas.GH_Skin.wire_selected_a
Specifies the colour for wires at the selected end.

Grasshopper.GUI.Canvas.GH_Skin.wire_selected_b
Specifies the colour for wires at the unselected end.

Grasshopper.GUI.Canvas.GH_Skin.group_back
Specifies the default fill colour for Group objects.

Grasshopper.GUI.Canvas.GH_Skin.panel_back
Specifies the default fill colour for Panel objects.

Grasshopper.GUI.Canvas.GH_Skin.zui_fill
Specifies the default fill colour for ZUI elements.

Grasshopper.GUI.Canvas.GH_Skin.zui_edge
Specifies the default edge colour for ZUI elements.

Grasshopper.GUI.Canvas.GH_Skin.zui_fill_highlight
Specifies the default fill colour for highlighted ZUI elements.

Grasshopper.GUI.Canvas.GH_Skin.zui_edge_highlight
Specifies the default edge colour for highlighted ZUI elements.

Grasshopper.GUI.Canvas.GH_Skin.palette_black_standard
Black palette, unselected.

Grasshopper.GUI.Canvas.GH_Skin.palette_black_selected
Black palette, selected.

Grasshopper.GUI.Canvas.GH_Skin.palette_grey_standard
Grey palette, unselected.

Grasshopper.GUI.Canvas.GH_Skin.palette_grey_selected
Grey palette, selected.

Grasshopper.GUI.Canvas.GH_Skin.palette_white_standard
White palette, unselected.

Grasshopper.GUI.Canvas.GH_Skin.palette_white_selected
White palette, selected.

Grasshopper.GUI.Canvas.GH_Skin.palette_blue_standard
Blue palette, unselected.

Grasshopper.GUI.Canvas.GH_Skin.palette_blue_selected
Blue palette, selected.

Grasshopper.GUI.Canvas.GH_Skin.palette_brown_standard
Brown palette, unselected.

Grasshopper.GUI.Canvas.GH_Skin.palette_brown_selected
Brown palette, selected.

Grasshopper.GUI.Canvas.GH_Skin.palette_pink_standard
Pink palette, unselected.

Grasshopper.GUI.Canvas.GH_Skin.palette_pink_selected
Pink palette, selected.

Grasshopper.GUI.Canvas.GH_Skin.palette_trans_standard
Transparent palette, unselected.

Grasshopper.GUI.Canvas.GH_Skin.palette_trans_selected
Transparent palette, selected.

Grasshopper.GUI.Canvas.GH_Skin.palette_normal_standard
Normal, unselected palette. Default background for parameters and components.

Grasshopper.GUI.Canvas.GH_Skin.palette_normal_selected
Normal, selected palette. Default background for parameters and components.

Grasshopper.GUI.Canvas.GH_Skin.palette_hidden_standard
Hidden, unselected palette. Default background for PanelHidden (preview=off) parameters and components.

Grasshopper.GUI.Canvas.GH_Skin.palette_hidden_selected
Hidden, selected palette. Default background for PanelHidden (preview=off) parameters and components.

Grasshopper.GUI.Canvas.GH_Skin.palette_locked_standard
Locked, unselected palette. Default background for locked parameters and components.

Grasshopper.GUI.Canvas.GH_Skin.palette_locked_selected
Locked, selected palette. Default background for locked parameters and components.

Grasshopper.GUI.Canvas.GH_Skin.palette_warning_standard
Warnings, unselected palette. Default background for parameters and components that carry warnings.

Grasshopper.GUI.Canvas.GH_Skin.palette_warning_selected
Warnings, selected palette. Default background for parameters and components that carry warnings.

Grasshopper.GUI.Canvas.GH_Skin.palette_error_standard
Errors, unselected palette. Default background for parameters and components that carry errors.

Grasshopper.GUI.Canvas.GH_Skin.palette_error_selected
Errors, selected palette. Default background for parameters and components that carry errors.