Grasshopper.Kernel.GH_ParamWireDisplay
Enumerates the possible wire display types for parameters.

Grasshopper.Kernel.GH_ParamWireDisplay.default
Wire display is controlled by the application settings.

Grasshopper.Kernel.GH_ParamWireDisplay.faint
Wires are displayed faintly (thin and transparent) while the parameter is not selected.

Grasshopper.Kernel.GH_ParamWireDisplay.hidden
Wires are not displayed at all while the parameter is not selected.