Grasshopper.GUI.Canvas.GH_Canvas
The GH_Canvas is the control that handles all mouse and paint events for a single loaded document.

Grasshopper.GUI.Canvas.GH_Canvas.ViewportChanged
This event is raised whenever the viewport properties are modified,
for example when the pan or zoom values are affected.
sender: Canvas that raised the event.
e: Event arguments.

Grasshopper.GUI.Canvas.GH_Canvas.ModifiersChanged
This event is raised whenever the ModifiersEnabled property changes.
sender: Canvas that raised the event.
e: Event arguments.

Grasshopper.GUI.Canvas.GH_Canvas.Canvases
Gets a list of all the GH_Canvas instances that currently have handles.

Grasshopper.GUI.Canvas.GH_Canvas.Widgets
Gets a list of all the widgets on this canvas.

Grasshopper.GUI.Canvas.GH_Canvas.WidgetListCreated
This event is raised once for every GH_Canvas object that is created anew. The event is
Shared (static) because it is raised inside the constructor of a GH_Canvas object and therefor
cannot be registered on an instance.
sender: The canvas that raised the event.
e: Event arguments. Use the AddWidget() method to register your own method.

Grasshopper.GUI.Canvas.GH_Canvas.ShowNavigationPane
Displays the quick-navigation popup pane at the cursor.

Grasshopper.GUI.Canvas.GH_Canvas.AddTagArtist(Grasshopper.GUI.Canvas.TagArtists.IGH_TagArtist)
Add a Tag Artist instance to this canvas.
artist: Tag artist to add

Grasshopper.GUI.Canvas.GH_Canvas.TagArtistIDs
Gets all the TagArtist IDs in this Canvas.

Grasshopper.GUI.Canvas.GH_Canvas.RemoveAllTagArtists
Remove all IGH_TagArtists from this canvas. Do not use this method
unless you want to screw over everyone else.

Grasshopper.GUI.Canvas.GH_Canvas.RemoveTagArtist(Grasshopper.GUI.Canvas.TagArtists.IGH_TagArtist)
Remove a specific tag artist from this canvas.
If the instance occurs multiple times in the TagArtist list,
all instances will be removed.
artist: TagArtist to remove.
Returns: The number of IGH_TagArtist instances removed.

Grasshopper.GUI.Canvas.GH_Canvas.RemoveTagArtist(System.Guid)
Remove all IGH_TagArtists from this canvas that match a certain ID.
artistId: ID of IGH_TagArtists to remove.
Returns: The number of IGH_TagArtist instances removed.

Grasshopper.GUI.Canvas.GH_Canvas.OnViewportChanged
Ensure the canvas and document viewport data are synchronised and raises the ViewportChanged event.

Grasshopper.GUI.Canvas.GH_Canvas.DocumentObjectMouseDown
This event is raised whenever the left mouse button is pressed while over a Document object.
sender: Canvas that raised the event.
e: Arguments for this event.

Grasshopper.GUI.Canvas.GH_Canvas.DocumentChanged
This event is raised whenever a different document is loaded into this canvas.

Grasshopper.GUI.Canvas.GH_Canvas.NavigationSettingsChanged
Raised whenever any of the shared navigation properties changed.

Grasshopper.GUI.Canvas.GH_Canvas.NavigationPanPixels
Gets or sets the number of pixels for each pan operation.

Grasshopper.GUI.Canvas.GH_Canvas.NavigationPanLeft
Gets or sets the special key for panning left.

Grasshopper.GUI.Canvas.GH_Canvas.NavigationPanRight
Gets or sets the special key for panning right.

Grasshopper.GUI.Canvas.GH_Canvas.NavigationPanUp
Gets or sets the special key for panning up.

Grasshopper.GUI.Canvas.GH_Canvas.NavigationPanDown
Gets or sets the special key for panning down.

Grasshopper.GUI.Canvas.GH_Canvas.NavigationZoomFactor
Gets or sets the zoom factor for navigation zoom operations.

Grasshopper.GUI.Canvas.GH_Canvas.NavigationZoomIn
Gets or sets the special key for zooming in.

Grasshopper.GUI.Canvas.GH_Canvas.NavigationZoomOut
Gets or sets the special key for zooming in.

Grasshopper.GUI.Canvas.GH_Canvas.Navigate(Grasshopper.GUI.Canvas.GH_CanvasNavigation)
Perform a single navigation step.
navigation: Type of navigation step.

Grasshopper.GUI.Canvas.GH_Canvas.ModifiersEnabled
Gets or sets the modifiers enabled flag. When modifiers are disabled,
only zooming and panning is still allowed.

Grasshopper.GUI.Canvas.GH_Canvas.HasControlWithFocus
Gets whether or not this canvas has a child control on it with focus.

Grasshopper.GUI.Canvas.GH_Canvas.GetCanvasScreenBuffer(Grasshopper.GUI.Canvas.GH_CanvasMode)
Get a bitmap that resembles the current state of the canvas.
modeOverride: The mode to apply during the off-screen rendering.
Returns: A Format24bppRgb bitmap similar to the current canvas display.

Grasshopper.GUI.Canvas.GH_Canvas.Graphics
Gets the graphics object with which this Canvas is redrawn. This object only exists during redraws,
if you need the Graphics object for this canvas outside of updates, call GetGraphicsObject() instead.

Grasshopper.GUI.Canvas.GH_Canvas.GetGraphicsObject(System.Boolean)
Gets a graphics object for this control. You are not allowed to draw with this object,
use it only for visibility testing and such. If you're inside a canvas update, use the Graphics() property instead.
You must dispose of the Graphics object returned by this method or resources will be leaked.
setupDisplayTransform: If true, the display transform will be added to the graphics object.
Returns: A non-drawing Graphics object on success or null on failure..

Grasshopper.GUI.Canvas.GH_Canvas.DrawingMode
Gets the current drawing mode for this canvas.

Grasshopper.GUI.Canvas.GH_Canvas.Painter
Gets the painter object that handles most of the drawing logic for this canvas.

Grasshopper.GUI.Canvas.GH_Canvas.Viewport
Gets the viewport that determines the panning and zooming for this canvas.

Grasshopper.GUI.Canvas.GH_Canvas.IsActiveInteraction
Gets a value indicating whether or not there is an interaction object loaded in this canvas.

Grasshopper.GUI.Canvas.GH_Canvas.IsActiveWidget
Gets a value indicating whether or not a widget is currently activated.

Grasshopper.GUI.Canvas.GH_Canvas.IsActiveObject
Gets a value indicating whether or not an object is currently activated.

Grasshopper.GUI.Canvas.GH_Canvas.ActiveInteraction
Gets or sets the currently active interaction object.

Grasshopper.GUI.Canvas.GH_Canvas.SynchInteractionState
If there is a currently active interaction, and it's no longer active, erase it.

Grasshopper.GUI.Canvas.GH_Canvas.ActiveWidget
Gets or sets the currently active widget.

Grasshopper.GUI.Canvas.GH_Canvas.ActiveObject
Gets or sets the currently active object.

Grasshopper.GUI.Canvas.GH_Canvas.IsDocument
Gets a value indicating whether or not a document is currently loaded in this canvas.

Grasshopper.GUI.Canvas.GH_Canvas.Document
Gets or sets the document currently loaded in this canvas.

Grasshopper.GUI.Canvas.GH_Canvas.CursorControlPosition
Gets the location of the cursor in Control coordinates.

Grasshopper.GUI.Canvas.GH_Canvas.CursorCanvasPosition
Gets the location of the cursor in Canvas coordinates.

Grasshopper.GUI.Canvas.GH_Canvas.DestroyMRUPanels
Destroy any MRU panels that might be in existence.

Grasshopper.GUI.Canvas.GH_Canvas.CreateMRUPanels
Create new MRU panels. This function only does something if there is no document loaded in the canvas.

Grasshopper.GUI.Canvas.GH_Canvas.LayoutMRUPanels
Layout all existing MRU panels.

Grasshopper.GUI.Canvas.GH_Canvas.HideMRUPanels
Hide all existing MRU panels by sliding them out of view.

Grasshopper.GUI.Canvas.GH_Canvas.ShowMRUPanels
Show any hidden MRU panels by sliding them back into view.

Grasshopper.GUI.Canvas.GH_Canvas.MRURecordCountChanged(Grasshopper.GUI.MRU.GH_MRU_Server,System.Int32)
Handler for record changes.
sender: Record server.

Grasshopper.GUI.Canvas.GH_Canvas.ThumbnailSize
Gets the thumbnail size for documents.

Grasshopper.GUI.Canvas.GH_Canvas.CreatePreview(System.Drawing.Size)
Render this canvas to a thumbnail preview.

Grasshopper.GUI.Canvas.GH_Canvas.UpdateDocumentPreview
Call this method to update the preview thumbnail for the currently loaded document.
If no document is currently loaded, nothing will happen.

Grasshopper.GUI.Canvas.GH_Canvas.ValidGraphics
Gets or sets the Valid Graphics flag. Even if the flag is set to true, though, the property may still return false
if there is a problem with the internal graphics object.

Grasshopper.GUI.Canvas.GH_Canvas.SetSmartTextRenderingHint
When this method is called during a redraw, the TextRenderingHint of the associated
graphics object will be set to either GH_CrispText or GH_SmoothText depending on zoom level.

Grasshopper.GUI.Canvas.GH_Canvas.Painting
Gets whether this canvas is currently busy painting itself.

Grasshopper.GUI.Canvas.GH_Canvas.ZoomFadeLow
Gets the ZUI fade alpha value for the low zoom level threshold.
This static field gets set on every Canvas paint start.
The low threshold is typically used for fading of icons and object names.

Grasshopper.GUI.Canvas.GH_Canvas.ZoomFadeMedium
Gets the ZUI fade alpha value for the medium zoom level threshold.
This static field gets set on every Canvas paint start.
The medium threshold is typically used for non-informative UI elements such as highlights.

Grasshopper.GUI.Canvas.GH_Canvas.ZoomFadeHigh
Gets the ZUI fade alpha value for the high zoom level threshold.
This static field gets set on every Canvas paint start.
The high threshold is typically used for ZUI elements that only appear when zoomed in.

Grasshopper.GUI.Canvas.GH_Canvas.CanvasPaintBegin
Raised before a new paint operation starts.
This event is always raised, even if the Canvas isn't visible.

Grasshopper.GUI.Canvas.GH_Canvas.CanvasPaintBackground
Raised after the background has been drawn.

Grasshopper.GUI.Canvas.GH_Canvas.CanvasPrePaintGroups
Raised before group drawing starts.

Grasshopper.GUI.Canvas.GH_Canvas.CanvasPostPaintGroups
Raised after group drawing completes.

Grasshopper.GUI.Canvas.GH_Canvas.CanvasPrePaintWires
Raised before wire drawing starts.

Grasshopper.GUI.Canvas.GH_Canvas.CanvasPostPaintWires
Raised after wire drawing completes.

Grasshopper.GUI.Canvas.GH_Canvas.CanvasPrePaintObjects
Raised before object drawing starts.

Grasshopper.GUI.Canvas.GH_Canvas.CanvasPostPaintObjects
Raised after object drawing completes.

Grasshopper.GUI.Canvas.GH_Canvas.CanvasPrePaintOverlay
Raised before object overlay drawing starts.

Grasshopper.GUI.Canvas.GH_Canvas.CanvasPostPaintOverlay
Raised after object overlay drawing completes.

Grasshopper.GUI.Canvas.GH_Canvas.CanvasPrePaintWidgets
Raised before Widgets are drawn.

Grasshopper.GUI.Canvas.GH_Canvas.CanvasPostPaintWidgets
Raised after widgets are drawn. This is the final event in the Drawing pipeline.

Grasshopper.GUI.Canvas.GH_Canvas.CanvasPaintEnd
Raised after a paint operation completes.
This event is always raised, even if the Canvas isn't visible.

Grasshopper.GUI.Canvas.GH_Canvas.ScheduleInactive
Defines the delay used to indicate the absence of a schedule.

Grasshopper.GUI.Canvas.GH_Canvas.ScheduleRegen(System.Int32)
Schedule a regen to occur after the specified number of milliseconds have elapsed.
If a Regen is called in this time frame, the schedule will be cleared. Only a single
schedule can be active at any time, so any call to ScheduleRegen will clear
existing schedules.
delay: Number of milliseconds to wait until repainting the canvas.
intervals equal to or less than zero will be ignored.

Grasshopper.GUI.Canvas.GH_Canvas.StartSchedule
If there's a schedule, start the timer.

Grasshopper.GUI.Canvas.GH_Canvas.ScheduleTimerTick(System.Object)
This method is called from the timer thread.
state: state is always null.

Grasshopper.GUI.Canvas.GH_Canvas.ScheduleTimerTick_ThreadSafe
This method is invoked from the timer thread via the main editor UI thread.

Grasshopper.GUI.Canvas.GH_Canvas.GenerateHiResImage(System.Drawing.Rectangle,Grasshopper.GUI.Canvas.GH_Canvas.GH_ImageSettings,System.Drawing.Size@)
Generate a collection of hi-res images of the document.
rec: BoundingBox rectangle of export.
settings: Hi-res settings.
Returns: List of file paths that indicate the individual images.

Grasshopper.GUI.Canvas.GH_Canvas.GenerateHiResImageTile(Grasshopper.GUI.Canvas.GH_Viewport,System.Drawing.Color)
Generate a single tile in a Hi-Res image export.
vp: Viewport override
bg: Background color override.
Returns: A list of image tiles.

Grasshopper.GUI.Canvas.GH_Canvas.ShowInfoDialogs(System.Drawing.PointF)
Update the info dialogs.
pt: Point in canvas coordinates.
Returns: If true, infomode dialogs were created, false if otherwise

Grasshopper.GUI.Canvas.GH_Canvas.DisplayVoronoiWarning
Gets or sets whether the Voronoi Over-dose warning message is displayed.
This property is set once at Grasshopper startup to True.

Grasshopper.GUI.Canvas.GH_Canvas.Validator
Provides access to all the validators associated with this canvas.

Grasshopper.GUI.Canvas.GH_Canvas.AddValidator(Grasshopper.GUI.Canvas.IGH_CanvasValidator)
Add a new drop validator to the canvas.
validator: Validator to add.

Grasshopper.GUI.Canvas.GH_Canvas.RemoveValidator(Grasshopper.GUI.Canvas.IGH_CanvasValidator)
Remove a drop validator from the canvas.
validator: Validator to remove.

Grasshopper.GUI.Canvas.GH_Canvas.StartAutoPan
Start the auto-panning timer.

Grasshopper.GUI.Canvas.GH_Canvas.StopAutoPan
Stop the auto-panning timer.

Grasshopper.GUI.Canvas.GH_Canvas.IsPointOnWidget(System.Drawing.Point)
Test all widgets to see if they contain the given control point.
pt: Point to test for inclusion.
Returns: Index of the widget that contains the point or -1 if no widget contains the point.

Grasshopper.GUI.Canvas.GH_Canvas.TooltipDelay
Gets the delay (in milliseconds) required for a tooltip popup.
This delay is a user setting stored under the Canvas:TooltipDelay field of the core settings.

Grasshopper.GUI.Canvas.GH_Canvas.IsPointNearInput(System.Drawing.PointF,Grasshopper.Kernel.IGH_Attributes)
Determine whether a point in space is closer to the input grip than the output grip.
pt: Point to search from.
atts: Attributes to search.
Returns: True if pt is closer to the Input grip than the output grip.

Grasshopper.GUI.Canvas.GH_Canvas.ShowComponentSearchBox
Display the component Search dialog at the current mouse location.
The dialog cannot be shown if ModifiersEnabled=False.
Returns: True on success, false on failure.

Grasshopper.GUI.Canvas.GH_Canvas.ShowComponentSearchBox(System.Drawing.Point)
Display the component Search dialog at the given coordinate.
The dialog cannot be shown if ModifiersEnabled=False.
at: Location (in screen space) for the center of the search box.
Returns: True on success, false on failure.

Grasshopper.GUI.Canvas.GH_Canvas.ShowSearchDialog(System.Boolean)
Display the Find dialog.
If a Find dialog is already active for this canvas, nothing will happen.
centerOnCursor: If true, the dialog will be centered on the cursor,
otherwise it will be put in the upper left corner of the canvas.