Grasshopper.GUI.GH_FormShepard
A Form shepard is used to herde a bunch of floating forms.
Important forms that potentially spout child forms might choose to
implement one.

Grasshopper.GUI.GH_FormShepard.#ctor(System.Windows.Forms.Form)
Create a new form shepard.
nOwner: Owner form.

Grasshopper.GUI.GH_FormShepard.RegisterForm(System.Windows.Forms.Form)
Add a sheep form to the flock. This form will be affected by the location and size of the main form.
dialog: Form to add.

Grasshopper.GUI.GH_FormShepard.UnregisterForm(System.Windows.Forms.Form)
Remove a sheep from the flock.
dialog: Form to remove.