Grasshopper.Kernel.GH_ParamData
Enumerates the possible states of being for data inside a parameter.
Remarks:

Grasshopper.Kernel.GH_ParamData.unknown
Unknown, this really shouldn't happen too often.

Grasshopper.Kernel.GH_ParamData.void
Parameter contains no data.

Grasshopper.Kernel.GH_ParamData.local
Parameter contains local data.

Grasshopper.Kernel.GH_ParamData.remote
Parameter contains data that came from elsewhere.