Grasshopper.GUI.GH_DocumentEditor
The Grasshopper main window.

Grasshopper.GUI.GH_DocumentEditor.FormShepard
Gets the form shepard for this window.
Register your modeless dialogs with this shepard if you want to be popular.

Grasshopper.GUI.GH_DocumentEditor.CloseForReal
Really, really close the window.

Grasshopper.GUI.GH_DocumentEditor.FadeOut
Call this method if the prompt switches to Rhino.

Grasshopper.GUI.GH_DocumentEditor.FadeIn
Call this method if the prompt switches back to Grasshopper.

Grasshopper.GUI.GH_DocumentEditor.EnableUI
Enable all modifier UI.

Grasshopper.GUI.GH_DocumentEditor.DisableUI
Disable all modifier UI.

Grasshopper.GUI.GH_DocumentEditor.AggregateShortcutMenuItems
This event is raised whenever a GH_DocumentEditor collects all shortcuttable menu items.
If you added items to the menu and you want to be able to have custom shortcuts on these items,
you must handle this event and insert your own items.
sender: GH_DocumentEditor that raised the event.
e: Arguments.

Grasshopper.GUI.GH_DocumentEditor.MenuShortcutItems
Returns a list of menu items that can potentially have shortcuts assigned to them.

Grasshopper.GUI.GH_DocumentEditor.GetMenuShortcuts
Gets a list of all menu items that could theoretically support shortcuts.

Grasshopper.GUI.GH_DocumentEditor.SetMenuShortCuts(System.Collections.Generic.IEnumerable{Grasshopper.GUI.GH_MenuShortcut})
Set a bunch of menu shortcuts.
shortcuts: Shortcuts to assign to the main menu.

Grasshopper.GUI.GH_DocumentEditor.EditorFoldStateChanged
This event is raised whenever the main windows folds or unfolds.
sender: A reference to this window.
e: Empty event arguments.

Grasshopper.GUI.GH_DocumentEditor.m_collapsed
True if the form is currently in collapsed state.

Grasshopper.GUI.GH_DocumentEditor.m_expandedheight
If the form is currently collapsed, this value indicates the height in unfolded mode.

Grasshopper.GUI.GH_DocumentEditor.m_collapsedHeight
Contains the height (in pixels) of the collapsed form.

Grasshopper.GUI.GH_DocumentEditor.CollapseForm
Collapses the form into the title bar area.

Grasshopper.GUI.GH_DocumentEditor.ExpandForm
Expands the form if it is currenly collapsed.

Grasshopper.GUI.GH_DocumentEditor.ToggleForm
Collapses the form if it's currently expanded or expands the form if it's currently collapsed.

Grasshopper.GUI.GH_DocumentEditor.WndProc(System.Windows.Forms.Message@)
WndProc is overridden in order to allow for title-bar double-click (un)folding.
m: Proc message.

Grasshopper.GUI.GH_DocumentEditor.Collapsed
Gets a value indicating whether or not the form is currently collapsed.

Grasshopper.GUI.GH_DocumentEditor.SetStatusBarEvent(Grasshopper.Kernel.GH_RuntimeMessage)
Set a new message on the Grasshopper status bar.
event: Message to set

Grasshopper.GUI.GH_DocumentEditor.ClearStatusBar
Clear the Grasshopper status-bar.

Grasshopper.GUI.GH_DocumentEditor.SetCanvasZoom_From_GUI
Apply the current zoom-box value to the canvas.

Grasshopper.GUI.GH_DocumentEditor.SetZoomGUI_From_Canvas
Apply the current canvas zoom value to the zoom-box

Grasshopper.GUI.GH_DocumentEditor.FixCanvasToolbarState
Enabled/Disables the appropriate buttons depending on whether there
is a document loaded on the canvas.

Grasshopper.GUI.GH_DocumentEditor.ScriptAccess_IsDocument
Returns true if there is an active document.

Grasshopper.GUI.GH_DocumentEditor.ScriptAccess_IsDocumentModified
Gets the modified flag of the currently loaded document.
Returns: True if the document has been modified, false if not or if there is no document.

Grasshopper.GUI.GH_DocumentEditor.ScriptAccess_NewDocument
Creates a new document and loads it into the Canvas.

Grasshopper.GUI.GH_DocumentEditor.ScriptAccess_OpenDocument
Displays a command line interface for File Open... then loads that file into the Canvas.
Returns: True on success, false on failure.

Grasshopper.GUI.GH_DocumentEditor.ScriptAccess_OpenDocument(System.String)
Loads a specific file off the hard disk into the Canvas.
filename: File to load.
Returns: True on success, false on failure.

Grasshopper.GUI.GH_DocumentEditor.ScriptAccess_SaveDocument
Saves the document currently loaded in the Canvas. If the document hasn't been saved before
then a Save... dialog box will be shown.
Returns: True on success, false on failure.

Grasshopper.GUI.GH_DocumentEditor.ScriptAccess_SaveDocumentAs
Saves the currently active document to disk.
Returns: True on success, false on failure.

Grasshopper.GUI.GH_DocumentEditor.ScriptAccess_SaveDocumentAs(System.String)
Saves the currently active document to disk.
path: Path of save destination.
Returns: True on success, false on failure.

Grasshopper.GUI.GH_DocumentEditor.ScriptAccess_CloseDocument
Closes the currently active document and loads the next available document into the canvas.
Changes will not be saved.
Returns: True on success, false on failure.

Grasshopper.GUI.GH_DocumentEditor.ScriptAccess_CloseAllDocuments
Closes all documents in the Document Queue.
Returns: True on success, false on failure.