Grasshopper.Kernel.GH_DataComparison
Enumerates all possible Data Matching algorithms for Components.

Grasshopper.Kernel.GH_DataComparison.ShortestList
Matches data in all lists until the shortest list runs dry.
This flag will omit data entries if lists have a different length
Remarks:

Grasshopper.Kernel.GH_DataComparison.LongestList
Matches data in all lists until the longest list runs dry.
This is the default behaviour
Remarks:

Grasshopper.Kernel.GH_DataComparison.CrossReference
Matches data in all lists in all possible combinations.
Careful, since this might results in stupendous amounts of data
Remarks: