Grasshopper.GUI.GH_TextInputBaseControl


Grasshopper.GUI.GH_TextInputBaseControl.IsTextInputActive
Gets whether the text input override is currently displayed.

Grasshopper.GUI.GH_TextInputBaseControl.ShowTextInputOnKeyDown
Gets or sets whether this control displays the text input override on a key down event.

Grasshopper.GUI.GH_TextInputBaseControl.ShowTextInputOnDoubleClick
Gets or sets whether this control displays the text input override on a double mouse click.

Grasshopper.GUI.GH_TextInputBaseControl.Input_Assign(System.String)
Override this function to respond to input text assignments.
text: Text to assign

Grasshopper.GUI.GH_TextInputBaseControl.Input_Parse(System.String)
Override this function to check input text for validity.
text: Text to parse.
Returns: True if text is valid, otherwise false.

Grasshopper.GUI.GH_TextInputBaseControl.Input_Supply
Override this function to supply a default input text.
Returns: Text to display in the input.