Grasshopper.Kernel.IGH_ContextualComponent
Base interface for contextual components.
This makes accessing non-strongly-typed functionality easier.

Grasshopper.Kernel.IGH_ContextualComponent.Archive
Gets instance of embedded Grasshopper GH_Archive