Grasshopper.Kernel.Types.GH_Culture
Represents a globally unique identifier. GH_Guid re-implements the framework System.Guid type.

Grasshopper.Kernel.Types.GH_Culture.#ctor
Blank constructor

Grasshopper.Kernel.Types.GH_Culture.IsValid
Gets the validity of this instance. Guids are always valid.