Grasshopper.Kernel.GH_PreviewMesh
Enumerates possible meshing parameters for documents.

Grasshopper.Kernel.GH_PreviewMesh.None
No preview meshes.

Grasshopper.Kernel.GH_PreviewMesh.LowQuality
Rhino default for coarse meshes.
Remarks:

Grasshopper.Kernel.GH_PreviewMesh.HighQuality
Rhino default for smooth meshes.

Grasshopper.Kernel.GH_PreviewMesh.Document
Same meshing parameters as the current document.

Grasshopper.Kernel.GH_PreviewMesh.Custom
Custom meshing parameters.