Grasshopper.GUI.IconEditor.IGH_IconObjectGrip
Represents a single GH_IconObject grip.

Grasshopper.GUI.IconEditor.IGH_IconObjectGrip.Owner
Gets the owner of this grip.

Grasshopper.GUI.IconEditor.IGH_IconObjectGrip.Tag
Gets or sets the Tag object for this grip.

Grasshopper.GUI.IconEditor.IGH_IconObjectGrip.Index
Gets the index of this grip.

Grasshopper.GUI.IconEditor.IGH_IconObjectGrip.Position
Gets or sets the position of this grip.

Grasshopper.GUI.IconEditor.IGH_IconObjectGrip.Selected
Gets or sets the selected state for this grip.

Grasshopper.GUI.IconEditor.IGH_IconObjectGrip.RenderGrip(System.Drawing.Graphics)
Draw this grip inside the specified graphics surface.
G: Graphics object to draw with.