Grasshopper.Kernel.Types.GH_Guid
Represents a globally unique identifier. GH_Guid re-implements the framework System.Guid type.

Grasshopper.Kernel.Types.GH_Guid.#ctor
Blank constructor

Grasshopper.Kernel.Types.GH_Guid.IsValid
Gets the validity of this instance. Guids are always valid.