Grasshopper.GUI.StringDisplay.GH_SimpleListItem
Base implementation of IGH_StringListItem

Grasshopper.GUI.StringDisplay.GH_SimpleListItem.BoundingBox
Gets or sets the BoundingBox for this item.

Grasshopper.GUI.StringDisplay.GH_SimpleListItem.Text
Gets or sets the text of this item.

Grasshopper.GUI.StringDisplay.GH_SimpleListItem.Colour
Gets or sets the colour to use while drawing this item.

Grasshopper.GUI.StringDisplay.GH_SimpleListItem.Alignment
Gets or sets the horizontal alignment to use when drawing this item.