Grasshopper.Kernel.GH_Component.GH_OutputParamManager
This class is used during Component construction to add output parameters.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.ParamCount
Returns the number of output parameters already part of this component.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Param(System.Int32)
Gets the output parameter at the given index.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.HideParameter(System.Int32)
Hide a specific output parameter. If the parameter at the given index implement IGH_PreviewObject
then the Hidden flag will be set to True. Otherwise, nothing will happen.
index: Index of parameter to hide.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.RegisterParam(Grasshopper.Kernel.IGH_Param)
Generic parameter registration. This class provides methods to register standard parameters,
but if you have a special type you're in charge of setting it all up yourself.
param: The parameter to add

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.RegisterParam(Grasshopper.Kernel.IGH_Param,Grasshopper.Kernel.GH_ParamAccess)
Generic parameter registration. This class provides methods to register standard parameters,
but if you have a special type you're in charge of setting it all up yourself.
param: The parameter to add.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.RegisterParam(Grasshopper.Kernel.IGH_Param,System.String,System.String,System.String)
Generic parameter registration. This class provides methods to register standard parameters,
but if you have a special type you're in charge of setting it all up yourself.
param: The parameter to add
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.RegisterParam(Grasshopper.Kernel.IGH_Param,System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Generic parameter registration. This class provides methods to register standard parameters,
but if you have a special type you're in charge of setting it all up yourself.
param: The parameter to add
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_PointParam(System.String,System.String,System.String)
Register a new 3D point parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_PointParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D point parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_VectorParam(System.String,System.String,System.String)
Register a new 3D vector parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_VectorParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D vector parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_FieldParam(System.String,System.String,System.String)
Register a new field parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_FieldParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new field parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_MatrixParam(System.String,System.String,System.String)
Register a new matrix parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_MatrixParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new matrix parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_PlaneParam(System.String,System.String,System.String)
Register a new 3D plane parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_PlaneParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D plane parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_LineParam(System.String,System.String,System.String)
Register a new 3D line parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_LineParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D line parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_CircleParam(System.String,System.String,System.String)
Register a new 3D circle parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_CircleParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D circle parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_RectangleParam(System.String,System.String,System.String)
Register a new 3D rectangle parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_RectangleParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D rectangle parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_ArcParam(System.String,System.String,System.String)
Register a new 3D arc parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_ArcParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D arc parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_CurveParam(System.String,System.String,System.String)
Register a new 3D curve parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_CurveParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D curve parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_SurfaceParam(System.String,System.String,System.String)
Register a new 3D surface parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_SurfaceParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D surface parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_BRepParam(System.String,System.String,System.String)
Register a new 3D Brep parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_BRepParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D Brep parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_MeshParam(System.String,System.String,System.String)
Register a new 3D Mesh parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_MeshParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D Mesh parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_MeshFaceParam(System.String,System.String,System.String)
Register a new 3D Mesh face parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_MeshFaceParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D Mesh face parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_BoxParam(System.String,System.String,System.String)
Register a new 3D box parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_BoxParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D box parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_GeometryParam(System.String,System.String,System.String)
Register a new 3D geometry parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_GeometryParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D geometry parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_GroupParam(System.String,System.String,System.String)
Register a new geometric group parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_GroupParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new geometric group parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_IntervalParam(System.String,System.String,System.String)
Register a new Interval parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_IntervalParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new Interval parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_TransformParam(System.String,System.String,System.String)
Register a new Transform parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_TransformParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new Transform parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_2DIntervalParam(System.String,System.String,System.String)
Register a new two-dimensional OnInterval parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_2DIntervalParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new two-dimensional OnInterval parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_BooleanParam(System.String,System.String,System.String)
Register a new Boolean primitive parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_BooleanParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new Boolean primitive parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_IntegerParam(System.String,System.String,System.String)
Register a new Integer primitive parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_IntegerParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new Integer primitive parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_DoubleParam(System.String,System.String,System.String)
Register a new Double primitive parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_DoubleParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new Double primitive parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_ComplexParam(System.String,System.String,System.String)
Register a new Complex primitive parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_ComplexParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new Complex primitive parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_StringParam(System.String,System.String,System.String)
Register a new String primitive parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_StringParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new String primitive parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_ColourParam(System.String,System.String,System.String)
Register a new Colour primitive parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_ColourParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new Colour primitive parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_PathParam(System.String,System.String,System.String)
Register a new Data Structure path parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_PathParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new Data Structure path parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_GenericParam(System.String,System.String,System.String)
Register a new Generic (Object) parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_GenericParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new Generic (Object) parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access, you should set this field if you intend to output lists here.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddParameter(Grasshopper.Kernel.IGH_Param)
Generic parameter addition. If you cannot use one of the utility methods provided
by this class, you can register a customized parameter using this method.
param: The parameter to add.
Returns: Index of the newly added parameter.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddParameter(Grasshopper.Kernel.IGH_Param,System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Generic parameter addition. If you cannot use one of the utility methods provided
by this class, you can register a customized parameter using this method.
param: The parameter to add.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.
Returns: Index of the newly added parameter.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddPointParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a 3D Point parameter to the output list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddVectorParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a 3D Vector parameter to the output list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddFieldParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Field parameter to the output list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddMatrixParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Matrix parameter to the output list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddPlaneParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a 3D Plane parameter to the output list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddLineParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a 3D Line parameter to the output list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddCircleParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a 3D Circle parameter to the output list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddRectangleParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a 3D Rectangle parameter to the output list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddArcParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a 3D Arc parameter to the output list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddCurveParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Curve parameter to the output list of this component.
Curve parameters can handle all curve types (Lines, Polylines, Circles, Arcs, NurbsCurves etc.)
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddSurfaceParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Surface parameter to the output list of this component.
Surface parameters can handle both trimmed and untrimmed single-faced Breps.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddBrepParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Brep parameter to the output list of this component.
Brep parameters can handle both trimmed and untrimmed single or multi-faced Breps.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddSubDParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Sub-D parameter to the output list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddMeshParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Mesh parameter to the output list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddMeshFaceParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a topological MeshFace parameter to the output list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddBoxParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a 3D Box parameter to the output list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddGeometryParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Geometry parameter to the output list of this component.
Geometry parameters can handle all types that represent actual shapes.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddGroupParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Transform Group parameter to the output list of this component.
Groups are collections of geometry that are transformed as one, they are not the same as Rhino groups.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddIntervalParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Interval (i.e. numeric domain) parameter to the output list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddInterval2DParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Interval2D (i.e. uv domain) parameter to the output list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddTransformParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Transformation parameter to the output list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddBooleanParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Boolean parameter to the output list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddIntegerParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Integer parameter to the output list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddNumberParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a floating point Number parameter to the output list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddComplexNumberParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Complex Number parameter to the output list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddTimeParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Time parameter to the output list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddCultureParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Culture parameter to the output list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddTextParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Text parameter to the output list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddColourParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a ARGB Colour parameter to the output list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddPathParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Data Path parameter to the output list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.AddGenericParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Generic parameter to the output list of this component.
Generic parameters can handle all types of data.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use SetData(), SetDataList() or SetDataTree() respectively.