Grasshopper.Kernel.Special.GH_ClusterProtection
Enumerates the possible protection states of the cluster.

Grasshopper.Kernel.Special.GH_ClusterProtection.Unprotected
Indicates no password has been set.

Grasshopper.Kernel.Special.GH_ClusterProtection.Protected
Indicates a password has been set.