Grasshopper.GUI.Canvas.GH_DragDropFileAction
Enumerates the possible actions for drag+drop loading ghx files.

Grasshopper.GUI.Canvas.GH_DragDropFileAction.None
Indicates no action is defined.

Grasshopper.GUI.Canvas.GH_DragDropFileAction.Open
Open the file(s) as a new document.

Grasshopper.GUI.Canvas.GH_DragDropFileAction.Examine
Examine the file(s) using FileViewer.exe

Grasshopper.GUI.Canvas.GH_DragDropFileAction.Insert
Insert the file(s) into the current document.

Grasshopper.GUI.Canvas.GH_DragDropFileAction.Group
Insert the file(s) into the current document as separate groups.

Grasshopper.GUI.Canvas.GH_DragDropFileAction.Cluster
Insert the file(s) into the current document as clusters.