Grasshopper.Kernel.GH_DocumentContext
Enumerates all possible (de)activation contexts for documents.

Grasshopper.Kernel.GH_DocumentContext.Unknown
Specifies unknown context. This should never be used.

Grasshopper.Kernel.GH_DocumentContext.None
Specifies unset state. This is only used for documents that have never been in a context.

Grasshopper.Kernel.GH_DocumentContext.Open
Indicates the document was created anew from a file.

Grasshopper.Kernel.GH_DocumentContext.Close
Indicates the document has been unloaded from memory.

Grasshopper.Kernel.GH_DocumentContext.Loaded
Indicates the document has been loaded into the Canvas.

Grasshopper.Kernel.GH_DocumentContext.Unloaded
Indicates the document has been unloaded from the Canvas.

Grasshopper.Kernel.GH_DocumentContext.Lock
Indicates the document has been locked.
This is only possible for nested documents.

Grasshopper.Kernel.GH_DocumentContext.Unlock
Indicates the document has been unlocked.
This is only possible for nested documents.