Grasshopper.Documentation.GH_Parser
Provides parsing methods for the Grasshopper Markdown flavour.

Grasshopper.Documentation.GH_Parser.#ctor
This class provides only static (Shared in VB) methods and cannot be constructed.

Grasshopper.Documentation.GH_Parser.Whitespace
Gets an array of characters that are considered to be whitespace.
At the moment, this array contains the space char and the tab char,
it does not contain feeds or breaks.

Grasshopper.Documentation.GH_Parser.StringToFragment(System.String)
Parse a block of text and return it as an interpreted IGH_Fragment.
text: Text to parse.
Returns: Fragment representing the text.

Grasshopper.Documentation.GH_Parser.RewriteHeaderTags(System.Collections.Generic.List{System.String})
Rewrite all paragraph and chapter header lines as #Title# blocks.
text: Text to rewrite.
Returns: Number of modifications made.

Grasshopper.Documentation.GH_Parser.RewriteLineEndings(System.Collections.Generic.List{System.String})
Fix whitespace at all line endings. Lines with two or more spaces will be
limited to two spaces, lines with no or one space will be rewritten to contain a single
space. Any tabs at the end of lines are ignored and removed.
text: List of strings to rewrite.

Grasshopper.Documentation.GH_Parser.ExtractSharedLinks(System.Collections.Generic.List{System.String})
Find all shared link entries in a collection of textual lines and convert them to
shared links. This method will remove all shared link lines from the input.
text: Text to parse, if shared links are found, they will be removed.
Returns: A collection of shared links.

Grasshopper.Documentation.GH_Parser.CreateLogicalFragments(System.Collections.Generic.List{System.String})
Break a section of text into separate logical fragments. All text inside a single paragraph
is considered a single logical fragment. Paragraphs are separated by one or more empty lines.
Items in lists are also considered individual fragments.
text: Text to evaluate.
Returns: A collection of logical paragraphs.

Grasshopper.Documentation.GH_Parser.IsCommentLine(System.String)
Test whether a line is a comment.
Commented lines begin with double slashes (//) and are ignored during parsing.
line: Line to test. If you supply a multi-line string, death's too good for you.
Returns: True if the line is a comment line.

Grasshopper.Documentation.GH_Parser.IsChapterHeaderLine(System.String)
Test whether a line represents a chapter header underline.
Chapter header underlines contain at least 4 consecutive equals symbols preceded or followed by any amount of white space.
line: Line to test.
Returns: True if the line is considered to be a chapter header underline.

Grasshopper.Documentation.GH_Parser.IsParagraphHeaderLine(System.String)
Test whether a line represents a paragraph header underline.
Paragraph header underlines contain at least 4 consecutive dashes preceded or followed by any amount of white space.
line: Line to test.
Returns: True if the line is considered to be a paragraph header underline.

Grasshopper.Documentation.GH_Parser.IsListLine(System.String)
Test whether a line contains a list item.
line: Line to check.
Returns: True if the line contains a list item.

Grasshopper.Documentation.GH_Parser.IsQuoteLine(System.String)
Test whether a line is a block quote line.
Block quotes start with a larger than symbol.
line: Line to test.
Returns: True if the line is a block quote.

Grasshopper.Documentation.GH_Parser.IsLinkLine(System.String)
Test whether a line represents a referenced link target.
Note; this is a quick check. The link might still be invalid,
use the IsLinkLine overload to include validity checks.
line: Line to test.
Returns: True if the line is a referenced link.

Grasshopper.Documentation.GH_Parser.IsLinkLine(System.String,System.String@,System.String@,System.String@)
Test whether a line represents a referenced link target.
line: Line to test.
Returns: True if the line is a referenced link.