Grasshopper.My.Resources.Res_Settings
A strongly-typed resource class, for looking up localized strings, etc.

Grasshopper.My.Resources.Res_Settings.ResourceManager
Returns the cached ResourceManager instance used by this class.

Grasshopper.My.Resources.Res_Settings.Culture
Overrides the current thread's CurrentUICulture property for all
resource lookups using this strongly typed resource class.

Grasshopper.My.Resources.Res_Settings.Author_48x48
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_Settings.AutoSave_48x48
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_Settings.Canvas_48x48
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_Settings.Display_48x48
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_Settings.Fonts_48x48
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_Settings.Interface_48x48
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_Settings.Nesting_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_Settings.Skin_48x48
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_Settings.Solver_48x48
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_Settings.Unset_48x48
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_Settings.Viewport_48x48
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_Settings.Widgets_48x48
Looks up a localized resource of type System.Drawing.Bitmap.