Grasshopper.GUI.RemotePanel.RemoteControlPanel
Remote Control Panel control. This control hosts the Rcp toolbar and also the group content panel.

Grasshopper.GUI.RemotePanel.RemoteControlPanel.Document
Gets or sets the document that populates this Control.