Grasshopper.Kernel.Special.GH_Timer


Grasshopper.Kernel.Special.GH_Timer.Manual
Gets whether updates must be triggered manually
or whether they are automatically scheduled.
Negative interval values imply a manual trigger.

Grasshopper.Kernel.Special.GH_Timer.LockTargets
Gets or sets whether the target objects ought to be
locked while not triggered by this timer. This property does
not itself perform any locking/unlocking, that is the
responsibility of the caller.

Grasshopper.Kernel.Special.GH_Timer.Interval
Gets or sets the interval (in milliseconds between timer ticks).
Any interval less than or equal to zero results in a manual timer.

Grasshopper.Kernel.Special.GH_Timer.AllowTargetLocking
Override this property and return false to disable target locking UI.

Grasshopper.Kernel.Special.GH_Timer.AllowModeSwitching
Override this property and return false to disable switching between
manual and scheduled modes.

Grasshopper.Kernel.Special.GH_Timer.DisplayUserName
Override this property and return false to not include the user name in the attributes.

Grasshopper.Kernel.Special.GH_Timer.DisplayIcon
Override this property and return true to include the icon in the attributes.

Grasshopper.Kernel.Special.GH_Timer.SafeSchedule
Schedule a solution if it makes sense.

Grasshopper.Kernel.Special.GH_Timer.CleanTargetList
Remove all targets which can no longer be resolved.
You typically don't want to call this as objects may have been
deleted but may be re-instated via UNDO again. There's no real harm
in having 'dirty' targets.

Grasshopper.Kernel.Special.GH_Timer.TargetCount
Gets the number of targets directly specified by this trigger.

Grasshopper.Kernel.Special.GH_Timer.Targets
Gets the targets directly specified by this trigger.

Grasshopper.Kernel.Special.GH_Timer.TargetsRecursive
Gets the target specified by this trigger, and by any other
trigger which is referenced by this trigger.

Grasshopper.Kernel.Special.GH_Timer.TargetObjects
Iterate over all active targets.

Grasshopper.Kernel.Special.GH_Timer.FindTargetObject(System.Guid)
Find the active object in the same document as this trigger.

Grasshopper.Kernel.Special.GH_Timer.ExpireTargets
Expire all target objects, but do not start a new solution.

Grasshopper.Kernel.Special.GH_Timer.ExpireTargets(System.Int32@)
Expire all target objects, but do not start a new solution.
count: Number of targets that were expired.

Grasshopper.Kernel.Special.GH_Timer.LockAllTargetObjects
Lock all target objects if the Grasshopper.Kernel.Special.GH_Timer.LockTargets
property is set to true.

Grasshopper.Kernel.Special.GH_Timer.UnlockAllTargetObjects
Unlock all target objects.

Grasshopper.Kernel.Special.GH_Timer.GlobalTimerBlock
Gets the global timer block state.