Grasshopper.My.Resources.Resources
A strongly-typed resource class, for looking up localized strings, etc.

Grasshopper.My.Resources.Resources.ResourceManager
Returns the cached ResourceManager instance used by this class.

Grasshopper.My.Resources.Resources.Culture
Overrides the current thread's CurrentUICulture property for all
resource lookups using this strongly typed resource class.

Grasshopper.My.Resources.Resources.GrasshopperBannerImage_Palette
Looks up a localized resource of type System.Drawing.Bitmap.