Grasshopper.GUI.Equations.IGH_EquationFragment.Pivot
Gets or sets the insertion point for this fragment.

Grasshopper.GUI.Equations.IGH_EquationFragment.Size
Gets the size of this fragment as determined by the most recent Layout.

Grasshopper.GUI.Equations.IGH_EquationFragment.Bounds
Gets the bounds for this fragment (essentially the Pivot + Size).

Grasshopper.GUI.Equations.IGH_EquationFragment.Icon
Gets the 24x24 icon for this fragment.

Grasshopper.GUI.Equations.IGH_EquationFragment.Name
Gets the name for this fragment.

Grasshopper.GUI.Equations.IGH_EquationFragment.Description
Gets the description for this fragment.

Grasshopper.GUI.Equations.IGH_EquationFragment.Layout(System.Drawing.Font)
Performs a complete recursive layout of this fragment and all contained fragments.
Note that layout only determines the Size of the fragment, not it's location.
font: Font to use during Layout.
Returns: True on success, false on failure.

Grasshopper.GUI.Equations.IGH_EquationFragment.Position(System.Drawing.PointF)
Performs a complete recursive positioning of this fragment and all contained fragments.
You need to run a Layout pass prior to calling Position to make sure all sizes are up to date.
location: Base line of position.
Returns: True on success, false on failure.

Grasshopper.GUI.Equations.IGH_EquationFragment.ToExpression
Format the fragment as a partial Grasshopper expression.
Returns: The expression equivalent of this fragment.

Grasshopper.GUI.Equations.IGH_EquationFragment.Render(System.Drawing.Graphics,System.Drawing.Font,System.Drawing.Color)
Render this fragment and all contained fragments.
graphics:
font:
colour: