Grasshopper.GUI.Gradient.GH_GripType
Enumerates the possible grip types.

Grasshopper.GUI.Gradient.GH_GripType.Continuous
Grip has the same colour coming in and going out.

Grasshopper.GUI.Gradient.GH_GripType.Discontinuous
Grip has a different colour coming in and going out.