Grasshopper.Kernel.Types.GH_Interval
Represents a one-dimensional numeric domain.

Grasshopper.Kernel.Types.GH_Interval.#ctor
Default constructor

Grasshopper.Kernel.Types.GH_Interval.#ctor(Rhino.Geometry.Interval)
Create a duplicate of another interval
interval: Interval to copy. If null, a default interval will be created.

Grasshopper.Kernel.Types.GH_Interval.#ctor(Grasshopper.Kernel.Types.GH_Interval)
Create a duplicate from another interval.
other: Interval start

Grasshopper.Kernel.Types.GH_Interval.Duplicate
Create a duplicate of this interval.

Grasshopper.Kernel.Types.GH_Interval.DuplicateInterval
Create a duplicate of this interval.

Grasshopper.Kernel.Types.GH_Interval.IsValid
Gets the validity of this instance. Intervals are invalid if either of the extremes is a #NaN.

Grasshopper.Kernel.Types.GH_Interval.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Kernel.Types.GH_Interval.ToString
Format the interval using default grasshopper formatting logic.

Grasshopper.Kernel.Types.GH_Interval.CastFrom(System.Object)
Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_Interval.CastTo``1(``0@)
Local to Remote caster function. this stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_Interval.QC_Type


Grasshopper.Kernel.Types.GH_Interval.QC_Hash


Grasshopper.Kernel.Types.GH_Interval.QC_Distance(Grasshopper.Kernel.Types.IGH_QuickCast)


Grasshopper.Kernel.Types.GH_Interval.QC_CompareTo(Grasshopper.Kernel.Types.IGH_QuickCast)


Grasshopper.Kernel.Types.GH_Interval.QC_Bool


Grasshopper.Kernel.Types.GH_Interval.QC_Col


Grasshopper.Kernel.Types.GH_Interval.QC_Complex


Grasshopper.Kernel.Types.GH_Interval.QC_Matrix


Grasshopper.Kernel.Types.GH_Interval.QC_Int


Grasshopper.Kernel.Types.GH_Interval.QC_Num


Grasshopper.Kernel.Types.GH_Interval.QC_Pt


Grasshopper.Kernel.Types.GH_Interval.QC_Vec


Grasshopper.Kernel.Types.GH_Interval.QC_Text


Grasshopper.Kernel.Types.GH_Interval.QC_Interval


Grasshopper.Kernel.Types.GH_Interval.EmitProxy
Returns a proxy that represents this interval. Do not call this function unless you're