Grasshopper.Kernel.Components.GH_ReadFileComponent.GH_ParserCode.CreateDefaultCode
Create default code which just returns the line itself.

Grasshopper.Kernel.Components.GH_ReadFileComponent.GH_ParserCode.UserCode
Gets or sets the lines of code inside the parsing function.

Grasshopper.Kernel.Components.GH_ReadFileComponent.GH_ParserCode.GetFullSource
Gets compileable source.

Grasshopper.Kernel.Components.GH_ReadFileComponent.GH_ParserCode.GetCodeBlocks
Return a collection of code blocks that represent the entire custom code.

Grasshopper.Kernel.Components.GH_ReadFileComponent.GH_ParserCode.SetCodeBlocks(Grasshopper.GUI.Script.GH_CodeBlocks)
Gets all the source from a code blocks instance.
The code blocks should have a single mutable section.
code: Code to parse.
Returns: True on success, false on failure