Grasshopper.GUI.GH_ToolTipForm
Grasshopper tooltip form.

Grasshopper.GUI.GH_ToolTipForm.DefaultTooltipWidth
Gets the default width of the tooltip.
Unless there is a very good reason, tooltips will always have this width.

Grasshopper.GUI.GH_ToolTipForm.DefaultBlockWidth
Gets the default width of the tooltip sunken block region.