Grasshopper.Kernel.Types.GH_Circle
Represents a 3D circle. GH_Circle re-implements the OpenNURBS OnCircle class.

Grasshopper.Kernel.Types.GH_Circle.#ctor
Default constructor

Grasshopper.Kernel.Types.GH_Circle.#ctor(Rhino.Geometry.Circle)
Create a duplicate of another circle
circle: Circle to copy. If null, a default circle will be created.

Grasshopper.Kernel.Types.GH_Circle.#ctor(Grasshopper.Kernel.Types.GH_Circle)
Create a duplicate of another circle.
other: Circle to mimic.

Grasshopper.Kernel.Types.GH_Circle.DuplicateGeometry
Create a duplicate of this circle.

Grasshopper.Kernel.Types.GH_Circle.DuplicateCircle
Create a duplicate of this circle.

Grasshopper.Kernel.Types.GH_Circle.IsValid
Gets the validity of this instance.
Circles are valid when their base planes are valid and when the radius is larger than zero.

Grasshopper.Kernel.Types.GH_Circle.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Kernel.Types.GH_Circle.Boundingbox
Gets the boundingbox for this geometry.
Returns: The boundingbox for this piece of geometry or
Boundingbox.Empty if the geometry is null or invalid.

Grasshopper.Kernel.Types.GH_Circle.ToString
Format the circle using default grasshopper formatting logic.

Grasshopper.Kernel.Types.GH_Circle.CastFrom(System.Object)
Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_Circle.CastTo``1(``0@)
Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_Circle.EmitProxy
Returns a proxy that represents this circle. Do not call this function unless you're