Grasshopper.Kernel.GH_LoadingDemand
Enumerates all assembly loading behaviour demands.

Grasshopper.Kernel.GH_LoadingDemand.None
Indicates no valid loading behaviour. Do not use this value in the GH_GHALoadingAttribute constructor.

Grasshopper.Kernel.GH_LoadingDemand.Default
Use the application settings.

Grasshopper.Kernel.GH_LoadingDemand.ForceCOFF
Force this assembly to be loaded using COFF byte arrays.

Grasshopper.Kernel.GH_LoadingDemand.ForceDirect
Force this assembly to be loaded directly from the disk.