Grasshopper.Kernel.IGH_StateAwareObject
Implement this interface if you want to be included in state saving/loading.

Grasshopper.Kernel.IGH_StateAwareObject.SaveState
Override this function to store your state data.
You have to return a deserializable string.

Grasshopper.Kernel.IGH_StateAwareObject.LoadState(System.String)
Override this function to load your state data.
DO NOT START A NEW SOLUTION. This will be handled by the state manager.