Grasshopper.Kernel.Data.GH_Path.PathLengthComparer
Use this comparer to sort lists of paths using a topological approach.
Shorter paths are favoured over longer paths. Equal length paths use the
default comparer.