Grasshopper.GUI.GH_Animator
Provides static methods and constructors GH_Animator(Of T).

Grasshopper.GUI.GH_Animator.InterpolateDouble(System.Double,System.Double,System.Double)
Utility interpolation delegate for System.Double values.

Grasshopper.GUI.GH_Animator.InterpolateSingle(System.Single,System.Single,System.Double)
Utility interpolation delegate for System.Single values.

Grasshopper.GUI.GH_Animator.InterpolateInteger(System.Int32,System.Int32,System.Double)
Utility interpolation delegate for System.Int32 values.

Grasshopper.GUI.GH_Animator.InterpolateDecimal(System.Decimal,System.Decimal,System.Double)
Utility interpolation delegate for System.Decimal values.

Grasshopper.GUI.GH_Animator.InterpolatePoint(System.Drawing.Point,System.Drawing.Point,System.Double)
Utility interpolation delegate for System.Drawing.Point values.

Grasshopper.GUI.GH_Animator.InterpolatePointF(System.Drawing.PointF,System.Drawing.PointF,System.Double)
Utility interpolation delegate for System.Drawing.PointF values.

Grasshopper.GUI.GH_Animator.InterpolateRectangle(System.Drawing.Rectangle,System.Drawing.Rectangle,System.Double)
Utility interpolation delegate for System.Drawing.Rectangle values.

Grasshopper.GUI.GH_Animator.InterpolateRectangleF(System.Drawing.RectangleF,System.Drawing.RectangleF,System.Double)
Utility interpolation delegate for System.Drawing.RectangleF values.