Grasshopper.GUI.Theme.GH_PageSettings.DrawPage
Gets or sets whether the page ought to be drawn.

Grasshopper.GUI.Theme.GH_PageSettings.DrawShadow
Gets or sets whether the page shadow ought to be drawn.
If the page is not drawn, neither is the page shadow, irregardless of this property.

Grasshopper.GUI.Theme.GH_PageSettings.DrawGrid
Gets or sets whether the grid ought to be drawn.

Grasshopper.GUI.Theme.GH_PageSettings.EdgeColour
Gets or sets the page edge colour to be used.

Grasshopper.GUI.Theme.GH_PageSettings.FillColour
Gets or sets the page fill colour to be used.

Grasshopper.GUI.Theme.GH_PageSettings.ShadowColour
Gets or set the page shadow colour to be used.

Grasshopper.GUI.Theme.GH_PageSettings.ShadowSize
Gets or sets the size of the page shadow.

Grasshopper.GUI.Theme.GH_PageSettings.GridColour
Gets or sets the page grid colour to be used.

Grasshopper.GUI.Theme.GH_PageSettings.GridWidth
Gets or sets the width of a page grid cell.

Grasshopper.GUI.Theme.GH_PageSettings.GridHeight
Gets or sets the height of a page grid cell.

Grasshopper.GUI.Theme.GH_PageSettings.GridPattern
Gets or sets the dash pattern to apply to grid lines.
Leave null or empty for a solid line.