Grasshopper.Kernel.Types.GH_OrdinateDimension
Represents an implementation of a Rhino ordinate dimension.

Grasshopper.Kernel.Types.GH_OrdinateDimension.#ctor
Default constructor, creates an invalid ordinate dimension.

Grasshopper.Kernel.Types.GH_OrdinateDimension.#ctor(Rhino.Geometry.OrdinateDimension)
Create a duplicate of an existing ordinate dimension.
dimension: Ordinate dimension to duplicate

Grasshopper.Kernel.Types.GH_OrdinateDimension.#ctor(Rhino.Geometry.OrdinateDimension,Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle)
Create a duplicate of an existing ordinate dimension.
dimension: Ordinate dimension to duplicate
style: Annotation style to use

Grasshopper.Kernel.Types.GH_OrdinateDimension.#ctor(Grasshopper.Kernel.Types.GH_OrdinateDimension)
Create a duplicate of another GH_OrdinateDimension. This constructor also copies reference data.
other: GH_OrdinateDimension to duplicate

Grasshopper.Kernel.Types.GH_OrdinateDimension.#ctor(System.Guid)
Create a new referenced ordinate dimension that references a Rhino dimension with the specified ID.
ref_guid: ID of dimension object to reference.

Grasshopper.Kernel.Types.GH_OrdinateDimension.DuplicateAnnotation
Create a duplicate of this annotation.

Grasshopper.Kernel.Types.GH_OrdinateDimension.DuplicateOrdinateDimension
Create a duplicate of this ordinate dimension.

Grasshopper.Kernel.Types.GH_OrdinateDimension.ToString
Format the dimension using default grasshopper formatting logic.

Grasshopper.Kernel.Types.GH_OrdinateDimension.CastFrom(System.Object)
Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_OrdinateDimension.CastTo``1(``0@)
Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.