Grasshopper.GUI.GH_MenuShortcut
Maintains information about context and dropdown menu shortcuts.

Grasshopper.GUI.GH_MenuShortcut.#ctor
Create a new blank instance of the GH_MenuShortcutInfo class.

Grasshopper.GUI.GH_MenuShortcut.#ctor(System.String)
Create a new instance of the GH_MenuShortcutInfo class.
itemPath: Path to menu item in menu hierarchy. Use back-slash symbols to separate parent-child items.

Grasshopper.GUI.GH_MenuShortcut.#ctor(System.String,System.Windows.Forms.Keys,System.String)
Create a new instance of the GH_MenuShortcutInfo class.
itemPath: Path to menu item in menu hierarchy. Use back-slash symbols to separate parent-child items.
shortcut: Shortcut to use for menu item.
shortcutText: Text override to display for menu shortcut. Leave blank for default display.

Grasshopper.GUI.GH_MenuShortcut.ItemPath
Gets or sets the menu item path. Submenus are indicated using back-slash symbols
(i.e. "File\Special Folders\Components Folder")

Grasshopper.GUI.GH_MenuShortcut.ItemHierarchy
Gets the menu item hierarchy.

Grasshopper.GUI.GH_MenuShortcut.Shortcut
Gets or sets the menu shortcut keys.

Grasshopper.GUI.GH_MenuShortcut.ShortcutText
Gets or sets the menu shortcut display string.
Leave blank for default display.

Grasshopper.GUI.GH_MenuShortcut.ApplyToMenu(System.Windows.Forms.MenuStrip,System.Collections.Generic.IEnumerable{System.Windows.Forms.ToolStripMenuItem})
Apply this shortcut to an actual menu item.
menu: Menu that contains relevant menu item.
filter: A collection of mutable menu items.
Returns: The menu item that was changed or null on failure.