Grasshopper.GUI.Ribbon.GH_RibbonMouseEventArgs


Grasshopper.GUI.Ribbon.GH_RibbonMouseEventArgs.NewActiveObject(Grasshopper.GUI.Ribbon.IGH_RibbonInteractiveObject)
Register a new active object. This object will have first dips when the next event fires.
nObject: The new active object
Remarks: If another active object has already been registered, you should reconsider hogging the event.

Grasshopper.GUI.Ribbon.GH_RibbonMouseEventArgs.ReleaseActiveObject
Disabled the active object, whatever it is.

Grasshopper.GUI.Ribbon.GH_RibbonMouseEventArgs.ReleaseActiveObject(Grasshopper.GUI.Ribbon.IGH_RibbonInteractiveObject)
Disabled the active object, if it's the same object as the filter. Otherwise nothing happens.
owner_filter: The object to filter