Grasshopper.Kernel.Types.GH_Dimension
Represents an implementation of a Rhino dimension base class.

Grasshopper.Kernel.Types.GH_Dimension.#ctor
Default constructor, creates an invalid dimension.

Grasshopper.Kernel.Types.GH_Dimension.#ctor(Rhino.Geometry.Dimension)
Create a duplicate of an existing dimension.
dimension: Dimension to duplicate

Grasshopper.Kernel.Types.GH_Dimension.#ctor(Rhino.Geometry.Dimension,Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle)
Create a duplicate of an existing dimension.
dimension: Dimension to duplicate
style: Annotation style to use

Grasshopper.Kernel.Types.GH_Dimension.#ctor(Grasshopper.Kernel.Types.GH_Dimension)
Create a duplicate of another GH_Dimension. This constructor also copies reference data.
other: GH_Dimension to duplicate

Grasshopper.Kernel.Types.GH_Dimension.#ctor(System.Guid)
Create a new referenced dimension that references a Rhino dimension with the specified ID.
ref_guid: ID of dimension object to reference.

Grasshopper.Kernel.Types.GH_Dimension.CastTo``1(``0@)
Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.