Grasshopper.Kernel.IGH_VarParamComponent
This interface is obsolete, please use the IGH_VariableParameterComponent interface instead.

Grasshopper.Kernel.IGH_VarParamComponent.IsInputVariable
Gets a flag specifying whether or not the input can potentially contain variable parameters.
Returns: Return TRUE to enable variable parameter UI on the input side.

Grasshopper.Kernel.IGH_VarParamComponent.IsOutputVariable
Gets a flag specifying whether or not the output can potentially contain variable parameters.
Returns: Return TRUE to enable variable parameter UI on the output side.

Grasshopper.Kernel.IGH_VarParamComponent.IsVariableParam(Grasshopper.Kernel.GH_VarParamEventArgs)
Returns a value indicating whether a specific parameter is considered to be variable.

Grasshopper.Kernel.IGH_VarParamComponent.ConstructVariable(Grasshopper.Kernel.GH_VarParamEventArgs)
This function is called whenever a new parameter is required.
You must provide a non-null instance for new_param, otherwise the addition will be cancelled.
The Param field of the event arguments will typically be null.

Grasshopper.Kernel.IGH_VarParamComponent.ManagerConstructed(Grasshopper.Kernel.GH_VarParamSide,Grasshopper.GUI.GH_VariableParameterManager)
This function is called whenever a new manager is constructed. You can override this
function if you wish to modify the default behaviour of the manager.

Grasshopper.Kernel.IGH_VarParamComponent.ParametersModified(Grasshopper.Kernel.GH_VarParamSide)
This function will be called wheneven the param collection of a component has been
altered through the ParamManager. If your parameters have a peculiar naming scheme,
this is the best place to assign those.