Grasshopper.Kernel.Types.GH_DifferentialSolver
Enumerates all implemented differential samplers.

Grasshopper.Kernel.Types.GH_DifferentialSolver.None
Unset solver, always returns a zero-length tensor.

Grasshopper.Kernel.Types.GH_DifferentialSolver.Euler
Euler differential solver.

Grasshopper.Kernel.Types.GH_DifferentialSolver.RungeKutta2
Runge-Kutta second order solver.

Grasshopper.Kernel.Types.GH_DifferentialSolver.RungeKutta3
Runge-Kutta third order solver.

Grasshopper.Kernel.Types.GH_DifferentialSolver.RungeKutta4
Runge-Kutta fourth order solver.