Grasshopper.Kernel.Special.GH_ImageSampler


Grasshopper.Kernel.Special.GH_ImageSampler.ImageSaveInFile
Gets or sets whether the image is saved in the ghx file.

Grasshopper.Kernel.Special.GH_ImageSampler.ImageFilePath
Gets or sets the file path to the image.

Grasshopper.Kernel.Special.GH_ImageSampler.ImageAutoUpdate
Gets or sets whether this sampler responds to image file changes.

Grasshopper.Kernel.Special.GH_ImageSampler.ImageBitsLocked
Gets whether the image bits are locked. The image will be locked in memory to speed up sampling,
but the bit should remain locked only during a Grasshopper solution. You are not allowed to perform
actions on images with locked bits.

Grasshopper.Kernel.Special.GH_ImageSampler.Image
Gets the currently loaded source image. If the image bits are locked,
null will be returned.

Grasshopper.Kernel.Special.GH_ImageSampler.DisplayImage
Gets the display image. If the display image doesn't exist yet, we'll try to create one.