Grasshopper.Instances
Provides access to a bunch of global instances and variables.

Grasshopper.Instances.UnloadAllObjects
Clears and unloads all cached objects. This function is called by the
_GrasshopperUnloadPlugin command. Please don't use it.

Grasshopper.Instances.ReloadMemoryAssemblies
Unload and attempt to reload all plugin assemblies that were loaded via the COFF pipeline.
Returns: Collection of load messages.

Grasshopper.Instances.GrasshopperPluginId
Gets the ID of the Grasshopper Plugin.

Grasshopper.Instances.RcpPanel
Gets the app-domain wide RCP panel instance. If it doesn't exist yet it will be created.

Grasshopper.Instances.IsRemotePanelVisible
Gets whether the Remote Control Panel is currently visible.

Grasshopper.Instances.ShowRemotePanel
Shows the remote control panel.

Grasshopper.Instances.HideRemotePanel
Hides the remote control panel.

Grasshopper.Instances.IsDocumentEditor
Gets whether the Document Editor has been set.

Grasshopper.Instances.DocumentEditor
Gets the DocumentEditor of Grasshopper.

Grasshopper.Instances.IsDocumentEditorOnTopOfViewports
Gets whether the Grasshopper document editor (or any of its child forms) is obscuring a significant part of the Rhino viewports.

Grasshopper.Instances.DocumentEditorFadeOut
Calls the FadeOut() method on the DocumentEditor if it exists.

Grasshopper.Instances.DocumentEditorFadeIn
Calls the FadeIn() method on the DocumentEditor if it exists.

Grasshopper.Instances.IsCursorServer
Gets whether the Cursor server has been set.

Grasshopper.Instances.CursorServer
Gets the CursorServer instance cached by the Instance Server.
The CursorServer will be instantiated the first time this property is accessed.

Grasshopper.Instances.IsComponentServer
Gets whether the Component server has been set.

Grasshopper.Instances.ComponentServer
Gets the ComponentServer instance cached by the Instance Server.
The ComponentServer will be instantiated the first time this property accessed.
This is a rather involved process during which the Grasshopper Banner will be displayed.

Grasshopper.Instances.IsMarkovChain
Gets a value indicating whether or not the MarkovChain has already been initialized.

Grasshopper.Instances.MarkovChain
Gets the MarkovChain instance cached by the Instance Server.
The Markov chain will be instantiated if it hasn't been already.

Grasshopper.Instances.IsDocumentServer
Gets whether the Document server has been set.

Grasshopper.Instances.DocumentServer
Gets the DocumentServer instance cached by the Instance Server.
The DocumentServer will be instantiated the first time this property accessed.

Grasshopper.Instances.IsDocumentAssociationServer
Gets whether the Document Association server has been set.

Grasshopper.Instances.DocumentAssociationServer
Gets the Document Association Server instance cached by the Instance Server.
The Document Association Server will be instantiated the first time this property accessed.

Grasshopper.Instances.IsMruServer
Gets a value indicating whether or not the MRU server has been initialized.

Grasshopper.Instances.MruServer
Gets the MRU_Server instance cached by the Instance Server.
The MRU_Server will be instantiated the first time this property accessed.

Grasshopper.Instances.AutoShowBanner
Gets or sets a value indicating whether or not the banner will be displayed during the ComponentServer Loading process.

Grasshopper.Instances.AutoHideBanner
Gets or sets a value indicating whether the banner ought to be hidden automatically when loading completes.

Grasshopper.Instances.BakeIcon24
Gets the 24x24 pixel bake icon.

Grasshopper.Instances.RunHeadless
Only intended to be called by the GH_RhinoScriptInterface object

Grasshopper.Instances.CanvasCreated
Raised when the main canvas is created.

Grasshopper.Instances.CanvasDestroyed
Raised when the main canvas is destroyed.

Grasshopper.Instances.ActiveCanvas
Gets the currently active Grasshopper canvas (if any)

Grasshopper.Instances.InvalidateCanvas
Invalidates the currently active Grasshopper Canvas, causing a redraw sometime in the foreseeable future.

Grasshopper.Instances.RedrawCanvas
Forces a redraw of the currently active Grasshopper Canvas.

Grasshopper.Instances.RedrawAll
Forces a redraw of both the active canvas and the Rhino viewports.

Grasshopper.Instances.Settings
Represents the default settings database. Feel free to add your own settings to this database.

Grasshopper.Instances.MyTypes
Get all the type identifiers that are part of the Grasshopper assembly.
Returns: An array of Type objects.

Grasshopper.Instances.EnforceInvariantCulture
If the Setting "EnforceInvariantCulture" is set to False, this function does nothing
Remarks:

Grasshopper.Instances.Interop
Gets the Grasshopper 1.0 interop object, i.e. an instance of
GrasshopperPlugin.GrasshopperInterop as exposed via the GetInteropObject()
method on the Grasshopper 1.0 plugin object.