Grasshopper.DataTree`1.DuplicateT
Duplication delegate used in the copy constructor. Implementation should never throw exceptions.
original: Data to copy (might be null)
Returns: A duplicate of the original or null.