Grasshopper.Kernel.Parameters.IGH_TypeHint
Represents conversion logic for a certain data type.

Grasshopper.Kernel.Parameters.IGH_TypeHint.TypeName
Name of target Type

Grasshopper.Kernel.Parameters.IGH_TypeHint.HintID
Unique ID for every type of Hint.

Grasshopper.Kernel.Parameters.IGH_TypeHint.Cast(System.Object,System.Object@)
Apply conversion logic to a specific object. This function should not throw exceptions.
data: Data to convert.
target: Output instance.
Returns: True on success, false on failure. If False is returned, target may be null.