Grasshopper.Kernel.Undo.IGH_UndoAction
Base interface for all undo/redo actions

Grasshopper.Kernel.Undo.IGH_UndoAction.ExpiresSolution
Gets the solution expiration flag for this event.
If True, the solution needs to be recalculated once the entire undo record has been completed.

Grasshopper.Kernel.Undo.IGH_UndoAction.ExpiresDisplay
Gets the display expiration flag for this event. If True, the Rhino viewports will be redrawn
once the entire undo record has been completed.
If ExpiresSolution is set to true, ExpriresDisplay is implied.

Grasshopper.Kernel.Undo.IGH_UndoAction.State
Gets the current state of the undo action.

Grasshopper.Kernel.Undo.IGH_UndoAction.Undo(Grasshopper.Kernel.GH_Document)
Undo the action stored in this record.
doc: The target document.
Throws Grasshopper.Kernel.Undo.GH_UndoException: Thrown when the State flag conflicts with an undo action.

Grasshopper.Kernel.Undo.IGH_UndoAction.Redo(Grasshopper.Kernel.GH_Document)
Redo the action stored in this record.
doc: The target document.
Throws Grasshopper.Kernel.Undo.GH_UndoException: Thrown when the State flag conflicts with a redo action.