Grasshopper.Kernel.GH_TypeLib
Utility module that caches a number of oft-used types and type-ids for quick access.
Do not change any of the values in this module or you'll wreck casting and conversion logic.

Grasshopper.Kernel.GH_TypeLib.t_bool
System.Boolean

Grasshopper.Kernel.GH_TypeLib.t_byte
System.Byte

Grasshopper.Kernel.GH_TypeLib.t_int16
System.Int16

Grasshopper.Kernel.GH_TypeLib.t_int32
System.Int32

Grasshopper.Kernel.GH_TypeLib.t_int64
System.Int64

Grasshopper.Kernel.GH_TypeLib.t_uint16
System.UInt16

Grasshopper.Kernel.GH_TypeLib.t_uint32
System.UInt32

Grasshopper.Kernel.GH_TypeLib.t_uint64
System.UInt64

Grasshopper.Kernel.GH_TypeLib.t_time
System.Date

Grasshopper.Kernel.GH_TypeLib.t_single
System.Single

Grasshopper.Kernel.GH_TypeLib.t_double
System.Double

Grasshopper.Kernel.GH_TypeLib.t_decimal
System.Decimal

Grasshopper.Kernel.GH_TypeLib.t_guid
System.Guid

Grasshopper.Kernel.GH_TypeLib.t_char
System.Char

Grasshopper.Kernel.GH_TypeLib.t_string
System.String

Grasshopper.Kernel.GH_TypeLib.t_color
System.Drawing.Color

Grasshopper.Kernel.GH_TypeLib.t_size
System.Drawing.Size

Grasshopper.Kernel.GH_TypeLib.t_sizef
System.Drawing.SizeF

Grasshopper.Kernel.GH_TypeLib.t_point
System.Drawing.Point

Grasshopper.Kernel.GH_TypeLib.t_pointf
System.Drawing.PointF

Grasshopper.Kernel.GH_TypeLib.t_rectangle
System.Drawing.Rectangle

Grasshopper.Kernel.GH_TypeLib.t_rectanglef
System.Drawing.RectangleF

Grasshopper.Kernel.GH_TypeLib.t_object
System.Object

Grasshopper.Kernel.GH_TypeLib.id_bool
System.Boolean

Grasshopper.Kernel.GH_TypeLib.id_byte
System.Byte

Grasshopper.Kernel.GH_TypeLib.id_int16
System.Int16

Grasshopper.Kernel.GH_TypeLib.id_int32
System.Int32

Grasshopper.Kernel.GH_TypeLib.id_int64
System.Int64

Grasshopper.Kernel.GH_TypeLib.id_uint16
System.UInt16

Grasshopper.Kernel.GH_TypeLib.id_uint32
System.UInt32

Grasshopper.Kernel.GH_TypeLib.id_uint64
System.UInt64

Grasshopper.Kernel.GH_TypeLib.id_time
System.Date

Grasshopper.Kernel.GH_TypeLib.id_single
System.Single

Grasshopper.Kernel.GH_TypeLib.id_double
System.Double

Grasshopper.Kernel.GH_TypeLib.id_decimal
System.Decimal

Grasshopper.Kernel.GH_TypeLib.id_guid
System.Guid

Grasshopper.Kernel.GH_TypeLib.id_char
System.Char

Grasshopper.Kernel.GH_TypeLib.id_string
System.String

Grasshopper.Kernel.GH_TypeLib.id_color
System.Drawing.Color

Grasshopper.Kernel.GH_TypeLib.id_size
System.Drawing.Size

Grasshopper.Kernel.GH_TypeLib.id_sizef
System.Drawing.SizeF

Grasshopper.Kernel.GH_TypeLib.id_point
System.Drawing.Point

Grasshopper.Kernel.GH_TypeLib.id_pointf
System.Drawing.PointF

Grasshopper.Kernel.GH_TypeLib.id_rectangle
System.Drawing.Rectangle

Grasshopper.Kernel.GH_TypeLib.id_rectanglef
System.Drawing.RectangleF

Grasshopper.Kernel.GH_TypeLib.id_object
System.Object

Grasshopper.Kernel.GH_TypeLib.t_gh_goo
Grasshopper.Kernel.Types.IGH_Goo

Grasshopper.Kernel.GH_TypeLib.t_gh_objwrapper
Grasshopper.Kernel.Types.GH_ObjectWrapper

Grasshopper.Kernel.GH_TypeLib.t_gh_bool
Grasshopper.Kernel.Types.GH_Boolean

Grasshopper.Kernel.GH_TypeLib.t_gh_int
Grasshopper.Kernel.Types.GH_Integer

Grasshopper.Kernel.GH_TypeLib.t_gh_number
Grasshopper.Kernel.Types.GH_Number

Grasshopper.Kernel.GH_TypeLib.t_gh_complex
Grasshopper.Kernel.Types.Complex

Grasshopper.Kernel.GH_TypeLib.t_gh_complexnumber
Grasshopper.Kernel.Types.GH_ComplexNumber

Grasshopper.Kernel.GH_TypeLib.t_gh_guid
Grasshopper.Kernel.Types.GH_Guid

Grasshopper.Kernel.GH_TypeLib.t_gh_matrix
Grasshopper.Kernel.Types.GH_Matrix

Grasshopper.Kernel.GH_TypeLib.t_gh_transform
Grasshopper.Kernel.Types.GH_Transform

Grasshopper.Kernel.GH_TypeLib.t_gh_string
Grasshopper.Kernel.Types.GH_String

Grasshopper.Kernel.GH_TypeLib.t_gh_colour
Grasshopper.Kernel.Types.GH_Colour

Grasshopper.Kernel.GH_TypeLib.t_gh_time
Grasshopper.Kernel.Types.GH_Time

Grasshopper.Kernel.GH_TypeLib.t_gh_path
Grasshopper.Kernel.Data.GH_Path

Grasshopper.Kernel.GH_TypeLib.t_gh_structpath
Grasshopper.Kernel.Types.GH_StructurePath

Grasshopper.Kernel.GH_TypeLib.t_gh_material
Grasshopper.Kernel.Types.GH_Material

Grasshopper.Kernel.GH_TypeLib.t_gh_interval2D
Grasshopper.Kernel.Types.GH_Interval2D

Grasshopper.Kernel.GH_TypeLib.t_gh_uvinterval
Grasshopper.Kernel.Types.UVInterval

Grasshopper.Kernel.GH_TypeLib.t_gh_interval
Grasshopper.Kernel.Types.GH_Interval

Grasshopper.Kernel.GH_TypeLib.t_gh_vector
Grasshopper.Kernel.Types.GH_Vector

Grasshopper.Kernel.GH_TypeLib.t_gh_point
Grasshopper.Kernel.Types.GH_Point

Grasshopper.Kernel.GH_TypeLib.t_gh_plane
Grasshopper.Kernel.Types.GH_Plane

Grasshopper.Kernel.GH_TypeLib.t_gh_arc
Grasshopper.Kernel.Types.GH_Arc

Grasshopper.Kernel.GH_TypeLib.t_gh_line
Grasshopper.Kernel.Types.GH_Line

Grasshopper.Kernel.GH_TypeLib.t_gh_curve
Grasshopper.Kernel.Types.GH_Curve

Grasshopper.Kernel.GH_TypeLib.t_gh_circle
Grasshopper.Kernel.Types.GH_Circle

Grasshopper.Kernel.GH_TypeLib.t_gh_rectangle
Grasshopper.Kernel.Types.GH_Rectangle

Grasshopper.Kernel.GH_TypeLib.t_gh_box
Grasshopper.Kernel.Types.GH_Box

Grasshopper.Kernel.GH_TypeLib.t_gh_brep
Grasshopper.Kernel.Types.GH_Brep

Grasshopper.Kernel.GH_TypeLib.t_gh_subd
Grasshopper.Kernel.Types.GH_Brep

Grasshopper.Kernel.GH_TypeLib.t_gh_surface
Grasshopper.Kernel.Types.GH_Surface

Grasshopper.Kernel.GH_TypeLib.t_gh_extrusion
Grasshopper.Kernel.Types.GH_Extrusion

Grasshopper.Kernel.GH_TypeLib.t_gh_mesh
Grasshopper.Kernel.Types.GH_Mesh

Grasshopper.Kernel.GH_TypeLib.t_gh_meshface
Grasshopper.Kernel.Types.GH_MeshFace

Grasshopper.Kernel.GH_TypeLib.t_gh_pointcloud
Grasshopper.Kernel.Types.GH_PointCloud

Grasshopper.Kernel.GH_TypeLib.t_gh_hatch
Grasshopper.DocObjects.Types.GH_Hatch

Grasshopper.Kernel.GH_TypeLib.t_gh_textdot
Grasshopper.DocObjects.Types.GH_TextDot

Grasshopper.Kernel.GH_TypeLib.t_gh_annotationbase
Grasshopper.DocObjects.Types.GH_AnnotationBase

Grasshopper.Kernel.GH_TypeLib.t_gh_textentity
Grasshopper.DocObjects.Types.GH_TextEntity

Grasshopper.Kernel.GH_TypeLib.t_gh_leader
Grasshopper.DocObjects.Types.GH_Leader

Grasshopper.Kernel.GH_TypeLib.t_gh_dimension
Grasshopper.DocObjects.Types.GH_Dimension

Grasshopper.Kernel.GH_TypeLib.t_gh_lineardimension
Grasshopper.DocObjects.Types.GH_LinearDimension

Grasshopper.Kernel.GH_TypeLib.t_gh_ordinatedimension
Grasshopper.DocObjects.Types.GH_OrdinateDimension

Grasshopper.Kernel.GH_TypeLib.t_gh_radialdimension
Grasshopper.DocObjects.Types.GH_RadialDimension

Grasshopper.Kernel.GH_TypeLib.t_gh_angulardimension
Grasshopper.DocObjects.Types.GH_AngularDimension

Grasshopper.Kernel.GH_TypeLib.t_gh_centermark
Grasshopper.DocObjects.Types.GH_Centermark

Grasshopper.Kernel.GH_TypeLib.t_gh_instancereference
Grasshopper.DocObjects.Types.GH_InstanceReference

Grasshopper.Kernel.GH_TypeLib.t_gh_modelobject
Grasshopper.DocObjects.Types.GH_ModelObject

Grasshopper.Kernel.GH_TypeLib.t_gh_light
Grasshopper.DocObjects.Types.GH_Light

Grasshopper.Kernel.GH_TypeLib.id_gh_goo
Grasshopper.Kernel.Types.IGH_Goo

Grasshopper.Kernel.GH_TypeLib.id_gh_objwrapper
Grasshopper.Kernel.Types.GH_ObjectWrapper

Grasshopper.Kernel.GH_TypeLib.id_gh_bool
Grasshopper.Kernel.Types.GH_Boolean

Grasshopper.Kernel.GH_TypeLib.id_gh_int
Grasshopper.Kernel.Types.GH_Integer

Grasshopper.Kernel.GH_TypeLib.id_gh_number
Grasshopper.Kernel.Types.GH_Number

Grasshopper.Kernel.GH_TypeLib.id_gh_complex
Grasshopper.Kernel.Types.Complex

Grasshopper.Kernel.GH_TypeLib.id_gh_complexnumber
Grasshopper.Kernel.Types.GH_ComplexNumber

Grasshopper.Kernel.GH_TypeLib.id_gh_guid
Grasshopper.Kernel.Types.GH_Guid

Grasshopper.Kernel.GH_TypeLib.id_gh_matrix
Grasshopper.Kernel.Types.GH_Matrix

Grasshopper.Kernel.GH_TypeLib.id_gh_transform
Grasshopper.Kernel.Types.GH_Transform

Grasshopper.Kernel.GH_TypeLib.id_gh_string
Grasshopper.Kernel.Types.GH_String

Grasshopper.Kernel.GH_TypeLib.id_gh_colour
Grasshopper.Kernel.Types.GH_Colour

Grasshopper.Kernel.GH_TypeLib.id_gh_time
Grasshopper.Kernel.Types.GH_Time

Grasshopper.Kernel.GH_TypeLib.id_gh_path
Grasshopper.Kernel.Data.GH_Path

Grasshopper.Kernel.GH_TypeLib.id_gh_structpath
Grasshopper.Kernel.Types.GH_StructurePath

Grasshopper.Kernel.GH_TypeLib.id_gh_material
Grasshopper.Kernel.Types.GH_Material

Grasshopper.Kernel.GH_TypeLib.id_gh_interval2D
Grasshopper.Kernel.Types.GH_Interval2D

Grasshopper.Kernel.GH_TypeLib.id_gh_uvinterval
Grasshopper.Kernel.Types.UVInterval

Grasshopper.Kernel.GH_TypeLib.id_gh_interval
Grasshopper.Kernel.Types.GH_Interval

Grasshopper.Kernel.GH_TypeLib.id_gh_vector
Grasshopper.Kernel.Types.GH_Vector

Grasshopper.Kernel.GH_TypeLib.id_gh_point
Grasshopper.Kernel.Types.GH_Point

Grasshopper.Kernel.GH_TypeLib.id_gh_plane
Grasshopper.Kernel.Types.GH_Plane

Grasshopper.Kernel.GH_TypeLib.id_gh_arc
Grasshopper.Kernel.Types.GH_Arc

Grasshopper.Kernel.GH_TypeLib.id_gh_line
Grasshopper.Kernel.Types.GH_Line

Grasshopper.Kernel.GH_TypeLib.id_gh_curve
Grasshopper.Kernel.Types.GH_Curve

Grasshopper.Kernel.GH_TypeLib.id_gh_circle
Grasshopper.Kernel.Types.GH_Circle

Grasshopper.Kernel.GH_TypeLib.id_gh_rectangle
Grasshopper.Kernel.Types.GH_Rectangle

Grasshopper.Kernel.GH_TypeLib.id_gh_box
Grasshopper.Kernel.Types.GH_Box

Grasshopper.Kernel.GH_TypeLib.id_gh_brep
Grasshopper.Kernel.Types.GH_Brep

Grasshopper.Kernel.GH_TypeLib.id_gh_subd
Grasshopper.Kernel.Types.GH_SubD

Grasshopper.Kernel.GH_TypeLib.id_gh_surface
Grasshopper.Kernel.Types.GH_Surface

Grasshopper.Kernel.GH_TypeLib.id_gh_extrusion
Grasshopper.Kernel.Types.GH_Extrusion

Grasshopper.Kernel.GH_TypeLib.id_gh_mesh
Grasshopper.Kernel.Types.GH_Mesh

Grasshopper.Kernel.GH_TypeLib.id_gh_meshface
Grasshopper.Kernel.Types.GH_MeshFace

Grasshopper.Kernel.GH_TypeLib.id_gh_pointcloud
Grasshopper.Kernel.Types.GH_PointCloud

Grasshopper.Kernel.GH_TypeLib.id_gh_hatch
Grasshopper.Kernel.Types.GH_Hatch

Grasshopper.Kernel.GH_TypeLib.id_gh_textentity
Grasshopper.DocObjects.Types.GH_TextEntity

Grasshopper.Kernel.GH_TypeLib.id_gh_textdot
Grasshopper.DocObjects.Types.GH_TextDot

Grasshopper.Kernel.GH_TypeLib.id_gh_leader
Grasshopper.DocObjects.Types.GH_Leader

Grasshopper.Kernel.GH_TypeLib.id_gh_dimension
Grasshopper.DocObjects.Types.GH_Dimension

Grasshopper.Kernel.GH_TypeLib.id_gh_lineardimension
Grasshopper.DocObjects.Types.GH_LinearDimension

Grasshopper.Kernel.GH_TypeLib.id_gh_ordinatedimension
Grasshopper.DocObjects.Types.GH_OrdinateDimension

Grasshopper.Kernel.GH_TypeLib.id_gh_radialdimension
Grasshopper.DocObjects.Types.GH_RadialDimension

Grasshopper.Kernel.GH_TypeLib.id_gh_angulardimension
Grasshopper.DocObjects.Types.GH_AngularDimension

Grasshopper.Kernel.GH_TypeLib.id_gh_centermark
Grasshopper.DocObjects.Types.GH_Centermark

Grasshopper.Kernel.GH_TypeLib.id_gh_instancereference
Grasshopper.DocObjects.Types.GH_InstanceReference

Grasshopper.Kernel.GH_TypeLib.id_gh_modelobject
Grasshopper.DocObjects.Types.GH_ModelObject

Grasshopper.Kernel.GH_TypeLib.id_gh_light
Grasshopper.DocObjects.Types.GH_ModelObject

Grasshopper.Kernel.GH_TypeLib.t_rc_plane
Rhino.Geometry.Plane

Grasshopper.Kernel.GH_TypeLib.t_rc_point3d
Rhino.Geometry.Point3d

Grasshopper.Kernel.GH_TypeLib.t_rc_point3f
Rhino.Geometry.Point3f

Grasshopper.Kernel.GH_TypeLib.t_rc_vector3d
Rhino.Geometry.Vector3d

Grasshopper.Kernel.GH_TypeLib.t_rc_vector3f
Rhino.Geometry.Vector3f

Grasshopper.Kernel.GH_TypeLib.t_rc_transform
Rhino.Geometry.Transform

Grasshopper.Kernel.GH_TypeLib.t_rc_interval
Rhino.Geometry.Interval

Grasshopper.Kernel.GH_TypeLib.t_rc_matrix
Rhino.Geometry.Matrix

Grasshopper.Kernel.GH_TypeLib.t_rc_line
Rhino.Geometry.Line

Grasshopper.Kernel.GH_TypeLib.t_rc_rectangle
Rhino.Geometry.Rectangle3d

Grasshopper.Kernel.GH_TypeLib.t_rc_arc
Rhino.Geometry.Arc

Grasshopper.Kernel.GH_TypeLib.t_rc_circle
Rhino.Geometry.Circle

Grasshopper.Kernel.GH_TypeLib.t_rc_ellipse
Rhino.Geometry.Circle

Grasshopper.Kernel.GH_TypeLib.t_rc_polyline
Rhino.Geometry.Polyline

Grasshopper.Kernel.GH_TypeLib.t_rc_box
Rhino.Geometry.Box

Grasshopper.Kernel.GH_TypeLib.t_rc_boundingbox
Rhino.Geometry.BoundingBox

Grasshopper.Kernel.GH_TypeLib.t_rc_sphere
Rhino.Geometry.Torus

Grasshopper.Kernel.GH_TypeLib.t_rc_cone
Rhino.Geometry.Cone

Grasshopper.Kernel.GH_TypeLib.t_rc_cylinder
Rhino.Geometry.Cylinder

Grasshopper.Kernel.GH_TypeLib.t_rc_torus
Rhino.Geometry.Torus

Grasshopper.Kernel.GH_TypeLib.t_rc_curve
Rhino.Geometry.Curve

Grasshopper.Kernel.GH_TypeLib.t_rc_linecurve
Rhino.Geometry.LineCurve

Grasshopper.Kernel.GH_TypeLib.t_rc_polylinecurve
Rhino.Geometry.PolylineCurve

Grasshopper.Kernel.GH_TypeLib.t_rc_arccurve
Rhino.Geometry.ArcCurve

Grasshopper.Kernel.GH_TypeLib.t_rc_nurbscurve
Rhino.Geometry.NurbsCurve

Grasshopper.Kernel.GH_TypeLib.t_rc_polycurve
Rhino.Geometry.PolyCurve

Grasshopper.Kernel.GH_TypeLib.t_rc_surface
Rhino.Geometry.Surface

Grasshopper.Kernel.GH_TypeLib.t_rc_sumsurface
Rhino.Geometry.SumSurface

Grasshopper.Kernel.GH_TypeLib.t_rc_revsurface
Rhino.Geometry.RevSurface

Grasshopper.Kernel.GH_TypeLib.t_rc_nurbssurface
Rhino.Geometry.NurbsSurface

Grasshopper.Kernel.GH_TypeLib.t_rc_planesurface
Rhino.Geometry.PlaneSurface

Grasshopper.Kernel.GH_TypeLib.t_rc_brep
Rhino.Geometry.Brep

Grasshopper.Kernel.GH_TypeLib.t_rc_brepface
Rhino.Geometry.MeshFace

Grasshopper.Kernel.GH_TypeLib.t_rc_brepedge
Rhino.Geometry.MeshEdge

Grasshopper.Kernel.GH_TypeLib.t_rc_subd
Rhino.Geometry.SubD

Grasshopper.Kernel.GH_TypeLib.t_rc_extrusion
Rhino.Geometry.Extrusion.

Grasshopper.Kernel.GH_TypeLib.t_rc_mesh
Rhino.Geometry.Mesh

Grasshopper.Kernel.GH_TypeLib.t_rc_meshface
Rhino.Geometry.MeshFace

Grasshopper.Kernel.GH_TypeLib.t_rc_point
Rhino.Geometry.Point

Grasshopper.Kernel.GH_TypeLib.t_rc_pointcloud
Rhino.Geometry.PointCloud

Grasshopper.Kernel.GH_TypeLib.t_rc_hatch
Rhino.Geometry.Hatch

Grasshopper.Kernel.GH_TypeLib.t_rc_textdot
Rhino.Geometry.TextDot

Grasshopper.Kernel.GH_TypeLib.t_rc_annotationbase
Rhino.Geometry.AnnotationBase

Grasshopper.Kernel.GH_TypeLib.t_rc_textentity
Rhino.Geometry.TextEntity

Grasshopper.Kernel.GH_TypeLib.t_rc_leader
Rhino.Geometry.Leader

Grasshopper.Kernel.GH_TypeLib.t_rc_dimension
Rhino.Geometry.Dimension

Grasshopper.Kernel.GH_TypeLib.t_rc_lineardimension
Rhino.Geometry.LinearDimension

Grasshopper.Kernel.GH_TypeLib.t_rc_ordinatedimension
Rhino.Geometry.OrdinateDimension

Grasshopper.Kernel.GH_TypeLib.t_rc_radialdimension
Rhino.Geometry.RadialDimension

Grasshopper.Kernel.GH_TypeLib.t_rc_angulardimension
Rhino.Geometry.AngularDimension

Grasshopper.Kernel.GH_TypeLib.t_rc_centermark
Rhino.Geometry.Centermark

Grasshopper.Kernel.GH_TypeLib.t_rc_instancereference
Rhino.Geometry.InstanceReferenceGeometry

Grasshopper.Kernel.GH_TypeLib.t_rc_light
Rhino.Geometry.Light

Grasshopper.Kernel.GH_TypeLib.id_rc_plane
Rhino.Geometry.Plane

Grasshopper.Kernel.GH_TypeLib.id_rc_point3d
Rhino.Geometry.Point3d

Grasshopper.Kernel.GH_TypeLib.id_rc_point3f
Rhino.Geometry.Point3f

Grasshopper.Kernel.GH_TypeLib.id_rc_vector3d
Rhino.Geometry.Vector3d

Grasshopper.Kernel.GH_TypeLib.id_rc_vector3f
Rhino.Geometry.Vector3f

Grasshopper.Kernel.GH_TypeLib.id_rc_transform
Rhino.Geometry.Transform

Grasshopper.Kernel.GH_TypeLib.id_rc_interval
Rhino.Geometry.Interval

Grasshopper.Kernel.GH_TypeLib.id_rc_matrix
Rhino.Geometry.Matrix

Grasshopper.Kernel.GH_TypeLib.id_rc_line
Rhino.Geometry.Line

Grasshopper.Kernel.GH_TypeLib.id_rc_rectangle
Rhino.Geometry.Rectangle3d

Grasshopper.Kernel.GH_TypeLib.id_rc_arc
Rhino.Geometry.Arc

Grasshopper.Kernel.GH_TypeLib.id_rc_circle
Rhino.Geometry.Circle

Grasshopper.Kernel.GH_TypeLib.id_rc_ellipse
Rhino.Geometry.Circle

Grasshopper.Kernel.GH_TypeLib.id_rc_polyline
Rhino.Geometry.Polyline

Grasshopper.Kernel.GH_TypeLib.id_rc_box
Rhino.Geometry.Box

Grasshopper.Kernel.GH_TypeLib.id_rc_boundingbox
Rhino.Geometry.BoundingBox

Grasshopper.Kernel.GH_TypeLib.id_rc_sphere
Rhino.Geometry.Torus

Grasshopper.Kernel.GH_TypeLib.id_rc_cone
Rhino.Geometry.Cone

Grasshopper.Kernel.GH_TypeLib.id_rc_cylinder
Rhino.Geometry.Cylinder

Grasshopper.Kernel.GH_TypeLib.id_rc_torus
Rhino.Geometry.Torus

Grasshopper.Kernel.GH_TypeLib.id_rc_curve
Rhino.Geometry.Curve

Grasshopper.Kernel.GH_TypeLib.id_rc_linecurve
Rhino.Geometry.LineCurve

Grasshopper.Kernel.GH_TypeLib.id_rc_polylinecurve
Rhino.Geometry.PolylineCurve

Grasshopper.Kernel.GH_TypeLib.id_rc_arccurve
Rhino.Geometry.ArcCurve

Grasshopper.Kernel.GH_TypeLib.id_rc_nurbscurve
Rhino.Geometry.NurbsCurve

Grasshopper.Kernel.GH_TypeLib.id_rc_polycurve
Rhino.Geometry.PolyCurve

Grasshopper.Kernel.GH_TypeLib.id_rc_surface
Rhino.Geometry.Surface

Grasshopper.Kernel.GH_TypeLib.id_rc_sumsurface
Rhino.Geometry.SumSurface

Grasshopper.Kernel.GH_TypeLib.id_rc_revsurface
Rhino.Geometry.RevSurface

Grasshopper.Kernel.GH_TypeLib.id_rc_nurbssurface
Rhino.Geometry.NurbsSurface

Grasshopper.Kernel.GH_TypeLib.id_rc_planesurface
Rhino.Geometry.PlaneSurface

Grasshopper.Kernel.GH_TypeLib.id_rc_extrusion
Rhino.Geometry.Extrusion

Grasshopper.Kernel.GH_TypeLib.id_rc_brep
Rhino.Geometry.Brep

Grasshopper.Kernel.GH_TypeLib.id_rc_brepface
Rhino.Geometry.MeshFace

Grasshopper.Kernel.GH_TypeLib.id_rc_brepedge
Rhino.Geometry.MeshEdge

Grasshopper.Kernel.GH_TypeLib.id_rc_subd
Rhino.Geometry.SubD

Grasshopper.Kernel.GH_TypeLib.id_rc_mesh
Rhino.Geometry.Mesh

Grasshopper.Kernel.GH_TypeLib.id_rc_meshface
Rhino.Geometry.MeshFace

Grasshopper.Kernel.GH_TypeLib.id_rc_point
Rhino.Geometry.Point

Grasshopper.Kernel.GH_TypeLib.id_rc_pointcloud
Rhino.Geometry.PointCloud

Grasshopper.Kernel.GH_TypeLib.id_rc_hatch
Rhino.Geometry.Hatch

Grasshopper.Kernel.GH_TypeLib.id_rc_textentity
Rhino.Geometry.TextEntity

Grasshopper.Kernel.GH_TypeLib.id_rc_textdot
Rhino.Geometry.TextDot

Grasshopper.Kernel.GH_TypeLib.id_rc_leader
Rhino.Geometry.Leader

Grasshopper.Kernel.GH_TypeLib.id_rc_dimension
Rhino.Geometry.Dimension

Grasshopper.Kernel.GH_TypeLib.id_rc_lineardimension
Rhino.Geometry.LinearDimension

Grasshopper.Kernel.GH_TypeLib.id_rc_ordinatedimension
Rhino.Geometry.OrdinateDimension

Grasshopper.Kernel.GH_TypeLib.id_rc_radialdimension
Rhino.Geometry.RadialDimension

Grasshopper.Kernel.GH_TypeLib.id_rc_angulardimension
Rhino.Geometry.AngularDimension

Grasshopper.Kernel.GH_TypeLib.id_rc_centermark
Rhino.Geometry.Centermark

Grasshopper.Kernel.GH_TypeLib.id_rc_instancereference
Rhino.Geometry.InstanceReferenceGeometry

Grasshopper.Kernel.GH_TypeLib.id_rc_light
Rhino.Geometry.Light