Grasshopper.Kernel.IGH_DocumentObject
Base interface for objects that want to play on the Canvas.
Do not implement this interface from scratch. Either inherit from
GH_DocumentObject or one of the other partially finished types such as
GH_ActiveObject, GH_Param(Of T) or GH_Component.

Grasshopper.Kernel.IGH_DocumentObject.SolutionExpired
Raised whenever the solution of a certain object becomes invalid.
sender: The object that raised the event.
e: Details of event.

Grasshopper.Kernel.IGH_DocumentObject.OnSolutionExpired(System.Boolean)
Raises the SolutionExpired event on the toplevel object.
recompute: If True, the solution will be immediately recalculated.

Grasshopper.Kernel.IGH_DocumentObject.ExpireSolution(System.Boolean)
Call this function whenever you do something which expires the current solution.
This will make sure all caches are erased, all downstream objects are expired and that
the event is raised.
The default implementation merely places a call to OnSolutionExpired(), override this function
in derived classes to make sure you clear local data caches and expire downstream objects.
recompute: If True, the solution will be recomputed straight away.

Grasshopper.Kernel.IGH_DocumentObject.DisplayExpired
Raised whenever the display (on the Canvas) of a certain object becomes invalid.
sender: The object that raised the event.
e: Details of event.

Grasshopper.Kernel.IGH_DocumentObject.OnDisplayExpired(System.Boolean)
Raises the DisplayExpired event on the toplevel object.
redraw: If True, the canvas will be immediately redrawn.

Grasshopper.Kernel.IGH_DocumentObject.PreviewExpired
Raised whenever the display (in the Rhino viewports) of a certain object becomes invalid.
sender: The object that raised the event.
e: Details of event.

Grasshopper.Kernel.IGH_DocumentObject.OnPreviewExpired(System.Boolean)
Raises the PreviewExpired event on the toplevel object.
redraw: If True, the viewports will be immediately redrawn.

Grasshopper.Kernel.IGH_DocumentObject.ExpirePreview(System.Boolean)
Call this function when you suspect that the preview has expired for this object.
This will cause the display cache to be eradicated.

Grasshopper.Kernel.IGH_DocumentObject.ObjectChanged
Raised whenever some property of the object changes that would affect remote instances.
sender: The object that raised the event.
e: Details of event

Grasshopper.Kernel.IGH_DocumentObject.OnObjectChanged(Grasshopper.Kernel.GH_ObjectEventType)
Raises the ObjectChanged event on the current (!not the top level!) object.
eventType: Type of change.

Grasshopper.Kernel.IGH_DocumentObject.OnObjectChanged(System.String)
Raises the ObjectChanged event on the current (!not the top level!) object.
customEvent: Custom change type name.

Grasshopper.Kernel.IGH_DocumentObject.OnObjectChanged(Grasshopper.Kernel.GH_ObjectEventType,System.Object)
Raises the ObjectChanged event on the current (!not the top level!) object.
eventType: Type of change.
tag: Tag to apply to the event arguments.

Grasshopper.Kernel.IGH_DocumentObject.OnObjectChanged(System.String,System.Object)
Raises the ObjectChanged event on the current (!not the top level!) object.
customEvent: Custom change type name.
tag: Tag to apply to the event arguments.

Grasshopper.Kernel.IGH_DocumentObject.OnObjectChanged(Grasshopper.Kernel.GH_ObjectChangedEventArgs)
Raises the ObjectChanged event on the current (!not the top level!) object.
e: Fully constructed event arguments.

Grasshopper.Kernel.IGH_DocumentObject.AttributesChanged
Raised whenever the number or kind of attributes changes. This event is handled
by GH_Documents who subsequently wipe their attribute caches.
sender: The object that raised the event.
e: Details of event

Grasshopper.Kernel.IGH_DocumentObject.OnAttributesChanged
Raises the AttributesChanged event on the toplevel object.

Grasshopper.Kernel.IGH_DocumentObject.PingDocument
Raised whenever an object needs to know which GH_Document it belongs to.
sender: Object that sends the ping.
e: Ping arguments, documents which handle this event should,
assign themselves to the Document field in this argument.

Grasshopper.Kernel.IGH_DocumentObject.OnPingDocument
Raise the PingDocument Event on the toplevel object and try to find
the document which owns this object.
Returns: The document which owns this object if successful,
or nothing if no document owns this object.

Grasshopper.Kernel.IGH_DocumentObject.TriggerAutoSave
Triggers the AutoSave function on the owner document with the object_changed flag.

Grasshopper.Kernel.IGH_DocumentObject.TriggerAutoSave(Grasshopper.Kernel.GH_AutoSaveTrigger)
Triggers the AutoSave function on the owner document with a custom flag.
trigger: Reason for the autosave operation. It is possible that a user has decided
to avoid autosave events for specific types, so if you can, try and provide a correct trigger flag.

Grasshopper.Kernel.IGH_DocumentObject.TriggerAutoSave(System.Guid)
Triggers the AutoSave function on the owner document with the object_changed flag.
id: ID of autosave event. Consecutive autosave requests with the same ID will be ignored.

Grasshopper.Kernel.IGH_DocumentObject.TriggerAutoSave(Grasshopper.Kernel.GH_AutoSaveTrigger,System.Guid)
Triggers the AutoSave function on the owner document with a custom flag.
trigger: Reason for the autosave operation. It is possible that a user has decided
to avoid autosave events for specific types, so if you can, try and provide a correct trigger flag.
id: ID of autosave event. Consecutive autosave requests with the same ID will be ignored.

Grasshopper.Kernel.IGH_DocumentObject.RecordUndoEvent(System.String)
Record a generic object change undo event.
undoName: Name of undo record.

Grasshopper.Kernel.IGH_DocumentObject.RecordUndoEvent(System.String,Grasshopper.Kernel.Undo.IGH_UndoAction)
Record a specific object change undo event.
undoName: Name of undo record.
action: Undo action to record.

Grasshopper.Kernel.IGH_DocumentObject.RecordUndoEvent(Grasshopper.Kernel.Undo.GH_UndoRecord)
Record an entire undo record.
record: Record to push.

Grasshopper.Kernel.IGH_DocumentObject.AddedToDocument(Grasshopper.Kernel.GH_Document)
This method will be called when an object is added to a document.
document: Document that now owns this object.

Grasshopper.Kernel.IGH_DocumentObject.RemovedFromDocument(Grasshopper.Kernel.GH_Document)
This method will be called when an object is removed from a document.
document: Document that now no longer owns this object.

Grasshopper.Kernel.IGH_DocumentObject.MovedBetweenDocuments(Grasshopper.Kernel.GH_Document,Grasshopper.Kernel.GH_Document)
This method will be called when an object is moved from one document to another.
oldDocument: Document that used to own this object.
newDocument: Document that now owns ths object.

Grasshopper.Kernel.IGH_DocumentObject.DocumentContextChanged(Grasshopper.Kernel.GH_Document,Grasshopper.Kernel.GH_DocumentContext)
This method will be called when the document that owns this object moves into a different context.
document: Document that owns this object.
context: The reason for this event.

Grasshopper.Kernel.IGH_DocumentObject.Obsolete
Gets whether this object is Obsolete.

Grasshopper.Kernel.IGH_DocumentObject.Exposure
Gets the exposure of this object in the Graphical User Interface.

Grasshopper.Kernel.IGH_DocumentObject.AppendMenuItems(System.Windows.Forms.ToolStripDropDown)
This function is called when a context menu is about to be displayed.
Override it to set custom items.
menu: Menu object to populate.

Grasshopper.Kernel.IGH_DocumentObject.Icon_24x24
The icon associated with this object.

Grasshopper.Kernel.IGH_DocumentObject.Icon_24x24_Locked
The greyscale icon of this object.

Grasshopper.Kernel.IGH_DocumentObject.IconDisplayMode
Gets the current display mode of the object.

Grasshopper.Kernel.IGH_DocumentObject.CreateAttributes
Create new default attributes for this object. You should only call this function
when the Attributes() field is null.

Grasshopper.Kernel.IGH_DocumentObject.IsolateObject
Destroy all connections to other objects.

Grasshopper.Kernel.IGH_DocumentObject.Attributes
Gets or sets the attributes that are associated with this object.
Only set custom attributes if you know what you are doing.

Grasshopper.Kernel.IGH_DocumentObject.ComponentGuid
Returns a consistent ID for this object type. Every object must supply a unique and unchanging
ID that is used to identify objects of the same type.