Grasshopper.Kernel.GH_Component.GH_StructureIterator


Grasshopper.Kernel.GH_Component.GH_StructureIterator.#ctor(Grasshopper.Kernel.GH_Component)
Create a new structure iterator.
parent: Owner component of this iterator. Cannot be null.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.m_target
Represents the data targets (paths and indices) of the current operation.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.m_allLists
True if all input parameters have list access.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.m_list
Current lists. Tree parameters do not have meaningful lists.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.m_listLength
Length of each current List.
If the branch is null, the length is set to 0.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.m_itemIndex
Item indices for the current iteration.
List and Tree parameters do not have meaningful indices.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.m_listIndex
Branch indices for the current iteration. Tree parameters do not have meaningful indices.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.Input(System.Int32)
Gets a pointer to the input parameter at the specified index.
index: Index of input parameter. Must be valid

Grasshopper.Kernel.GH_Component.GH_StructureIterator.Output(System.Int32)
Gets a pointer to the output parameter at the specified index.
index: Index of output parameter. Must be valid

Grasshopper.Kernel.GH_Component.GH_StructureIterator.CastData``1(System.Object,``0@)
Convert data from the unknown type to a target type.
Conversion is optimized and will only duplicate data if the types are not the same.
Target type of data conversion.
in: Input, cannot be null.
out: Output, is expected to be null.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.UpdateOutputPath
Compute the new output path plus index.
If there are no input parameters, the path root is incremented.
If there is only a single input param, that path is copied.
If there are multiple connected input params, the most complex path is copied.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.m_principalIndex
Master parameter cache, do not access this directly, call MasterParameter() instead.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.PrincipalParameter
Attempts to find the most important input parameter that defines this operation.
Returns: The index of the master parameter or -1 if no master parameter can be identified.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.MostComplexParameter
Returns the index of the most complex parameter.
This parameter is key when deciding on output paths for components.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.IncrementBranchIndices
Call this function to increment the branch indices.
At present all branch indices are incremented whenever possible.
This amounts to "Longest List Matching" logic.
This function also resets all item indices.
Returns: True on success, false on failure.
If none of the branch indices are incremented, you should stop iteration.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.IncrementItemIndices
Call this function to increment the item indices inside the branches.
Incrementation will occur in accordance with the DataMatching property of the owner component.
Returns: True on success, false on failure.
If the indices cannot be incremented, you should increment the branches next.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.IncrementItemIndices_ShortestList
Increments all item indices using ShortestList Matching algorithms.
If all parameters have been successfully incremented, the result is True.
Returns: True if all non-list parameters have been incremented successfully.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.IncrementItemIndices_LongestList
Increments all item indices using LongestList Matching algorithms.
If at least one parameter has been successfully incremented, the result is True.
Returns: True if at least one non-list parameters has been incremented successfully.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.IncrementItemIndices_All(System.Int32@,System.Int32@)
Attempts to increment all item indices. Indices are not incremented beyond the end of their list.
And list parameters are not incremented at all.
Increments: The number of successfully incremented indices.
Overflows: The number of overflows

Grasshopper.Kernel.GH_Component.GH_StructureIterator.IncrementItemIndices_CrossReference(System.Int32)
Attempts to increment one item index.
layer: This function is recursive.
If you're calling it from elsewhere, then supply zero as the layer hint.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.UpdateListPointer(System.Int32)
This will update the cached reference and length of branch at the given parameter index (layer).
The m_branch_index(layer) value must be correct before calling this function.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.Iteration
Gets the current iteration count.
The first time the SolveInstance() function is called on a component
during a solution the Iteration counter will be zero. It will be
incremented by one for every subsequent call.
Returns: An integer representing the iteration count.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.IncrementIteration
Increment the iteration count by 1.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.DisableGapLogic
Call this function if you want to disable the gap null logic for the current iteration.
After you call this function, nulls will not be inserted into output parameters when the
component fails to assign data itself.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.DisableGapLogic(System.Int32)
Call this function if you want to disable the gap null logic for the current iteration.
After you call this function, nulls will not be inserted into output parameters when the
component fails to assign data itself.
index: Index of parameter for which to disable gap logic.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.ParameterTargetPath(System.Int32)
Get the target path for the specified output parameter.
index: Index of output parameter.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.ParameterTargetIndex(System.Int32)
Get the target index for the specified output parameter.
index: Index of output parameter.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.AbortComponentSolution
Call this method if you wish to stop solving this component.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.AbortSolution
Gets whether the solution ought to be aborted.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.MungeTypeNameForGUI(System.String)
Process a type name to become more human readable.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.Util_RemoveNullRefs``1(System.Collections.Generic.List{``0})
Remove all null references from a list of items.
Type of list
L: List to filter
Returns: List containing only non-null items. References are shared with L

Grasshopper.Kernel.GH_Component.GH_StructureIterator.Util_CountNullRefs``1(System.Collections.Generic.List{``0})
Count all null references in L
Type of list
L: List to parse
Returns: Number of nulls in L

Grasshopper.Kernel.GH_Component.GH_StructureIterator.Util_CountNonNullRefs``1(System.Collections.Generic.List{``0})
Count all object references in L
Type of list
L: List to parse
Returns: Number of proper objects in L

Grasshopper.Kernel.GH_Component.GH_StructureIterator.Util_EnsureNonNullCount``1(System.Collections.Generic.List{``0},System.Int32)
Tests a list to see if it contains sufficient non-null references.
Type of list
L: List to parse
Returns: True if L contains N or more non-null references.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.Util_FirstNonNullItem``1(System.Collections.Generic.List{``0})
Returns the index of the first non-null item in a list.
Type of list
L: List to parse.
Returns: The index of the first non-null item or -1 if no object reference could be found.