Grasshopper.Kernel.Special.GH_LegendType
Enumerates the possible legend display types.

Grasshopper.Kernel.Special.GH_LegendType.None
Indicates legend should not be drawn.

Grasshopper.Kernel.Special.GH_LegendType.DiscreteVertical
Separate legend items drawn from top to bottom.

Grasshopper.Kernel.Special.GH_LegendType.DiscreteHorizontal
Separate legend items from from left to right.

Grasshopper.Kernel.Special.GH_LegendType.SmoothVertical
Continuous legend bar from top to bottom.

Grasshopper.Kernel.Special.GH_LegendType.SmoothHorizontal
Continuous legend bar from left to right.