Grasshopper.Kernel.Special.GH_QuickGraphBundle
Represents a collection of one or more graph tracks and dots.

Grasshopper.Kernel.Special.GH_QuickGraphBundle.#ctor(System.Drawing.Color,System.Double[],System.Double,System.Double)
Create a new bundle.
samples: Samples.
minY: Global minimum Y.
maxY: Global maximum Y.

Grasshopper.Kernel.Special.GH_QuickGraphBundle.IsEmpty
Gets whether this set is empty.

Grasshopper.Kernel.Special.GH_QuickGraphBundle.Render(System.Drawing.Graphics,System.Single,Grasshopper.Kernel.Special.GH_QuickGraphFrame)
Draw this graph into a frame.