Grasshopper.Kernel.Special.GH_NumberSlider


Grasshopper.Kernel.Special.GH_NumberSlider.HarvestDecimalPlaces(System.String)
Try and harvest the number of decimal places implied by a piece of text.
Text must represent a regular number.
text: Text to parse.
Returns: The number of decimal places (though never more than 16) or 0 if no decimal places could be harvested.

Grasshopper.Kernel.Special.GH_NumberSlider.HarvestRange(System.String,System.String@,System.String@,System.String@)
Parse an init code for validity. Valid init codes are A<B, A<B<C, A..B, A..B..C
Where A, B and C can all be evaluated to doubles or integers. This method does not validate whether the
actual values of A, B and C are non-decremental.
Note that sliders can also be initiated using init codes that evaluate to single numbers. This method
does not take those into account. This is purely for validating range inits.
text: Init code to parse.
minimum: If text is a valid init code, the minimum descriptor will be returned here.
maximum: If text is a valid init code, the maximum descriptor will be returned here.
value: If text is a valid init code with a value portion, the value descriptor will be returned here.
Returns: True if the text is a valid init code.

Grasshopper.Kernel.Special.GH_NumberSlider.Slider
Gets the internal slider instance. Do not muck about with this unless you know what you are doing.

Grasshopper.Kernel.Special.GH_NumberSlider.TickCount
Gets the total number of ticks (unique positions) available on the slider.
The number of ticks is limited to one billion (1,000,000,000)

Grasshopper.Kernel.Special.GH_NumberSlider.TickValue
Gets or sets the current slider value as an offset in tick-space.

Grasshopper.Kernel.Special.GH_NumberSlider.TrySetSliderValue(System.Decimal)
Try and set the slider position in such a way as to result in the given value.
If the slider contains an expression this expression will be back-solved (if possible).
target: Target value to achieve.
Returns: True indicating success, false indicating failure.

Grasshopper.Kernel.Special.GH_NumberSlider.SetSliderValue(System.Decimal)
Sets member value directly.
This sets the value of the internal slider, it does not backsolve for any expressions.
val: Value to set.

Grasshopper.Kernel.Special.GH_NumberSlider.CurrentValue
Gets the current slider value.
This includes any expressions that might be active.
Call this property if you want to know the current value.

Grasshopper.Kernel.Special.GH_NumberSlider.Expression
Gets or sets the expression for this slider.

Grasshopper.Kernel.Special.GH_NumberSlider.IsExpression
Gets whether an expression has been assigned to this slider.

Grasshopper.Kernel.Special.GH_NumberSlider.FormatNumber(System.Decimal,Grasshopper.GUI.Base.GH_SliderAccuracy,System.Int32)
Convert a double precision floating point number into a string, using the rounding rules as indicated.
value: Number to munge.
accuracy: Rounding algorithm to use.
digits: Number of digits, only applies for FloatingPoint rounding.

Grasshopper.Kernel.Special.GH_NumberSlider.ImpliedNickName
Gets the implied nickname for this slider object.
The implied nickname is just like the regular nickname,
except when the regular nickname is a zero-length string and
there are one or more recipient parameter, in which case the nickname
is inherited from the recipients.

Grasshopper.Kernel.Special.GH_NumberSlider.SliderGuid
Gets the Slider Component Guid.

Grasshopper.Kernel.Special.GH_NumberSlider.SnappingData
Gets all valid sticky values as intervals.
This automatically adds errors to the slider if a sticky text isn't valid.