Grasshopper.GUI.GH_FontPicker.ShowFontPickerWindow(System.Drawing.Font)
Display the fontpicker in a window.
font: Default font.
Returns: A newly picked font.

Grasshopper.GUI.GH_FontPicker.ShowFontPickerWindow(System.Drawing.Font,System.Windows.Forms.Form)
Display the fontpicker in a window.
font: Default font.
parent: Parent window.
Returns: A newly picked font.

Grasshopper.GUI.GH_FontPicker.CreateFontPickerWindow(System.Drawing.Font)
Create a new window containing a Font Picker object and OK, Cancel buttons.
Picked fonts will be stored in the Tag field of the form.
Returns: A window with a font picker.