Grasshopper.Kernel.Geometry.Voronoi.Cell3Facet
Represents a facet of a 3D voronoi cell.

Grasshopper.Kernel.Geometry.Voronoi.Cell3Facet.CleanUp(System.Double,System.Double@)
Remove coincident points (within tolerance).