Grasshopper.Kernel.IGH_PreviewData
All IGH_Goo types that wish to participate in Viewport redraws must implement this interface.

Grasshopper.Kernel.IGH_PreviewData.ClippingBox
Gets the clipping box for this data. The clipping box
is typically the same as the boundingbox.
Returns: The clipping box for this object.

Grasshopper.Kernel.IGH_PreviewData.DrawViewportWires(Grasshopper.Kernel.GH_PreviewWireArgs)
Implement this function to draw all wire and point previews.
args: Drawing arguments.

Grasshopper.Kernel.IGH_PreviewData.DrawViewportMeshes(Grasshopper.Kernel.GH_PreviewMeshArgs)
Implement this function to draw all shaded meshes.
If the viewport does not support shading, this function will not be called.
args: Drawing arguments.