Grasshopper.GUI.Canvas.GH_BorderTopology
Enumerates all possble border types.

Grasshopper.GUI.Canvas.GH_BorderTopology.None
Unset value.

Grasshopper.GUI.Canvas.GH_BorderTopology.All
All possible types.

Grasshopper.GUI.Canvas.GH_BorderTopology.TopRight
Corner border in the top right area of the box.

Grasshopper.GUI.Canvas.GH_BorderTopology.TopLeft
Corner border in the top left area of the box.

Grasshopper.GUI.Canvas.GH_BorderTopology.BottomLeft
Corner border in the bottom left area of the box.

Grasshopper.GUI.Canvas.GH_BorderTopology.BottomRight
Corner border in the bottom right area of the box.

Grasshopper.GUI.Canvas.GH_BorderTopology.Top
Edge border along the top area of the box.

Grasshopper.GUI.Canvas.GH_BorderTopology.Left
Edge border along the left area of the box.

Grasshopper.GUI.Canvas.GH_BorderTopology.Bottom
Edge border along the bottom area of the box.

Grasshopper.GUI.Canvas.GH_BorderTopology.Right
Edge border along the right area of the box.