Grasshopper.Kernel.Types.GH_TextDot
Represents an implementation of a Rhino text dot.

Grasshopper.Kernel.Types.GH_TextDot.#ctor
Default constructor, creates an invalid text dot.

Grasshopper.Kernel.Types.GH_TextDot.#ctor(Rhino.Geometry.TextDot)
Create a duplicate of an existing text dot.
textDot: text dot to duplicate

Grasshopper.Kernel.Types.GH_TextDot.#ctor(System.Guid)
Create a new referenced text dot that references a Rhino text dot with the specified ID.
ref_guid: ID of text dot object to reference.

Grasshopper.Kernel.Types.GH_TextDot.#ctor(Grasshopper.Kernel.Types.GH_TextDot)
Create a duplicate of another GH_TextDot. This constructor also copies reference data.
other: Text dot to duplicate

Grasshopper.Kernel.Types.GH_TextDot.DuplicateGeometry
Create a duplicate of this text dot.

Grasshopper.Kernel.Types.GH_TextDot.DuplicateTextDot
Create a duplicate of this text dot.

Grasshopper.Kernel.Types.GH_TextDot.IsValid
Gets the validity of this text dot. If the text dot is referenced but cannot be loaded, the text dot is not valid.

Grasshopper.Kernel.Types.GH_TextDot.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Kernel.Types.GH_TextDot.ToString
Format the text dot using default grasshopper formatting logic.

Grasshopper.Kernel.Types.GH_TextDot.ClearCaches
Clears all volatile caches for this instance. The boundingbox is cleared, and if the text dot is referenced,
the local instance of the text dot is erased.

Grasshopper.Kernel.Types.GH_TextDot.IsGeometryLoaded
Gets the load state of this text dot object. The text dot is considered to be loaded when the local text dot instance is not null.

Grasshopper.Kernel.Types.GH_TextDot.LoadGeometry(Rhino.RhinoDoc)
If the text dot is referenced and not yet loaded, attempts to load the text dot.
Returns: True if the text dot is loaded (or if it was already loaded), False on failure.

Grasshopper.Kernel.Types.GH_TextDot.CastFrom(System.Object)
Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_TextDot.CastTo``1(``0@)
Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.