Grasshopper.GUI.GH_MouseTracker
Record mouse-movements over time.

Grasshopper.GUI.GH_MouseTracker.#ctor
Create a new mouse tracker.

Grasshopper.GUI.GH_MouseTracker.#ctor(System.Drawing.Point)
Create a new mouse tracker.
initialPosition: First point in tracker.

Grasshopper.GUI.GH_MouseTracker.#ctor(System.Drawing.Point,System.Object)
Create a new mouse tracker.
initialPosition: First point in tracker.
tag: First tag in tracker.

Grasshopper.GUI.GH_MouseTracker.FrameCount
Gets the number of recorded frames.

Grasshopper.GUI.GH_MouseTracker.Frame(System.Int32)
Gets the position (in control coordinates) of the frame at the given index.

Grasshopper.GUI.GH_MouseTracker.OldestFrame
Gets the oldest frame in recorded history.

Grasshopper.GUI.GH_MouseTracker.NewestFrame
Gets the most recent frame in recorded history.

Grasshopper.GUI.GH_MouseTracker.Duration
Gets the timespan that has passed between the oldest and youngest recorded frames.
This is not the same as the time that has passed since recording began.

Grasshopper.GUI.GH_MouseTracker.MaximumDuration
Gets or sets the maximum allowed duration of the entire record. When new frames are recorded,
old frames that are more distant than MaximumDuration will be dropped. The default duration is
10 seconds.

Grasshopper.GUI.GH_MouseTracker.MaximumFrameCount
Gets or sets the maximum number of frames to keep in history.
If more frames are added, the oldest ones will be dropped.
The default is 16,384 frames.

Grasshopper.GUI.GH_MouseTracker.TemporalAccuracy
Gets or sets the maximum temporal accuracy. Frames that are closer together than
the accuracy will not be recorded. The default accuracy equals 5ms.

Grasshopper.GUI.GH_MouseTracker.Record(System.Drawing.Point)
Record a new mouse event frame. If this frame is closer than [Accuracy]ms to the previously recorded frame, it is not included.
position: Location of new frame.

Grasshopper.GUI.GH_MouseTracker.Record(System.Drawing.Point,System.Object)
Record a new mouse event frame. If this frame is closer than [Accuracy]ms to the previously recorded frame, it is not included.
position: Location of new frame.

Grasshopper.GUI.GH_MouseTracker.DropFrames(System.DateTime)
Drop all frames older than a given limit.
timeLimit: All frames older than the limit will be dropped.

Grasshopper.GUI.GH_MouseTracker.DropFrames(System.Double)
Find the youngest frame that deviates too much from the current locus and drop it and everything preceding it.
deviation: Local deviation.

Grasshopper.GUI.GH_MouseTracker.DropFrames(System.Double,System.Drawing.Point)
Find the youngest frame that deviates too much from the given locus and drop it and everything preceding it.
deviation: Local deviation.

Grasshopper.GUI.GH_MouseTracker.Deviation
Gets the maximum deviation of the recorded mouse path.
The maximum deviation is the furthest distance the mouse has been
from the first point in the history record.

Grasshopper.GUI.GH_MouseTracker.Deviation(System.DateTime,System.DateTime)
Gets the maximum deviation of the recorded mouse path.
The maximum deviation is the furthest distance the mouse has been
from the first point in the history span. It does not measure
the largest deviation between any two points in the time span, only
the first and any subsequent point.
t0: Represents the earliest time to include.
t1: Represents the latest time to include.

Grasshopper.GUI.GH_MouseTracker.LastFrameWithinDeviation(System.Double)
Starting from the youngest frame, finds the oldest frame that is still
within a maximum deviation of the youngest frame.
deviation: Maximum allowed deviation.
Returns: The index of the oldest frame with a distance less than the
deviation from the youngest frame, or -1 if no such frame could be found.