Grasshopper.GUI.MRU.GH_MRU_Server
Maintains a list of MRU (Most Recently Used) records.

Grasshopper.GUI.MRU.GH_MRU_Server.WriteList
Write the MRU data to the Grasshopper settings folder.

Grasshopper.GUI.MRU.GH_MRU_Server.ReadList
Read the MRU data from the grasshopper settings folder.

Grasshopper.GUI.MRU.GH_MRU_Server.Clear
Destroy all MRU records.

Grasshopper.GUI.MRU.GH_MRU_Server.ClearMissingRecords
Destroy all MRU records that no longer point to existing files.

Grasshopper.GUI.MRU.GH_MRU_Server.Records
Gets the MRU records stored in the server. Records are sorted from oldest to newest.
The number of records returned is never more than VisibleRecords

Grasshopper.GUI.MRU.GH_MRU_Server.RecordCount
Gets the number of records stored in this server. This is not necessarily the
same as the number of records returned via the Records property.

Grasshopper.GUI.MRU.GH_MRU_Server.AppendRecentFileRecord(System.DateTime,System.String)
Add a new MRU event to this server.
new_date: Date of event.
new_path: File path associated with event.

Grasshopper.GUI.MRU.GH_MRU_Server.VisibleRecords
Gets or sets the total number of visible Records in MRU interface.

Grasshopper.GUI.MRU.GH_MRU_Server.VisibleRecordCountChanged
Event raised whenever the number of visible records is changed.

Grasshopper.GUI.MRU.GH_MRU_Server.MRURecordCountChanged
Event raised whenever the record count of an MRU server changes.
server: Server that raised the event (there's typically only ever one of these loaded).
count: New record count.