Grasshopper.GUI.Canvas.GH_CanvasMode
Enumerates all pre-defined Canvas modes.

Grasshopper.GUI.Canvas.GH_CanvasMode.Control
Indicates the canvas is currently drawing into the winforms control.
This is the most common mode.

Grasshopper.GUI.Canvas.GH_CanvasMode.Thumbnail
Indicates the canvas is currently drawing itself to a thumbnail image.

Grasshopper.GUI.Canvas.GH_CanvasMode.Export
Indicates the canvas is currently drawing itself to an off-screen image.
This typically happens during Hi-Res export operations.