Grasshopper.GUI.GH_FolderPathBrowser
Utility control for developer friendly path browsers.

Grasshopper.GUI.GH_FolderPathBrowser.PathChanged
Raised whenever the path is changed by the user.
sender: Control raising the event.
nPath: The new path.

Grasshopper.GUI.GH_FolderPathBrowser.Path
Gets or sets the Path currently displayed in the control.

Grasshopper.GUI.GH_FolderPathBrowser.BrowseText
Gets or sets the text dispayed in the browser dialog.

Grasshopper.GUI.GH_FolderPathBrowser.Filter
Gets or sets the file extension filter in the browse dialog.

Grasshopper.GUI.GH_FolderPathBrowser.RequireExisting
Gets or sets the Existing flag. If True, only existing files and folders can be picked.

Grasshopper.GUI.GH_FolderPathBrowser.IsFolderBrowser
Gets whether or not the control is a Folder browser.
A GH_FolderPathBrowser is considered to be a folder browser when the Filter
field is null or empty.

Grasshopper.GUI.GH_FolderPathBrowser.IsFileBrowser
Gets whether or not the control is a File browser.
A GH_FolderPathBrowser is considered to be a file browser when the Filter
field is not null or empty.

Grasshopper.GUI.GH_FolderPathBrowser.IsValidPath(System.String)
Performs lexical analysis on a string to see if it violates
typical file path constraints.
pathString: Path to examine.
Returns: True if pathString represents a potentially valid path. False if otherwise.