Grasshopper.Kernel.Special.GH_MultiDimensionalSliderAttributes


Grasshopper.Kernel.Special.GH_MultiDimensionalSliderAttributes.TriangleGrip(System.Drawing.PointF,System.Drawing.PointF,System.Double,System.Single)
Create a triangular grip of a specific size perpendicular to a given edge.
pA: Start point of edge.
pB: End point of edge.
t: Normalised parameter along edge.
size: Size of grip.