Grasshopper.Kernel.Types.GH_Brep
Represents a 3D polysurface. GH_Brep wraps the functionality of the OpenNURBS OnBrep class.

Grasshopper.Kernel.Types.GH_Brep.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Kernel.Types.GH_Brep.BrepTightBoundingBox(Rhino.Geometry.Brep)
Compute the boundingbox of a Brep object without meshing.
in: Brep to measure.
Returns: The world aligned boundingbox of the object.