Grasshopper.Kernel.GH_DebugDescriptionWriter
Writer object used to create debug logs.

Grasshopper.Kernel.GH_DebugDescriptionWriter.Depth
Gets the depth of the current writer.
Depth is represented by whitespace in front of each line.

Grasshopper.Kernel.GH_DebugDescriptionWriter.CreateBlock(System.String)
Begin a new block. This will increase the depth by 1.
You must call CloseBlock() if you call this function.

Grasshopper.Kernel.GH_DebugDescriptionWriter.CloseBlock
Close the current block and decrease the depth by 1.

Grasshopper.Kernel.GH_DebugDescriptionWriter.WriteLine
Write a new blank line to the log.

Grasshopper.Kernel.GH_DebugDescriptionWriter.WriteLine(System.String)
Write a new line to the log.
line: Line to write.

Grasshopper.Kernel.GH_DebugDescriptionWriter.WriteLine(System.String,System.Object[])
Write a new formatted line to the log.
line: Line to write with formatting tags.
args: Data to format.

Grasshopper.Kernel.GH_DebugDescriptionWriter.CreateLog
Get a single string that represents the entire log so far.

Grasshopper.Kernel.GH_DebugDescriptionWriter.WriteLogToFile(System.String)
Write the log to a text file.
path: Path of file to write to.
Returns: True on success, false on failure.