Grasshopper.Kernel.Geometry.Delaunay.FaceEx
Represents a triangle bounded by 3 corners. FaceEx adds circumcircle caching and tests to Face

Grasshopper.Kernel.Geometry.Delaunay.FaceEx.center
Center of the circumcircle

Grasshopper.Kernel.Geometry.Delaunay.FaceEx.radius
Radius of the circumcircle

Grasshopper.Kernel.Geometry.Delaunay.FaceEx.radius_squared
Squared radius of the circumcircle