Grasshopper.GUI.GH_BezierSolver
Class for evaluating four-point bezier curves as used in GDI+

Grasshopper.GUI.GH_BezierSolver.PointAt(System.Drawing.PointF@,System.Drawing.PointF@,System.Drawing.PointF@,System.Drawing.PointF@,System.Single)
Evaluate a Bezier span.
P0: Start point of bezier.
P1: Point for start tangent.
P2: Point for end tangent.
P3: End point of bezier.
t: Unit parameter.

Grasshopper.GUI.GH_BezierSolver.TangentAt(System.Drawing.PointF@,System.Drawing.PointF@,System.Drawing.PointF@,System.Drawing.PointF@,System.Single)
Evaluate the tangent vector of a Bezier span.
P0: Start point of bezier.
P1: Point for start tangent.
P2: Point for end tangent.
P3: End point of bezier.
t: Unit parameter.

Grasshopper.GUI.GH_BezierSolver.AngleAt(System.Drawing.PointF@,System.Drawing.PointF@,System.Drawing.PointF@,System.Drawing.PointF@,System.Single)
Evaluate the tangent angle of a Bezier span.
P0: Start point of bezier.
P1: Point for start tangent.
P2: Point for end tangent.
P3: End point of bezier.
t: Unit parameter.