Grasshopper.GUI.GH_EtoUtil.CenterFormOnCursor(Eto.Forms.Window,System.Boolean)
Positions a Form so that it is centered around the cursor
F: The Form to adjust
limitToScreen: If True, the Form won't be allowed to extend beyond the limits of the screen containing the cursor.

Grasshopper.GUI.GH_EtoUtil.CenterFormOnEditor(Eto.Forms.Window,System.Boolean)
Positions a Form so that it is centered on the active editor. If the editor doesn't exist or is hidden,
the form will be centered on the screen instead.
F: The Form to adjust
limitToScreen: If True, the Form won't be allowed to extend beyond the limits of the screen containing the cursor.

Grasshopper.GUI.GH_EtoUtil.CenterFormOnWindow(Eto.Forms.Window,Eto.Forms.Window,System.Boolean)
Positions a Form so that it is centered on the supplied window. If the window doesn't exist or is hidden,
the form will be centered on the screen instead.
F: The Form to adjust
limitToScreen: If True, the Form won't be allowed to extend beyond the limits of the screen containing the cursor.

Grasshopper.GUI.GH_EtoUtil.CenterFormOnScreen(Eto.Forms.Window,System.Boolean)
Positions a Form so that it is centered on the current screen.
The current screen being defined as the screen containing the cursor.
F: The Form to adjust
limitToScreen: If True, the Form won't be allowed to extend beyond the limits of the active screen.