Grasshopper.Rhinoceros.Model.ModelEarthAnchorPoint
Represents a Rhino Earth anchor point. Wraps the functionality of the Rhino.DocObjects.EarthAnchorPoint type.

Grasshopper.Rhinoceros.Model.ModelEarthAnchorPoint.ModelCompass
Gets the corresponding compass plane in model coordinates
Remarks: X axis points East, Y axis points North and Z axis points Up

Grasshopper.Rhinoceros.Model.ModelEarthAnchorPoint.Latitude
Gets a point latitude on earth, in degrees. +90 = north pole, 0 = equator, -90 = south pole.
Remarks: In degrees.

Grasshopper.Rhinoceros.Model.ModelEarthAnchorPoint.Longitude
Gets a point longitude on earth, in degrees.
Remarks: In degrees.

Grasshopper.Rhinoceros.Model.ModelEarthAnchorPoint.Elevation
Gets a point elevation on earth, in meters.
Remarks: In meters.

Grasshopper.Rhinoceros.Model.ModelEarthAnchorPoint.ElevationCoordinateSystem
Gets the value indicating the zero level convention relating to a location on Earth

Grasshopper.Rhinoceros.Model.ModelEarthAnchorPoint.SphereUParameter
Gets the spherical U parameter.

Grasshopper.Rhinoceros.Model.ModelEarthAnchorPoint.SphereVParameter
Gets the spherical V parameter.