Grasshopper.GUI.GH_AnimationPhase
Enumerates the possible phases in which an animation can occur.

Grasshopper.GUI.GH_AnimationPhase.Before
Animation hasn't started yet.

Grasshopper.GUI.GH_AnimationPhase.During
Animation currently in progress.

Grasshopper.GUI.GH_AnimationPhase.After
Animation has finished.