Grasshopper.GUI.HTML.GH_CssStyle
Represents a single CSS style, consisting of a selector and a collection of properties.

Grasshopper.GUI.HTML.GH_CssStyle.#ctor
Create a new blank CSS style.

Grasshopper.GUI.HTML.GH_CssStyle.#ctor(System.String)
Create a new CSS style.
selector: Style selector

Grasshopper.GUI.HTML.GH_CssStyle.#ctor(System.String,Grasshopper.GUI.HTML.GH_CssProperty)
Create a new CSS style.
selector: Style selector.
property: Style property.

Grasshopper.GUI.HTML.GH_CssStyle.#ctor(System.String,System.Collections.Generic.IEnumerable{Grasshopper.GUI.HTML.GH_CssProperty})
Create a new CSS style.
selector: Style selector.
properties: Style properties.

Grasshopper.GUI.HTML.GH_CssStyle.Selector
Gets or sets the selector field for this property.

Grasshopper.GUI.HTML.GH_CssStyle.Properties
Gets all the properties in this CSS style.

Grasshopper.GUI.HTML.GH_CssStyle.Comments
Gets all the comments associated with this style.

Grasshopper.GUI.HTML.GH_CssStyle.IsPluralSelector
Gets a value indicating whether this style targets multiple selectors.

Grasshopper.GUI.HTML.GH_CssStyle.IsClassSelector
Gets a value indicating whether this style defines a CSS class.

Grasshopper.GUI.HTML.GH_CssStyle.IsIdSelector
Gets a value indicating whether this style defines a CSS id.

Grasshopper.GUI.HTML.GH_CssStyle.AddProperty(Grasshopper.GUI.HTML.GH_CssProperty)
Add a property to this style. If the new property conflicts with an existing property,
it will not be added.
property: Property to add.

Grasshopper.GUI.HTML.GH_CssStyle.AddComment(System.String)
Add a comment to this style.
comment: Comment to add.

Grasshopper.GUI.HTML.GH_CssStyle.FormatCss(System.Int32)
Format the style as CSS code.
indent: Indentation depth of style.
Returns: A CSS 2.0 compliant style block.

Grasshopper.GUI.HTML.GH_CssStyle.CompareTo(Grasshopper.GUI.HTML.GH_CssStyle)
Compare this CSS style to another one.
Comments are ignored in the comparison.
other: Style to compare to.