Grasshopper.Kernel.Data.GH_RuleKind
Represents all possible element types in a Path Pattern.

Grasshopper.Kernel.Data.GH_RuleKind.None
Represents an invalid, default value.

Grasshopper.Kernel.Data.GH_RuleKind.AnyNumber
Any single number

Grasshopper.Kernel.Data.GH_RuleKind.AnyNumbers
Any (or no) collection of numbers

Grasshopper.Kernel.Data.GH_RuleKind.Number
Single number

Grasshopper.Kernel.Data.GH_RuleKind.Group
A collection of non-related integers.

Grasshopper.Kernel.Data.GH_RuleKind.Range
A range of digits delimited by two extremes.

Grasshopper.Kernel.Data.GH_RuleKind.Sequence
A collection of increasing non-related integers which repeat either indefinitely or up to a limit

Grasshopper.Kernel.Data.GH_RuleKind.Complex
Represents a complex of multiple pattern types.