Grasshopper.GUI.Canvas.Interaction.GH_SplitInteraction.m_altDown
Alt key tracker. When m_altDown = True, KeyDown events for Alt can be ignored.

Grasshopper.GUI.Canvas.Interaction.GH_SplitInteraction.m_mode
Current splitting mode for the interaction.

Grasshopper.GUI.Canvas.Interaction.GH_SplitInteraction.m_p0
Canvas coordinate of mousedown for this interaction.

Grasshopper.GUI.Canvas.Interaction.GH_SplitInteraction.m_p1
Canvas coordinate of last mousemove for this interaction.