Grasshopper.GUI.GH_MenuTextBox
Utility control for putting textboxes into menus.

Grasshopper.GUI.GH_MenuTextBox.TextChanged
Raised whenever the text in the textbox changes.
sender: Control raising the event.
newText: New text.

Grasshopper.GUI.GH_MenuTextBox.KeyDown
Raised whenever a key is pressed.
sender: Control raising the event.
e: Key event arguments.

Grasshopper.GUI.GH_MenuTextBox.#ctor(System.Windows.Forms.ToolStripDropDown,System.String,System.Boolean)
Constructor for TextBox collection.
dropDown: The menu dropdown into which to embed this textbox control.
text: The original text to be displayed in the textbox.
lockFocus: If True, the control will disable the other menu items when it gets focus.

Grasshopper.GUI.GH_MenuTextBox.Width
Gets or sets the width of the control.

Grasshopper.GUI.GH_MenuTextBox.OriginalText
Gets or sets the original text that was visible when the control was first displayed.

Grasshopper.GUI.GH_MenuTextBox.Text
Gets or sets the current text.

Grasshopper.GUI.GH_MenuTextBox.TextBoxItem
Gets the text box control embedded in the menu.

Grasshopper.GUI.GH_MenuTextBox.CloseEntireMenuStructure
Call this function to close the ENTIRE menu structure.

Grasshopper.GUI.GH_MenuTextBox.CascadingDropDowns
Gets a list of dropdowns that represent the entire menu structure.