Grasshopper.Kernel.GH_StateTagList
Maintains a collection of IGH_StateTag objects.

Grasshopper.Kernel.GH_StateTagList.BoundingBox
Gets the boundingbox of all StateTags.

Grasshopper.Kernel.GH_StateTagList.Layout(System.Drawing.Rectangle,Grasshopper.Kernel.GH_StateTagLayoutDirection)
Layout the StateTags.
box: Content box to append to.

Grasshopper.Kernel.GH_StateTagList.RenderStateTags(System.Drawing.Graphics)
Render all StateTags in this list to the designated Graphics surface.
G: Graphics object to draw with.

Grasshopper.Kernel.GH_StateTagList.IsTtipPoint(System.Drawing.PointF)


Grasshopper.Kernel.GH_StateTagList.TooltipEnabled


Grasshopper.Kernel.GH_StateTagList.TooltipSetup(System.Drawing.PointF,Grasshopper.GUI.GH_TooltipDisplayEventArgs)
