Grasshopper.Kernel.Geometry.GH_CurveOffsetCorner
Enumerates all possible corner cases for curve offsets

Grasshopper.Kernel.Geometry.GH_CurveOffsetCorner.Chamfer
A straight line from one offset segment to the next.

Grasshopper.Kernel.Geometry.GH_CurveOffsetCorner.Sharp
A linear extension of two adjacent offset segments. If two segments are
(nearly) anti-parallel, Chamfer is used instead.

Grasshopper.Kernel.Geometry.GH_CurveOffsetCorner.Fillet
A circular arc is inserted between adjacent segments.