Grasshopper.Kernel.Undo.Actions.GH_GenericObjectAction
Records a single object change. Object changes are undone/redone by (de)serializing the objects.
Object changes also keep track of all wires feeding into and coming out of the object.