Grasshopper.Kernel.Types.GH_AnnotationBase
Represents an implementation of a Rhino annotation base class.

Grasshopper.Kernel.Types.GH_AnnotationBase.#ctor
Default constructor, creates an invalid annotation.

Grasshopper.Kernel.Types.GH_AnnotationBase.#ctor(Rhino.Geometry.AnnotationBase)
Create a duplicate of an existing annotation.
annotation: Annotation to duplicate

Grasshopper.Kernel.Types.GH_AnnotationBase.#ctor(Rhino.Geometry.AnnotationBase,Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle)
Create a duplicate of an existing annotation.
annotation: Annotation to duplicate
style: Annotation style to use

Grasshopper.Kernel.Types.GH_AnnotationBase.#ctor(System.Guid)
Create a new referenced annotation that references a Rhino dimension with the specified ID.
ref_guid: ID of dimension object to reference.

Grasshopper.Kernel.Types.GH_AnnotationBase.#ctor(Grasshopper.Kernel.Types.GH_AnnotationBase)
Create a duplicate of another GH_AnnotationBase. This constructor also copies reference data.
other: GH_AnnotationBase to duplicate

Grasshopper.Kernel.Types.GH_AnnotationBase.DuplicateGeometry
Create a duplicate of this annotation.

Grasshopper.Kernel.Types.GH_AnnotationBase.DuplicateAnnotation
Create a duplicate of this annotation.

Grasshopper.Kernel.Types.GH_AnnotationBase.IsValid
Gets the validity of this dimension. If the dimension is referenced but cannot be loaded, then the dimension is not valid.

Grasshopper.Kernel.Types.GH_AnnotationBase.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Kernel.Types.GH_AnnotationBase.ToString
Format the dimension using default grasshopper formatting logic.

Grasshopper.Kernel.Types.GH_AnnotationBase.ClearCaches
Clears all volatile caches for this instance. The boundingbox is cleared, and if the annotation is referenced,
the local instance of the annotation is erased.

Grasshopper.Kernel.Types.GH_AnnotationBase.IsGeometryLoaded
Gets the load state of this annotation object. The annotation is considered to be loaded when the local annotation instance is not null.

Grasshopper.Kernel.Types.GH_AnnotationBase.LoadGeometry(Rhino.RhinoDoc)
If the annotation is referenced and not yet loaded, attempts to load the leader.
Returns: True if the annotation is loaded (or if it was already loaded), False on failure.

Grasshopper.Kernel.Types.GH_AnnotationBase.CastTo``1(``0@)
Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.