Grasshopper.Kernel.Geometry.Node3Proximity
Maintains settings and results for node proximity searches.

Grasshopper.Kernel.Geometry.Node3Proximity.#ctor(Grasshopper.Kernel.Geometry.Node3,System.Int32)
Create a new instance for a single result.
search_start: Node to search from.
search_start_index: Index of base node (this index will be ignored during the search).

Grasshopper.Kernel.Geometry.Node3Proximity.#ctor(Grasshopper.Kernel.Geometry.Node3,System.Int32,System.Int32)
Create a new instance with a specific search result count
search_start: Node to search from.
search_start_index: Index of base node (this index will be ignored during the search).
max_results: Maximum number of results to return.

Grasshopper.Kernel.Geometry.Node3Proximity.#ctor(Grasshopper.Kernel.Geometry.Node3,System.Int32,System.Int32,System.Double,System.Double)
Create a new instance with a specific search result count
search_start: Node to search from.
search_start_index: Index of base node (this index will be ignored during the search).
max_results: Maximum number of results to return.
min_distance: Minimum allowed distance for search results.
max_distance: Maximum allowed distance for search results.

Grasshopper.Kernel.Geometry.Node3Proximity.ResetLists
This function resets all search results and clears all caches.
It is called once prior to a search operation.

Grasshopper.Kernel.Geometry.Node3Proximity.Start
Gets the node from which the search is performed

Grasshopper.Kernel.Geometry.Node3Proximity.StartIndex
Gets the index of the node from which the search is performed.
If the search start node is not part of the search set, this index will be negative.

Grasshopper.Kernel.Geometry.Node3Proximity.MaximumCount
Gets the maximum result count.

Grasshopper.Kernel.Geometry.Node3Proximity.CurrentCount
Gets the number of results currently stored.

Grasshopper.Kernel.Geometry.Node3Proximity.MinSearchRadius
Gets the minimum search radius

Grasshopper.Kernel.Geometry.Node3Proximity.MaxSearchRadius
Gets the maximum search radius

Grasshopper.Kernel.Geometry.Node3Proximity.MinSearchRadiusSquared
Gets the minimum search radius, squared

Grasshopper.Kernel.Geometry.Node3Proximity.MaxSearchRadiusSquared
Gets the maximum search radius, squared

Grasshopper.Kernel.Geometry.Node3Proximity.NearestPoint
Gets the index of the nearest point in the current solution.

Grasshopper.Kernel.Geometry.Node3Proximity.FurthestPoint
Gets the index of the furthest point in the current solution.

Grasshopper.Kernel.Geometry.Node3Proximity.NearestDistance
Gets the distance to the nearest point in the current solution.

Grasshopper.Kernel.Geometry.Node3Proximity.NearestDistanceSquared
Gets the squared distance to the nearest point in the current solution.

Grasshopper.Kernel.Geometry.Node3Proximity.FurthestDistance
Gets the distance to the furthest point in the current solution.

Grasshopper.Kernel.Geometry.Node3Proximity.FurthestDistanceSquared
Gets the squared distance to the furthest point in the current solution.

Grasshopper.Kernel.Geometry.Node3Proximity.IndexList
Gets a list representing the sorted indices in the current solution.

Grasshopper.Kernel.Geometry.Node3Proximity.DistanceList
Gets a list representing the sorted distances in the current solution.

Grasshopper.Kernel.Geometry.Node3Proximity.DistanceRange(System.Double@,System.Double@)
Gets the squared minimum and maximum distance
d0: Squared minimum distance in current solution.
d1: Squared maximum distance in current solution.

Grasshopper.Kernel.Geometry.Node3Proximity.RegisterNode(Grasshopper.Kernel.Geometry.Node3,System.Int32)
Register a new node with this collection.
node: Node to register
index: Index of node
Returns: True if node was accepted, false if the node is too far or too close.