Grasshopper.Kernel.GH_StateTagLayoutDirection
Enumerates the possible layout directions for parameter state tags.

Grasshopper.Kernel.GH_StateTagLayoutDirection.Left
Floating and Input parameters should be layed out towards the left.

Grasshopper.Kernel.GH_StateTagLayoutDirection.Right
Output parameters should be layed out towards the right.