Grasshopper.GUI.GH_GeometricFont
Exposes methods for drawing geometric characters.

Grasshopper.GUI.GH_GeometricFont.#ctor
This class cannot be constructed.

Grasshopper.GUI.GH_GeometricFont.Char0
Gets the default geometry for '0'.
Caller is responsible for disposing the path.

Grasshopper.GUI.GH_GeometricFont.Char1
Gets the default geometry for '1'.
Caller is responsible for disposing the path.

Grasshopper.GUI.GH_GeometricFont.Char2
Gets the default geometry for '2'.
Caller is responsible for disposing the path.

Grasshopper.GUI.GH_GeometricFont.Char3
Gets the default geometry for '3'.
Caller is responsible for disposing the path.

Grasshopper.GUI.GH_GeometricFont.Char4
Gets the default geometry for '4'.
Caller is responsible for disposing the path.

Grasshopper.GUI.GH_GeometricFont.Char5
Gets the default geometry for '5'.
Caller is responsible for disposing the path.

Grasshopper.GUI.GH_GeometricFont.Char6
Gets the default geometry for '6'.
Caller is responsible for disposing the path.

Grasshopper.GUI.GH_GeometricFont.Char7
Gets the default geometry for '7'.
Caller is responsible for disposing the path.

Grasshopper.GUI.GH_GeometricFont.Char8
Gets the default geometry for '8'.
Caller is responsible for disposing the path.

Grasshopper.GUI.GH_GeometricFont.Char9
Gets the default geometry for '9'.
Caller is responsible for disposing the path.

Grasshopper.GUI.GH_GeometricFont.CharDash
Gets the default geometry for '-'.
Caller is responsible for disposing the path.

Grasshopper.GUI.GH_GeometricFont.CharSemiColon
Gets the default geometry for ';'.
Caller is responsible for disposing the path.

Grasshopper.GUI.GH_GeometricFont.CharBracketOpen
Gets the default geometry for '{'.
Caller is responsible for disposing the path.

Grasshopper.GUI.GH_GeometricFont.CharBracketClose
Gets the default geometry for '}'.
Caller is responsible for disposing the path.

Grasshopper.GUI.GH_GeometricFont.Draw0(System.Drawing.Graphics,System.Drawing.Color,System.Drawing.PointF)
Draw the geometric character '0' at the specified location.
graphics: Graphics object to draw with.
colour: Colour of character.
position: Location of character.

Grasshopper.GUI.GH_GeometricFont.Draw1(System.Drawing.Graphics,System.Drawing.Color,System.Drawing.PointF)
Draw the geometric character '1' at the specified location.
graphics: Graphics object to draw with.
colour: Colour of character.
position: Location of character.

Grasshopper.GUI.GH_GeometricFont.Draw2(System.Drawing.Graphics,System.Drawing.Color,System.Drawing.PointF)
Draw the geometric character '2' at the specified location.
graphics: Graphics object to draw with.
colour: Colour of character.
position: Location of character.

Grasshopper.GUI.GH_GeometricFont.Draw3(System.Drawing.Graphics,System.Drawing.Color,System.Drawing.PointF)
Draw the geometric character '3' at the specified location.
graphics: Graphics object to draw with.
colour: Colour of character.
position: Location of character.

Grasshopper.GUI.GH_GeometricFont.Draw4(System.Drawing.Graphics,System.Drawing.Color,System.Drawing.PointF)
Draw the geometric character '4' at the specified location.
graphics: Graphics object to draw with.
colour: Colour of character.
position: Location of character.

Grasshopper.GUI.GH_GeometricFont.Draw5(System.Drawing.Graphics,System.Drawing.Color,System.Drawing.PointF)
Draw the geometric character '5' at the specified location.
graphics: Graphics object to draw with.
colour: Colour of character.
position: Location of character.

Grasshopper.GUI.GH_GeometricFont.Draw6(System.Drawing.Graphics,System.Drawing.Color,System.Drawing.PointF)
Draw the geometric character '6' at the specified location.
graphics: Graphics object to draw with.
colour: Colour of character.
position: Location of character.

Grasshopper.GUI.GH_GeometricFont.Draw7(System.Drawing.Graphics,System.Drawing.Color,System.Drawing.PointF)
Draw the geometric character '7' at the specified location.
graphics: Graphics object to draw with.
colour: Colour of character.
position: Location of character.

Grasshopper.GUI.GH_GeometricFont.Draw8(System.Drawing.Graphics,System.Drawing.Color,System.Drawing.PointF)
Draw the geometric character '8' at the specified location.
graphics: Graphics object to draw with.
colour: Colour of character.
position: Location of character.

Grasshopper.GUI.GH_GeometricFont.Draw9(System.Drawing.Graphics,System.Drawing.Color,System.Drawing.PointF)
Draw the geometric character '9' at the specified location.
graphics: Graphics object to draw with.
colour: Colour of character.
position: Location of character.

Grasshopper.GUI.GH_GeometricFont.DrawSemiColon(System.Drawing.Graphics,System.Drawing.Color,System.Drawing.PointF)
Draw the geometric character ';' at the specified location.
graphics: Graphics object to draw with.
colour: Colour of character.
position: Location of character.

Grasshopper.GUI.GH_GeometricFont.DrawDash(System.Drawing.Graphics,System.Drawing.Color,System.Drawing.PointF)
Draw the geometric character '-' at the specified location.
graphics: Graphics object to draw with.
colour: Colour of character.
position: Location of character.

Grasshopper.GUI.GH_GeometricFont.DrawBracketOpen(System.Drawing.Graphics,System.Drawing.Color,System.Drawing.PointF)
Draw the geometric character '{' at the specified location.
graphics: Graphics object to draw with.
colour: Colour of character.
position: Location of character.

Grasshopper.GUI.GH_GeometricFont.DrawBracketClose(System.Drawing.Graphics,System.Drawing.Color,System.Drawing.PointF)
Draw the geometric character '}' at the specified location.
graphics: Graphics object to draw with.
colour: Colour of character.
position: Location of character.

Grasshopper.GUI.GH_GeometricFont.DrawPath(System.Drawing.Graphics,Grasshopper.Kernel.Data.GH_Path,System.Drawing.Color,System.Drawing.PointF)
Draw an entire path string at a specific location.
graphics: Graphics object to draw with.
path: Path to draw.
colour: Colour of path.
position: Location of opening bracket.

Grasshopper.GUI.GH_GeometricFont.DrawNumber(System.Drawing.Graphics,System.Int32,System.Drawing.Color,System.Drawing.PointF)
Draw an integer at the specified location.
graphics: Graphics to draw with.
number: Number to draw.
colour: Colour to draw with.
position: Position for first character.

Grasshopper.GUI.GH_GeometricFont.DrawNumber(System.Drawing.Graphics,System.UInt32,System.Drawing.Color,System.Drawing.PointF)
Draw an integer at the specified location.
graphics: Graphics to draw with.
number: Number to draw.
colour: Colour to draw with.
position: Position for first character.

Grasshopper.GUI.GH_GeometricFont.DrawNumber(System.Drawing.Graphics,System.Int64,System.Drawing.Color,System.Drawing.PointF)
Draw an integer at the specified location.
graphics: Graphics to draw with.
number: Number to draw.
colour: Colour to draw with.
position: Position for first character.

Grasshopper.GUI.GH_GeometricFont.DrawNumber(System.Drawing.Graphics,System.UInt64,System.Drawing.Color,System.Drawing.PointF)
Draw an integer at the specified location.
graphics: Graphics to draw with.
number: Number to draw.
colour: Colour to draw with.
position: Position for first character.