Grasshopper.GUI.GH_ComponentGuidConflictDialog
Dialog used when multiple objects with similar GUIDs are encountered during plugin loading.

Grasshopper.GUI.GH_ComponentGuidConflictDialog.SetupDialog(Grasshopper.Kernel.IGH_ObjectProxy,Grasshopper.Kernel.IGH_ObjectProxy)
Call this method prior to displaying the form
cLoaded:
cConflicted:
Remarks:

Grasshopper.GUI.GH_ComponentGuidConflictDialog.LoadedProxy
Returns an instance to the cached Loaded proxy

Grasshopper.GUI.GH_ComponentGuidConflictDialog.ConflictingProxy
Returns an instance to the cached Conflicting proxy

Grasshopper.GUI.GH_ComponentGuidConflictDialog.Solution
Returns the conflict solution chosen by the user
Returns:
Remarks: