Grasshopper.GUI.Layout.GH_GenericLayout
Generic layout logic for rectangle stacks.

Grasshopper.GUI.Layout.GH_GenericLayout.#ctor
You cannot construct this class, it only exposes static (Shared in Visual Basic) methods.

Grasshopper.GUI.Layout.GH_GenericLayout.Vertical_ByIndex(System.Drawing.Rectangle,System.Collections.Generic.List{System.Drawing.Rectangle},System.Boolean)
Perform top-to-bottom layout on a list of rectangles starting at the upper edge of the layout area.
Rectangles are ordered by index. The height of the rectangles is guaranteed to remain the same.
area: Layout area. The bottom edge is ignored.
stack: The rectangles to lay out.
expand: If True, the rectangles will be expanded to fill the entire width of the layout area.

Grasshopper.GUI.Layout.GH_GenericLayout.Horizontal_ByIndex(System.Drawing.Rectangle,System.Collections.Generic.List{System.Drawing.Rectangle},System.Boolean)
Perform left-to-right layout on a list of rectangles starting at the left edge of the layout area.
Rectangles are ordered by index. The width of the rectangles is guaranteed to remain the same.
area: Layout area. The right edge is ignored.
stack: The rectangles to lay out.
expand: If True, the rectangles will be expanded to fill the entire height of the layout area.

Grasshopper.GUI.Layout.GH_GenericLayout.Vertical_ByPosition(System.Drawing.Rectangle,System.Collections.Generic.List{System.Drawing.Rectangle},System.Boolean)
Perform top-to-bottom layout on a list of rectangles at the upper edge of the layout area.
area: Layout area. The bottom edge is ignored.
stack: The rectangles to lay out.
expand: If True, the rectangles will be expanded to fill the entire width of the layout area.

Grasshopper.GUI.Layout.GH_GenericLayout.Vertical_ByPosition(System.Drawing.Rectangle,System.Collections.Generic.List{System.Drawing.Rectangle},System.Boolean,System.Int32)
Perform top-to-bottom layout on a list of rectangles at the upper edge of the layout area.
area: Layout area. The bottom edge is ignored.
stack: The rectangles to lay out.
radical: Radical index. The radical represents the special rectangle
which takes positioning preference. For example, during Drag operations, the rectangle
being dragged is the radical.
expand: If True, the rectangles will be expanded to fill the entire width of the layout area.

Grasshopper.GUI.Layout.GH_GenericLayout.Horizontal_ByPosition(System.Drawing.Rectangle,System.Collections.Generic.List{System.Drawing.Rectangle},System.Boolean)
Perform left-to-right layout on a list of rectangles at the left edge of the layout area.
area: Layout area. The right edge is ignored.
stack: The rectangles to lay out.
expand: If True, the rectangles will be expanded to fill the entire height of the layout area.

Grasshopper.GUI.Layout.GH_GenericLayout.Horizontal_ByPosition(System.Drawing.Rectangle,System.Collections.Generic.List{System.Drawing.Rectangle},System.Boolean,System.Int32)
Perform left-to-right layout on a list of rectangles at the left edge of the layout area.
area: Layout area. The right edge is ignored.
stack: The rectangles to lay out.
radical: Radical index. The radical represents the special rectangle
which takes positioning preference. For example, during Drag operations, the rectangle
being dragged is the radical.
expand: If True, the rectangles will be expanded to fill the entire height of the layout area.