Grasshopper.GUI.GH_DoubleBufferedPanel
Derives from Windows.Forms.Panel but overrides certain flags that improve
on-screen rendering. Use panel if you want to have a custom drawn control
that is under the control of the owner form.