Grasshopper.Kernel.GH_LoadingMechanism
Enumerates all assembly loading mechanisms.

Grasshopper.Kernel.GH_LoadingMechanism.Unknown
Assembly was loaded with an unknown mechanism.

Grasshopper.Kernel.GH_LoadingMechanism.COFF
Assembly was loaded from a memory byte-array representation of the file.

Grasshopper.Kernel.GH_LoadingMechanism.Direct
Assembly was loaded directly from disk.