Grasshopper.GUI.GH_TooltipComponent
This component provides Grasshopper tooltip functionality through a winforms Component.

Grasshopper.GUI.GH_TooltipComponent.Enabled
Gets or sets the Enabled flag.

Grasshopper.GUI.GH_TooltipComponent.Delay
Gets or sets the delay (in milliseconds) for this tooltip to appear.

Grasshopper.GUI.GH_TooltipComponent.Target
Gets or sets the control this tooltip is tied to.

Grasshopper.GUI.GH_TooltipComponent.Tag
Provides an easy way to store information on this Tooltip.

Grasshopper.GUI.GH_TooltipComponent.IsTag(System.Object)
Test whether the current Tooltip tag matches the object.
object: Object to test against tag.
Returns: True if the Tag and object are the same.

Grasshopper.GUI.GH_TooltipComponent.PopulateTooltip
This event is raised just prior to the tooltip display.
sender: GH_TooltipComponent that raised this event.
e: Event arguments, these must be sufficiently populated by the handler for the tooltip to work.