Grasshopper.Kernel.Geometry.Delaunay.Solver


Grasshopper.Kernel.Geometry.Delaunay.Solver.#ctor
This class cannot be constructed.

Grasshopper.Kernel.Geometry.Delaunay.Solver.CreateSuperBox(Grasshopper.Kernel.Geometry.Delaunay.FaceExList)
Add 4 nodes and 2 triangles to the solution.

Grasshopper.Kernel.Geometry.Delaunay.Solver.DestroySuperBox
Remove the super box indices from the nodelist and also
remove all triangles that touch the super box.

Grasshopper.Kernel.Geometry.Delaunay.Solver.SuperBoxIndex(System.Int32)
Get or set a superbox corner index
c: Box corner number (0, 1, 2, 3)
The index in m_nodes at which this corner is stored.

Grasshopper.Kernel.Geometry.Delaunay.Solver.SolveStaticOrientation
Make sure all triangles are oriented counter-clockwise

Grasshopper.Kernel.Geometry.Delaunay.Solver.RemapFaceIndices
Remap the face corner indices back onto the original node order.

Grasshopper.Kernel.Geometry.Delaunay.Solver.Solve_Faces(Grasshopper.Kernel.Geometry.Node2List,System.Double)
Core Delaunay solver.
nodes: Nodes to triangulate
jitter_amount: Amount of random noise. Make sure there is at least some noise
if your input nodes are structured.
Returns: A list of triangular faces that connect indices in the [nodes] parameter.

Grasshopper.Kernel.Geometry.Delaunay.Solver.Solve_Mesh(Grasshopper.Kernel.Geometry.Node2List,System.Double,System.Collections.Generic.List{Grasshopper.Kernel.Geometry.Delaunay.Face}@)
Delaunay mesher.
nodes: Nodes to triangulate
jitter_amount: Amount of random noise. Make sure there is at least some noise
if your input nodes are structured.
faces: Face list output
Returns: Mesh instance

Grasshopper.Kernel.Geometry.Delaunay.Solver.Solve_Connectivity(Grasshopper.Kernel.Geometry.Node2List,System.Double,System.Boolean)
Connectivity solver. Returns a topological edge diagram of delaunay faces.
nodes: Nodes to connect
jitter_amount: Amount of random motion.
include_convex_hull_edges: If true, the edges of the convex hull are included in the connectivity diagram.
Returns: Connectivity diagram for [nodes]