Grasshopper.Kernel.Geometry.SpatialTrees.Index3d`1
Represents an element index within a Tree3d instance.

Grasshopper.Kernel.Geometry.SpatialTrees.Index3d`1.LocalIndex
Gets the index within the node index list.

Grasshopper.Kernel.Geometry.SpatialTrees.Index3d`1.GlobalIndex
Gets the item index within the tree global list.

Grasshopper.Kernel.Geometry.SpatialTrees.Index3d`1.Node
Gets the node of the tree in which this element is stored.

Grasshopper.Kernel.Geometry.SpatialTrees.Index3d`1.Item
Gets the actual item.