Grasshopper.Kernel.Types.GH_String
Represents a literal string. GH_String re-implements the framework System.String type.

Grasshopper.Kernel.Types.GH_String.#ctor
Blank constructor

Grasshopper.Kernel.Types.GH_String.IsValid
Gets the validity of this instance. String are valid if they are not null.

Grasshopper.Kernel.Types.GH_String.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Kernel.Types.GH_String.QC_Type


Grasshopper.Kernel.Types.GH_String.QC_Hash


Grasshopper.Kernel.Types.GH_String.QC_Distance(Grasshopper.Kernel.Types.IGH_QuickCast)


Grasshopper.Kernel.Types.GH_String.QC_Bool


Grasshopper.Kernel.Types.GH_String.QC_Complex


Grasshopper.Kernel.Types.GH_String.QC_Matrix


Grasshopper.Kernel.Types.GH_String.QC_Int


Grasshopper.Kernel.Types.GH_String.QC_Num


Grasshopper.Kernel.Types.GH_String.QC_Text


Grasshopper.Kernel.Types.GH_String.QC_Pt


Grasshopper.Kernel.Types.GH_String.QC_Vec


Grasshopper.Kernel.Types.GH_String.QC_Col


Grasshopper.Kernel.Types.GH_String.QC_Interval


Grasshopper.Kernel.Types.GH_String.QC_CompareTo(Grasshopper.Kernel.Types.IGH_QuickCast)
