Grasshopper.GUI.Widgets.GH_MarkovWidget
Markov chain widget.

Grasshopper.GUI.Widgets.GH_MarkovWidget.IconArea
Gets the area of the entire markov strip (widget minus grip)
as limited by suggestion count and screen space.

Grasshopper.GUI.Widgets.GH_MarkovWidget.GripArea
Gets the area taken up by the grip.

Grasshopper.GUI.Widgets.GH_MarkovWidget.WidgetArea
Gets the area taken up by the entire widget.

Grasshopper.GUI.Widgets.GH_MarkovWidget.IconAreas
Gets the rectangles for all pods that can presently be displayed.

Grasshopper.GUI.Widgets.GH_MarkovWidget.CreateIconAreas(System.Int32)
Create N icon areas using the current docking style.
N: Number of icon boxes to create.
Returns: A list of icon boxes on success, null on failure.