Grasshopper.GUI.GH_GDI_Util
Contains some global function for filleting corners of GDI objects.

Grasshopper.GUI.GH_GDI_Util.#ctor
You cannot construct this class, you can only use the Shared methods

Grasshopper.GUI.GH_GDI_Util.FilletBoxOutline(System.Collections.Generic.IEnumerable{System.Drawing.Rectangle},System.Int32)
Fillet all the corners of the combined outline of a set of rectangles.
boxes: Rectangles to outline.
radius: Radius of corner fillets.
Returns: GraphicsPath describing the filleted outline or null on failure.

Grasshopper.GUI.GH_GDI_Util.BoxUnion(System.Collections.Generic.IEnumerable{System.Drawing.Rectangle})
Create the outline of a set of boxes.
rectangles: Boxes to union.
Returns: A list of Point arrays, where each array describes the corners of each silhouette.

Grasshopper.GUI.GH_GDI_Util.BoxUnion_MoveUp(System.Drawing.Point,System.Drawing.Rectangle[],System.Int32,System.Collections.Generic.List{System.Drawing.Point})
Recursive edge tracking function. This function moves up along the left sides of rectangles.
p0: Point to start from.
boxes: Array of all rectangles in the set.
box_idx: Index of current rectangle.
outline: List of outline vertices.
Returns: True on intermediate move, false on terminal move.

Grasshopper.GUI.GH_GDI_Util.BoxUnion_MoveRight(System.Drawing.Point,System.Drawing.Rectangle[],System.Int32,System.Collections.Generic.List{System.Drawing.Point})
Recursive edge tracking function. This function moves right along the top sides of rectangles.
p0: Point to start from.
boxes: Array of all rectangles in the set.
box_idx: Index of current rectangle.
outline: List of outline vertices.
Returns: True on intermediate move, false on terminal move.

Grasshopper.GUI.GH_GDI_Util.BoxUnion_MoveDown(System.Drawing.Point,System.Drawing.Rectangle[],System.Int32,System.Collections.Generic.List{System.Drawing.Point})
Recursive edge tracking function. This function moves down along the right sides of rectangles.
p0: Point to start from.
boxes: Array of all rectangles in the set.
box_idx: Index of current rectangle.
outline: List of outline vertices.
Returns: True on intermediate move, false on terminal move.

Grasshopper.GUI.GH_GDI_Util.BoxUnion_MoveLeft(System.Drawing.Point,System.Drawing.Rectangle[],System.Int32,System.Collections.Generic.List{System.Drawing.Point})
Recursive edge tracking function. This function moves left along the bottom sides of rectangles.
p0: Point to start from.
boxes: Array of all rectangles in the set.
box_idx: Index of current rectangle.
outline: List of outline vertices.
Returns: True on intermediate move, false on terminal move.

Grasshopper.GUI.GH_GDI_Util.SimplifyBoxes(System.Collections.Generic.IEnumerable{System.Drawing.Rectangle})
Create a simplified collection of Rectangles that describe the same union space as the supplied rectangles.
boxes: Rectangles to simplify.
Returns: An ordered collection of non-intersecting rectangles or null on failure.

Grasshopper.GUI.GH_GDI_Util.FilletPolyline(System.Drawing.Point[],System.Int32)
Fillet all the corners of a freeform outline.
corners: A list of corner points.
radius: Fillet to apply to all corners.
Returns: A graphics path describing the filleted shape, or Nothing on failure.

Grasshopper.GUI.GH_GDI_Util.FilletPolyline(System.Drawing.PointF[],System.Single)
Fillet all the corners of a freeform outline.
corners: A list of corner points.
radius: Fillet to apply to all corners.
Returns: A graphics path describing the filleted shape, or Nothing on failure.

Grasshopper.GUI.GH_GDI_Util.FilletRectangle(System.Drawing.Rectangle,System.Int32)
Create a rectangle with filleted corners.
box: Rectangle to fillet.
radius: Fillet radius, radius will be limited if too large.
Returns: GraphicsPath describing filletted rectangle.

Grasshopper.GUI.GH_GDI_Util.Freeform_Blob(System.Collections.Generic.IEnumerable{System.Drawing.RectangleF},System.Int32,System.Double)
Create a meta-ball outline for a set of rectangles.
content: Rectangles to encompass.
padding: Number of units to add to each box.
accuracy: Pixel accuracy for isosurface outlines. 3 is a good value for 1:1 UI.
Returns: A graphics path describing all iso-surfaces.

Grasshopper.GUI.GH_GDI_Util.Freeform_Blob(System.Collections.Generic.IEnumerable{System.Drawing.RectangleF},System.Int32,System.Double,GH_Util.MetaBall.GH_Context.FieldSolver,System.Double)
Create a meta-ball outline for a set of rectangles.
content: Rectangles to encompass.
padding: Number of units to add to each box.
accuracy: Pixel accuracy for isosurface outlines. 3 is a good value for 1:1 UI.
solver: The falloff solver to use. GH_Util.MetaBall.GH_Context contains a bunch of predefined solvers.
section: Elevation of section plane.
Returns: A graphics path describing all iso-surfaces