Grasshopper.Kernel.Special.GH_ValueListMode
Enumerates the possible GUIs for ValueList objects.

Grasshopper.Kernel.Special.GH_ValueListMode.DropDown
ValueList is displayed as a single value with a dropdown menu button.

Grasshopper.Kernel.Special.GH_ValueListMode.Sequence
ValueList is displayed as single value with Prev/Next buttons.

Grasshopper.Kernel.Special.GH_ValueListMode.Cycle
ValueList is displayed as single value with cyclical Prev/Next buttons.

Grasshopper.Kernel.Special.GH_ValueListMode.CheckList
ValueList is displayed as a vertical list of values with a checkbox for selected values.