Grasshopper.GUI.GH_CustomButton
The GH_CustomButton class maintains all information needed for
user-defined UI buttons.

Grasshopper.GUI.GH_CustomButton.Name
Gets or sets the name of the Custom Button.

Grasshopper.GUI.GH_CustomButton.Description
Gets or sets the description for this button.
The description is typically used in the tooltip.

Grasshopper.GUI.GH_CustomButton.Icon
Gets or sets the icon for this button.
The icon should be 24x24 pixels.

Grasshopper.GUI.GH_CustomButton.RunCode
Gets or sets the runcode for this button.
The runcode must be a compilable VB.NET
class that inherits from Grasshopper.GUI.GH_CustomButtonRunCode

Grasshopper.GUI.GH_CustomButton.RequireCode
Gets or sets the requirement filter code for this button.
The RequireCode must be a compilable VB.NET
class that inherits from Grasshopper.GUI.GH_CustomButtonRequireFilter

Grasshopper.GUI.GH_CustomButton.UseCustomRequirementCode
Gets or sets whether the custom requirement code should be used.

Grasshopper.GUI.GH_CustomButton.RequireDocument
Gets or sets whether the button requires a document to exist
before it will be enabled. This property is only used when the
UseCustomRequirementCode property is set to False.

Grasshopper.GUI.GH_CustomButton.RequireObjects
Gets or sets whether the button requires at least one object to exist
before it will be enabled. This property is only used when the
UseCustomRequirementCode property is set to False.

Grasshopper.GUI.GH_CustomButton.RequireSelection
Gets or sets whether the button requires at least one object to be selected
before it will be enabled. This property is only used when the
UseCustomRequirementCode property is set to False.

Grasshopper.GUI.GH_CustomButton.RunCodeInstance
Gets the cached RunCode instance. If there is no runcode instance
yet, it will be compiled.

Grasshopper.GUI.GH_CustomButton.RequireCodeInstance
Gets the cached RequireCode instance. If there is no instance
yet, it will be compiled.