Grasshopper.Kernel.GH_DocFilePathEventArgs
These arguments are passed along with FilePathChanged events on GH_Document.

Grasshopper.Kernel.GH_DocFilePathEventArgs.#ctor(Grasshopper.Kernel.GH_Document,System.String,System.String)
Create a new instance of the GH_DocFilePathEventArgs class.

Grasshopper.Kernel.GH_DocFilePathEventArgs.Document
Gets the document that raised this event.

Grasshopper.Kernel.GH_DocFilePathEventArgs.OldFilePath
Gets the old filepath, prior to the change that triggered this event.

Grasshopper.Kernel.GH_DocFilePathEventArgs.NewFilePath
Gets the new filepath, the one currently assigned to this document.