Grasshopper.Kernel.IGH_InstanceGuidDependent
Implement this interface in your IGH_DocumentObject class if you want to be informed when
the InstanceGuids of objects in the document are mutated.

Grasshopper.Kernel.IGH_InstanceGuidDependent.InstanceGuidsChanged(System.Collections.Generic.SortedDictionary{System.Guid,System.Guid})
This method will be called by the GH_Document that owns this object after
it mutates some or all of it's object InstanceIds.
map: A translation dictionary of old InstanceID keys (no longer existent) and new InstanceID values.