Grasshopper.Kernel.GH_ComponentParamServer
Wraps all members and functions needed for GH_Component to manage its input and output parameters.

Grasshopper.Kernel.GH_ComponentParamServer.Owner
Gets the owner component of this instance

Grasshopper.Kernel.GH_ComponentParamServer.ParameterNickNameChanged
Raised whenever a parameter nickname change is accepted.
sender: GH_ComponentParamServer instance that raised this event.
e: Event data.

Grasshopper.Kernel.GH_ComponentParamServer.ParameterSourcesChanged
Raised whenever the source list of an input parameter is changed.
sender: GH_ComponentParamServer instance that raised this event.
e: Event data.

Grasshopper.Kernel.GH_ComponentParamServer.ParameterChanged
Raised whenever there is a change to any parameter.
If you only care about NickName or Source changes, handle the
ParameterNickNameChanged
or
ParameterSourcesChanged
events instead.
sender: GH_ComponentParamServer instance that raised this event.
e: Event data.

Grasshopper.Kernel.GH_ComponentParamServer.Input
Gets or sets the input list of parameters.
Do not insert or remove parameters from this list,
use the dedicated functions instead.

Grasshopper.Kernel.GH_ComponentParamServer.Output
Gets or sets the output list of parameters.
Do not insert or remove parameters from this list,
use the dedicated functions instead.

Grasshopper.Kernel.GH_ComponentParamServer.InputWidth
Gets the width of the largest input parameter.

Grasshopper.Kernel.GH_ComponentParamServer.OutputWidth
Gets the width of the largest output parameter.

Grasshopper.Kernel.GH_ComponentParamServer.Clear
Removes all input and output parameters.

Grasshopper.Kernel.GH_ComponentParamServer.Clear(System.Boolean)
Removes all input and output parameters.
isolate: If true, parameters that are removed will be isolated from sources and recipients.

Grasshopper.Kernel.GH_ComponentParamServer.RepairParamAssociations
Makes sure all parameter attributes are a-ok.
If you stick to regular functions, you shouldn't have to call this.

Grasshopper.Kernel.GH_ComponentParamServer.RepairParamAttributes(System.Collections.Generic.List{Grasshopper.Kernel.IGH_Param})
Makes sure the parameter attributes in the list are a-ok.

Grasshopper.Kernel.GH_ComponentParamServer.RepairParamAttributes(Grasshopper.Kernel.IGH_Param)
Ensure a parameter has got GH_LinkedParamAttributes and is linked to the local Component.

Grasshopper.Kernel.GH_ComponentParamServer.UnregisterParameter(Grasshopper.Kernel.IGH_Param)
Removes the specified parameter from this component.
param: Parameter to remove

Grasshopper.Kernel.GH_ComponentParamServer.UnregisterParameter(Grasshopper.Kernel.IGH_Param,System.Boolean)
Removes the specified parameter from this component.
param: Parameter to remove
isolate: If true, parameters that are removed will be isolated from sources and recipients.

Grasshopper.Kernel.GH_ComponentParamServer.UnregisterInputParameter(Grasshopper.Kernel.IGH_Param)
Removes the specified parameter from this component.
param: Parameter to remove

Grasshopper.Kernel.GH_ComponentParamServer.UnregisterInputParameter(Grasshopper.Kernel.IGH_Param,System.Boolean)
Removes the specified parameter from this component.
param: Parameter to remove
isolate: If true, parameters that are removed will be isolated from sources and recipients.

Grasshopper.Kernel.GH_ComponentParamServer.UnregisterOutputParameter(Grasshopper.Kernel.IGH_Param)
Removes the specified parameter from this component.
param: Parameter to remove

Grasshopper.Kernel.GH_ComponentParamServer.UnregisterOutputParameter(Grasshopper.Kernel.IGH_Param,System.Boolean)
Removes the specified parameter from this component.
param: Parameter to remove
isolate: If true, parameters that are removed will be isolated from sources and recipients.

Grasshopper.Kernel.GH_ComponentParamServer.CreateDuplicate(Grasshopper.Kernel.IGH_Param)
Attempts to duplicate a parameter. Attributes will be ignored.
Warning! The duplicate will have the same ID as the original!
original: Parameter to duplicate.
Returns: A dupicate of the original or null on failure.

Grasshopper.Kernel.GH_ComponentParamServer.RegisterInputParam(Grasshopper.Kernel.IGH_Param)
Add a parameter to the end of the input list.

Grasshopper.Kernel.GH_ComponentParamServer.RegisterInputParam(Grasshopper.Kernel.IGH_Param,System.Int32)
Add a parameter at the specific index of the input list.

Grasshopper.Kernel.GH_ComponentParamServer.RegisterOutputParam(Grasshopper.Kernel.IGH_Param)
Add a parameter to the end of the output list.

Grasshopper.Kernel.GH_ComponentParamServer.RegisterOutputParam(Grasshopper.Kernel.IGH_Param,System.Int32)
Add a parameter at the specific index of the output list.

Grasshopper.Kernel.GH_ComponentParamServer.RepairProxyParams(Grasshopper.Kernel.GH_Document)
Attempt to fix all proxy params. Returns false if a single one fails.
document: Document that contains potential proxy targets.

Grasshopper.Kernel.GH_ComponentParamServer.EmitSyncObject
Create a synch object that stores a shallow representation of this server.
Cache this object if you're planning to make sweeping changes to this param-server.
Then, once you are finished call the Sync() function to perform cleanup of
removed parameters. This is a utility function and you can choose to perform
cleanup yourself.

Grasshopper.Kernel.GH_ComponentParamServer.Sync(System.Object)
Sync changes from a prerecorded state.
All param references in the sync object which are no longer
present in the current server will be properly deleted.
The sync object will be reset in the process, so you can only call this function
with a specific Sync object once.
sync_data: Sync object. Should be obtained by calling EmitSyncObject()

Grasshopper.Kernel.GH_ComponentParamServer.Sync(Grasshopper.Kernel.GH_ComponentParamServer.IGH_SyncObject)
Sync changes from a prerecorded state.
All param references in the sync object which are no longer
present in the current server will be properly deleted.
The sync object will be reset in the process, so you can only call this function
with a specific Sync object once.
sync_data: Sync object. Should be obtained by calling EmitSyncObject()

Grasshopper.Kernel.GH_ComponentParamServer.Sync(Grasshopper.Kernel.GH_ComponentParamServer.IGH_SyncObject,System.Int32@)
Sync changes from a prerecorded state.
All param references in the sync object which are no longer
present in the current server will be properly deleted.
The sync object will be reset in the process, so you can only call this function
with a specific Sync object once.
sync_data: Sync object. Should be obtained by calling EmitSyncObject()
cleanup_count: Number of parameters that were cleaned up.

Grasshopper.Kernel.GH_ComponentParamServer.AccessCount(Grasshopper.Kernel.GH_ParamAccess)
Returns the total number of input parameters that match the access mask.
access: Access flag mask.

Grasshopper.Kernel.GH_ComponentParamServer.OnlyTreeAndListParameters
Returns True if every input parameter is either a list or a tree parameter.

Grasshopper.Kernel.GH_ComponentParamServer.OnlyTreeParameters
Returns True if every input parameter is a tree parameter.

Grasshopper.Kernel.GH_ComponentParamServer.OnParametersChanged
Call this function when you change input/output parameter lists or types.
This function will wipe all caches that are potentially invalid.
PerformLayout on the component attributes will be called.

Grasshopper.Kernel.GH_ComponentParamServer.InventUniqueNickname(System.String,System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_Param})
Create a new, unique parameter name.
allowedChars: Allowed character set for naming logic.
existingNames: A collection of parameter names to avoid.
Returns: The first name combination that doesn't occur in the existingNames collection.

Grasshopper.Kernel.GH_ComponentParamServer.InventUniqueNickname(System.String,System.Collections.Generic.IEnumerable{System.String})
Create a new, unique parameter name.
allowedChars: Allowed character set for naming logic.
existingNames: A collection of parameter names to avoid.
Returns: The first name combination that doesn't occur in the existingNames collection.

Grasshopper.Kernel.GH_ComponentParamServer.IsParam(Grasshopper.Kernel.IGH_Param)
Returns True if this parameter is a child of the component
param: Parameter to test.

Grasshopper.Kernel.GH_ComponentParamServer.IsInputParam(Grasshopper.Kernel.IGH_Param)
Returns True if this parameter is an input child of the component
param: Parameter to test.

Grasshopper.Kernel.GH_ComponentParamServer.IsOutputParam(Grasshopper.Kernel.IGH_Param)
Returns True if this parameter is an output child of the component
param: Parameter to test.

Grasshopper.Kernel.GH_ComponentParamServer.IndexOfInputParam(System.String)
Finds the index of the input parameter that matches the specified search mask.
name: Name to search for.
Returns: The index of the parameter, or -1 if no parameter was found to match

Grasshopper.Kernel.GH_ComponentParamServer.IndexOfOutputParam(System.String)
Finds the index of the output parameter that matches the specified search mask.
name: Name to search for.
Returns: The index of the parameter, or -1 if no parameter was found to match

Grasshopper.Kernel.GH_ComponentParamServer.IndexOfInputParam(System.Guid)
Finds the index of the input parameter that matches the specified search mask.
id: ID to search for
Returns: The index of the parameter, or -1 if no parameter was found to match

Grasshopper.Kernel.GH_ComponentParamServer.IndexOfOutputParam(System.Guid)
Finds the index of the output parameter that matches the specified search mask.
id: ID to search for.
Returns: The index of the parameter, or -1 if no parameter was found to match

Grasshopper.Kernel.GH_ComponentParamServer.GetHashCode(Grasshopper.Kernel.GH_ParamHashFields)
Creates a SHA1 hash from the parameter data.
fields: Fields to include.
Returns: A Guid representing a SHA hash of the parameter fields.

Grasshopper.Kernel.GH_ComponentParamServer.WriteParamHashData(System.IO.BinaryWriter,Grasshopper.Kernel.IGH_Param,Grasshopper.Kernel.GH_ParamHashFields)
Write parameter data to a binary writer.
Remarks: This is useful for hashing purposes, there is no way to deserialize data written with this method.
writer: Writer to write with.
param: Parameter to serialize.
fields: Fields of parameter to serialize.

Grasshopper.Kernel.GH_ComponentParamServer.Find(System.Guid)
Find the parameter that has the given InstanceGuid.
id: InstanceID to search for.
Returns: The parameter with the matching ID or null on failure.

Grasshopper.Kernel.GH_ComponentParamServer.SortInput(System.Double[])
Sort the input parameter order based on a numeric key array.
keys: Array of double precision numbers to function as sorting keys.

Grasshopper.Kernel.GH_ComponentParamServer.SortInput(System.Single[])
Sort the input parameter order based on a numeric key array.
keys: Array of single precision numbers to function as sorting keys.

Grasshopper.Kernel.GH_ComponentParamServer.SortInput(System.Int32[])
Sort the input parameter order based on a numeric key array.
keys: Array of integer precision numbers to function as sorting keys.

Grasshopper.Kernel.GH_ComponentParamServer.SortOutput(System.Double[])
Sort the input parameter order based on a numeric key array.
keys: Array of double precision numbers to function as sorting keys.

Grasshopper.Kernel.GH_ComponentParamServer.SortOutput(System.Single[])
Sort the output parameter order based on a numeric key array.
keys: Array of single precision numbers to function as sorting keys.

Grasshopper.Kernel.GH_ComponentParamServer.SortOutput(System.Int32[])
Sort the output parameter order based on a numeric key array.
keys: Array of integer precision numbers to function as sorting keys.

Grasshopper.Kernel.GH_ComponentParamServer.Write(GH_IO.Serialization.GH_IWriter)
Write all parameter data to an IO archive.
writer: Object to write with.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_ComponentParamServer.Read(GH_IO.Serialization.GH_IReader)
Read all parameter data from an IO archive.
reader: Object to read with.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_ComponentParamServer.WriteAllParameterData(GH_IO.Serialization.GH_IWriter)
Serialize all possible parameter data.
This is a sledge-hammer approach, do not use unless you're desperate.
writer: Writer object to serialize to.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_ComponentParamServer.ReadAllParameterData(GH_IO.Serialization.GH_IReader)
Deserialize all possible parameter data.
You can only use this method if the archive was made using the WriteAllParameterData() method.
reader: Reader object to deserialize from.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_ComponentParamServer.GetEnumerator
Gets a customized enumerator which iterates over all (both input and output) parameters.

Grasshopper.Kernel.GH_ComponentParamServer.GetEnumerator1
Gets a customized enumerator which iterates over all (both input and output) parameters.