Grasshopper.GUI.HTML.GH_HtmlTable


Grasshopper.GUI.HTML.GH_HtmlTable.Row(System.Int32)
Gets or sets a single HTML row object. Usually you do not need to
set rows yourself. Consider using the Content() property instead.
index: Index of row.

Grasshopper.GUI.HTML.GH_HtmlTable.Content(System.Int32,System.Int32)
Gets or sets the content for a specific cell.
The content may contain html tags.
row: Row index.
column: Column index.

Grasshopper.GUI.HTML.GH_HtmlTable.ColumnWidth(System.Int32)
Gets or sets the column width. The width is specified as a percentage.
index: Index of column.

Grasshopper.GUI.HTML.GH_HtmlTable.Width
Gets or sets the width (in page width percentages) of the entire table.