Grasshopper.GUI.Canvas.GH_FilePanel
A panel on the canvas that allows for recent files to be loaded.

Grasshopper.GUI.Canvas.GH_FilePanel.TrimString(System.String)
Trim a string such that it fits in a regular panel.
text: String to trim.
Returns: Modified string.

Grasshopper.GUI.Canvas.GH_FilePanel.SetNewLocation(System.Drawing.Point,System.Int32,System.Int32)
Set a new location with animated properties.
point: New location.
start: Delay (in milliseconds) to start of animation.
duration: Duration (in milliseconds) of entire animation.