Grasshopper.Kernel.Sorting.GH_NetworkSorter


Grasshopper.Kernel.Sorting.GH_NetworkSorter.CreateNodeList(System.Collections.Generic.List{Grasshopper.Kernel.IGH_DocumentObject})
Call this function to construct the network frame used for sorting
objs: Objects to be sorted

Grasshopper.Kernel.Sorting.GH_NetworkSorter.CreateContext(System.Collections.Generic.List{Grasshopper.Kernel.IGH_DocumentObject})
Call this function construct the context (environment).
objs: Objects that affect the network sorting, this should include at least all objects in the node list.

Grasshopper.Kernel.Sorting.GH_NetworkSorter.Sort(System.Single,System.Single)
Perform a single sorting step