Grasshopper.Kernel.GH_PluginFolderType
Enumerates the possible folder types for GH_AssemblyFolderInfo

Grasshopper.Kernel.GH_PluginFolderType.Core
The Core folder is the one where native Grasshopper GHA files are installed.

Grasshopper.Kernel.GH_PluginFolderType.Default
The Default folder is where Grasshopper puts 3rd party GHA files.

Grasshopper.Kernel.GH_PluginFolderType.RhiFolder
A RhiFolder folder is created by an RHI installer package.

Grasshopper.Kernel.GH_PluginFolderType.UserFolder
A UserFolder is created by the user via the _GrasshopperDeveloperSettings command.