Grasshopper.GUI.HTML.GH_CssProperty
Represents a single Property/Values pair in a CSS style.

Grasshopper.GUI.HTML.GH_CssProperty.#ctor(System.String)
Create a new CSS property.
property: Property name.

Grasshopper.GUI.HTML.GH_CssProperty.#ctor(System.String,System.String)
Create a new CSS property.
property: Property name.
value: Property value.

Grasshopper.GUI.HTML.GH_CssProperty.#ctor(System.String,System.Collections.Generic.IEnumerable{System.String})
Create a new CSS property.
property: Property name.
values: Property values.

Grasshopper.GUI.HTML.GH_CssProperty.Name
Gets the property name.

Grasshopper.GUI.HTML.GH_CssProperty.ValueCount
Gets the number of values stored in this property.

Grasshopper.GUI.HTML.GH_CssProperty.Value(System.Int32)
Gets a specific value.
index: Index of value.
Returns: The Css property value at the given index.

Grasshopper.GUI.HTML.GH_CssProperty.Values
Gets the local values as a readonly collection.

Grasshopper.GUI.HTML.GH_CssProperty.AddValue(System.String)
Append a value to this property.
value: Value to append.

Grasshopper.GUI.HTML.GH_CssProperty.AddValues(System.Collections.Generic.IEnumerable{System.String})
Append a collection of values to this property.
values: Values to append.

Grasshopper.GUI.HTML.GH_CssProperty.FormatCss(System.Int32)
Format the property as CSS code.
indent: Indentation depth of property.
Returns: A CSS 2.0 compliant property string.

Grasshopper.GUI.HTML.GH_CssProperty.CompareTo(Grasshopper.GUI.HTML.GH_CssProperty)
Compare this CSS property to another one.
other: Property to compare with.
Returns: Comparison flag.