Grasshopper.Kernel.GH_SolutionPhase
The Phase flags are used to track object states during solutions.

Grasshopper.Kernel.GH_SolutionPhase.Blank
There is no data available in this object.
This object will be solved next time a solution begins.

Grasshopper.Kernel.GH_SolutionPhase.Collecting
This object is currently in the process of collecting data

Grasshopper.Kernel.GH_SolutionPhase.Collected
This object has finished collecting all data and is ready for computation.

Grasshopper.Kernel.GH_SolutionPhase.Computing
This object is currently in the process of computing new data

Grasshopper.Kernel.GH_SolutionPhase.Computed
This object has successfully completed data computation and it will
be skipped in the next solution unless it expires in the meantime.
This is the final step in a successful solution cycle.

Grasshopper.Kernel.GH_SolutionPhase.Failed
This object has failed to successfully complete the data computation stage.
A new attempt at solving it will be made when the next solution starts.
This is the final step in an unsuccessful solution cycle.