Grasshopper.Kernel.GH_MatchLevel
All possible string matching schemes.

Grasshopper.Kernel.GH_MatchLevel.None
No match is performed.

Grasshopper.Kernel.GH_MatchLevel.Exact
String must match the key exactly.

Grasshopper.Kernel.GH_MatchLevel.Start
String must start with the key.

Grasshopper.Kernel.GH_MatchLevel.WordExact
String must contain word that is an exact match with the key.

Grasshopper.Kernel.GH_MatchLevel.WordStart
String must contain a word that starts with the key.

Grasshopper.Kernel.GH_MatchLevel.Contains
String must contain the key.

Grasshopper.Kernel.GH_MatchLevel.Fuzzy
String must contain word that is somewhat similar to the key.

Grasshopper.Kernel.GH_MatchLevel.AllClean
Represents all match types except fuzzy matching.

Grasshopper.Kernel.GH_MatchLevel.All
Represents all match types.