Grasshopper.Kernel.Types.GH_PointCloud
Represents a point cloud.

Grasshopper.Kernel.Types.GH_PointCloud.#ctor
Default constructor, creates an invalid curve.

Grasshopper.Kernel.Types.GH_PointCloud.#ctor(Rhino.Geometry.PointCloud)
Create a duplicate of an existing point-cloud.
pointCloud: point-cloud to duplicate

Grasshopper.Kernel.Types.GH_PointCloud.#ctor(System.Guid)
Create a new referenced curve that references a Rhino curve object with the specified ID.
ref_guid: ID of point-cloud object to reference.

Grasshopper.Kernel.Types.GH_PointCloud.#ctor(Grasshopper.Kernel.Types.GH_PointCloud)
Create a duplicate of another GH_PointCloud. This constructor also copies reference data.
other: Curve to duplicate

Grasshopper.Kernel.Types.GH_PointCloud.DuplicateGeometry
Create a duplicate of this curve.

Grasshopper.Kernel.Types.GH_PointCloud.DuplicatePointCloud
Create a duplicate of this curve.

Grasshopper.Kernel.Types.GH_PointCloud.IsValid
Gets the validity of this curve. If the curve is referenced but cannot be loaded, the curve is not valid.

Grasshopper.Kernel.Types.GH_PointCloud.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Kernel.Types.GH_PointCloud.ToString
Format the curve using default grasshopper formatting logic.

Grasshopper.Kernel.Types.GH_PointCloud.ClearCaches
Clears all volatile caches for this instance. The boundingbox is cleared, and if the curve is referenced,
the local instance of the curve is erased.

Grasshopper.Kernel.Types.GH_PointCloud.IsGeometryLoaded
Gets the load state of this curve object. The curve is considered to be loaded when the local OnCurve instance is not null.

Grasshopper.Kernel.Types.GH_PointCloud.LoadGeometry(Rhino.RhinoDoc)
If the curve is referenced and not yet loaded, attempts to load the curve.
Returns: True if the curve is loaded (or if it was already loaded), False on failure.

Grasshopper.Kernel.Types.GH_PointCloud.CastFrom(System.Object)
Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_PointCloud.CastTo``1(``0@)
Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.