Grasshopper.Kernel.Types.GH_GooProxy`1
Abstract base implementation of IGH_GooProxy

Grasshopper.Kernel.Types.GH_GooProxy`1.Construct
Override this method to supply a custom UI during proxy construction.

Grasshopper.Kernel.Types.GH_GooProxy`1.ProxyOwner
Gets the piece of Grasshopper data that spawned this proxy.

Grasshopper.Kernel.Types.GH_GooProxy`1.IsParsable
Gets a value indicating whether or not the type can be instantiated from a String.

Grasshopper.Kernel.Types.GH_GooProxy`1.FormatInstance
Returns a String description of the current value.
Remarks: If the implementation IsParsable(), then this representation must be in parsable format.

Grasshopper.Kernel.Types.GH_GooProxy`1.MutateString(System.String)
Munge a string to remove obvious errors on account of the user.

Grasshopper.Kernel.Types.GH_GooProxy`1.FromString(System.String)
If IsParsable(), then attempts to convert the string to a generic type value
in: The String to parse.
Returns: True on success, false on failure. This method should not throw exceptions.

Grasshopper.Kernel.Types.GH_GooProxy`1.UserString
Gets or sets the user-defined string that describes this proxy.
This only really makes sense if the Proxy is Parsable.
Returns: The UserString value or the value of FormatInstance() if UserString has not been assigned.

Grasshopper.Kernel.Types.GH_GooProxy`1.Valid
Gets a value indicating whether this proxy represents valid data.