Grasshopper.GUI.Ribbon.GH_RibbonPainter


Grasshopper.GUI.Ribbon.GH_RibbonPainter.TabPaneBrush(System.Drawing.Rectangle,System.Drawing.Color)
Generates the default brush for TAB content fills
rec: The entire clientrectangle of the tabpane
bg: The background colour of the control

Grasshopper.GUI.Ribbon.GH_RibbonPainter.TabEdgeBrush(System.Drawing.Rectangle)
Generates the default brush for TAB edge curves.
rec: The entire clientrectangle of the tabpane

Grasshopper.GUI.Ribbon.GH_RibbonPainter.RoundedRectanglePath(System.Drawing.Rectangle,System.Int32)
Computes a graphicspath that delineates a rounded rectangle
rec: The base rectangle
cRadius: The radius of the rounded corners
Remarks: Radius should not be less than 1

Grasshopper.GUI.Ribbon.GH_RibbonPainter.PanelOuterBorder(System.Drawing.Rectangle)
Computes a graphicspath that delineates the outer edge of a typical panel
rec: The panel rectangle

Grasshopper.GUI.Ribbon.GH_RibbonPainter.PanelInnerBorder(System.Drawing.Rectangle)
Computes a graphicspath that delineates the inner edge of a typical panel
rec: The panel rectangle

Grasshopper.GUI.Ribbon.GH_RibbonPainter.PanelBottomBar(System.Drawing.Rectangle)
Computes a graphicspath that delineates the bar along the bottom of a panel.
rec: The panel rectangle.

Grasshopper.GUI.Ribbon.GH_RibbonPainter.DropDownBar(System.Drawing.Rectangle)
Computes a graphicspath that delineates the bar along the top of a dropdown form
rec: The panel rectangle.

Grasshopper.GUI.Ribbon.GH_RibbonPainter.PanelBarHeight
The default height of a panel bar

Grasshopper.GUI.Ribbon.GH_RibbonPainter.PanelCornerRadius
Radius of panel corners
Remarks:

Grasshopper.GUI.Ribbon.GH_RibbonPainter.TabGripHeight
Height of a tab grip region
Remarks:

Grasshopper.GUI.Ribbon.GH_RibbonPainter.TabOuterBorder(System.Drawing.Rectangle,System.Drawing.Rectangle)
Computes a graphicspath that delineates the outer edge of a typical tabpane
GripRec: The grip region (tab)
ContentRec: The content region (pane)