Grasshopper.GUI.GH_Animator`1
Provides methods for animating values.
Data type to animate.

Grasshopper.GUI.GH_Animator`1.#ctor(`0,`0,System.TimeSpan,Grasshopper.GUI.GH_Animator{`0}.Interpolate)
Create a new instance of the generic animator.
A: Start value of animation.
B: End value of animation.
duration: Duration of animation.
interpolator: Interpolation delegate

Grasshopper.GUI.GH_Animator`1.#ctor(`0,`0,System.DateTime,System.DateTime,Grasshopper.GUI.GH_Animator{`0}.Interpolate)
Create a new instance of the generic animator.
A: Start value of animation.
B: End value of animation.
startTime: Start of animation, should be expressed in UTC time.
endTime: End of animation, should be expressed in UTC time.
interpolator: Interpolation delegate.

Grasshopper.GUI.GH_Animator`1.ValueA
Gets or sets the start value of the animation.
This value is set from within the constructor though you can change it at any time.

Grasshopper.GUI.GH_Animator`1.ValueB
Gets or sets the end value of the animation.
This value is set from within the constructor though you can change it at any time.

Grasshopper.GUI.GH_Animator`1.Interpolation
Gets or sets the interpolation mode. Changing the mode during an animation will result in discontinuous motion.

Grasshopper.GUI.GH_Animator`1.AdjustAnimation(`0)
Adjust the animation.
newTarget: New B value.

Grasshopper.GUI.GH_Animator`1.AdjustAnimation(`0,System.Int32)
Adjust the animation.
newTarget: New B value.
duration: Duration of adjusted animation in milliseconds.

Grasshopper.GUI.GH_Animator`1.AdjustAnimation(`0,System.DateTime,System.DateTime)
Adjust the animation.
newTarget: New B value.

Grasshopper.GUI.GH_Animator`1.Phase
Gets the current animation phase.

Grasshopper.GUI.GH_Animator`1.CurrentValue
Gets the current animated value.