Grasshopper.Kernel.GH_ObjectType
Enumerates all types of object that can be referenced by a GH_ObjectProxy instance.

Grasshopper.Kernel.GH_ObjectType.None
Object type is unset.

Grasshopper.Kernel.GH_ObjectType.CompiledObject
Represents a compiled object inside a GHA assembly.

Grasshopper.Kernel.GH_ObjectType.UserObject
Represents a user defined object in a remote file.