Grasshopper.Kernel.Data.GH_LexerCombo
Contains both a source and a target lexer object.

Grasshopper.Kernel.Data.GH_LexerCombo.Source
Gets or sets the lexer object that represents the source of a lexical operation.

Grasshopper.Kernel.Data.GH_LexerCombo.Target
Gets or sets the lexer object that represents the target of a lexical operation.