Grasshopper.Kernel.GH_AssemblyInfo
Implement this interface once (and once only) in a GHA project if you wish to
add additional information about your library to Grasshopper. Note you must supply
an empty constructor.

Grasshopper.Kernel.GH_AssemblyInfo.Icon
Gets a 24x24 icon that represents this assembly.
Return null if you do not wish to associate an icon with this assembly.

Grasshopper.Kernel.GH_AssemblyInfo.Name
Gets the human readable name of this assembly.
Return null if you do not wish to associate a name with this assembly.

Grasshopper.Kernel.GH_AssemblyInfo.Version
Gets the version code for this assembly.

Grasshopper.Kernel.GH_AssemblyInfo.Description
Gets the human readable description of this assembly.
Return null if you do not wish to associate a description with this assembly.

Grasshopper.Kernel.GH_AssemblyInfo.License
Gets the license type for this assembly.

Grasshopper.Kernel.GH_AssemblyInfo.LicenseToString(Grasshopper.Kernel.GH_LibraryLicense)
Convert a GH_LibraryLicense enumeration into a string.
license: Flag to convert.
Returns: Human readable string representation of lic.

Grasshopper.Kernel.GH_AssemblyInfo.AuthorName
Gets the name of the individual/company/organisation that is responsible for this assembly.
Return null if you do not wish to associate an author with this assembly.

Grasshopper.Kernel.GH_AssemblyInfo.AuthorContact
Gets the contact information for the author. This can be email, phone, fax, address or all of the above.
Return null if you do not wish to associate contact details with this assembly.

Grasshopper.Kernel.GH_AssemblyInfo.Id
Gets the Id of this assembly. By default the Id is a hash of the name.

Grasshopper.Kernel.GH_AssemblyInfo.Assembly
Gets the actual assembly that this info object describes.

Grasshopper.Kernel.GH_AssemblyInfo.Location
Gets the location this assembly was loaded from.

Grasshopper.Kernel.GH_AssemblyInfo.LoadingMechanism
Gets the mechanism used to load this assembly.

Grasshopper.Kernel.GH_AssemblyInfo.IsCoreLibrary
Gets whether this library is a Grasshopper core library.
Core libraries are installed along with Grasshopper and thus
should always be available anywhere.