Grasshopper.Kernel.GH_DocumentRank
Enumerates all possible document rankings.

Grasshopper.Kernel.GH_DocumentRank.Unset
Indicates no rank. Documents with unset rank are invalid.

Grasshopper.Kernel.GH_DocumentRank.TopLevel
Top level ranking.

Grasshopper.Kernel.GH_DocumentRank.Subsidiary
Subsidiary ranking indicates this document is part of another document.