Grasshopper.Kernel.GH_DocumentAssociations.Associate(System.String,System.String)
Add an association between a Rhino and a Grasshopper file.
If a similar association already exists, it will be overwritten.
This function reads and writes to the disk, it is SLOW. Only call
it when you KNOW something changed.
rhinoFile: Path to Rhino 3dm file.
grasshopperFile: Path to Grasshopper ghx or gh file.

Grasshopper.Kernel.GH_DocumentAssociations.GetRhinoAssociations(System.String)
Find all the Rhino 3dm files that have been associated with a given Grasshopper file.
grasshopperFile: Grasshopper file path.
Returns: A list of files, ordered chronologically (most recent association first)

Grasshopper.Kernel.GH_DocumentAssociations.GetGrasshopperAssociations(System.String)
Find all the Grasshopper ghx files that have been associated with a given Rhino file.
rhinoFile: Rhino file path.
Returns: A list of files, ordered chronologically (most recent association first)

Grasshopper.Kernel.GH_DocumentAssociations.AssociationDataPath
Gets the path to the file where Grasshopper Document Associations are stored.