Grasshopper.GUI.GH_MaterialPreview
Class for generating Preview Material thumbnails.

Grasshopper.GUI.GH_MaterialPreview.Colour
Gets or sets the colour of the material preview.

Grasshopper.GUI.GH_MaterialPreview.Selected
Gets or sets the Selected state of this preview.

Grasshopper.GUI.GH_MaterialPreview.Image
Gets the default bitmap preview for the current material.
The default size is 100x100 pixels. If you want a smaller size
then use the Thumbnail() function instead.

Grasshopper.GUI.GH_MaterialPreview.Thumbnail(System.Int32)
Gets a thumbnail of the preview, without any selection widgets drawn in.
size: Size of thumbnail. Should be between 16 and 50 for best results. _
thumbnails cannot be made bigger than 100 or smaller than 16.