Grasshopper.Kernel.GH_FileWatcher
Provides easy mechanisms to monitor changes to the local File System.

Grasshopper.Kernel.GH_FileWatcher.#ctor
You cannot construct this class yourself, please use one of the static CreateFileWatcher overloads.

Grasshopper.Kernel.GH_FileWatcher.CreateFileWatcher(System.String,Grasshopper.Kernel.GH_FileWatcherEvents,Grasshopper.Kernel.GH_FileWatcher.FileChangedSimple)
Create a new FileSystem Watcher object aimed at a specific file.
filePath: File to watch.
events: Events to watch for.
delegate: Callback delegate.
Returns: A new filewatcher aimed at the specified file.

Grasshopper.Kernel.GH_FileWatcher.CreateFileWatcher(System.String,Grasshopper.Kernel.GH_FileWatcherEvents,Grasshopper.Kernel.GH_FileWatcher.FileChanged)
Create a new FileSystem Watcher object aimed at a specific file.
filePath: File to watch.
events: Events to watch for.
delegate: Callback delegate.
Returns: A new filewatcher aimed at the specified file.

Grasshopper.Kernel.GH_FileWatcher.CreateDirectoryWatcher(System.String,System.String,Grasshopper.Kernel.GH_FileWatcherEvents,Grasshopper.Kernel.GH_FileWatcher.FileChangedSimple)
Create a new FileSystem Watcher object aimed at a specific file.
folderPath: Folder to watch.
filter: Filter string for filenames.
events: Events to watch for.
delegate: Callback delegate.
Returns: A new filewatcher aimed at the specified folder.

Grasshopper.Kernel.GH_FileWatcher.CreateDirectoryWatcher(System.String,System.String,Grasshopper.Kernel.GH_FileWatcherEvents,Grasshopper.Kernel.GH_FileWatcher.FileChanged)
Create a new FileSystem Watcher object aimed at a specific file.
folderPath: Folder to watch.
filter: Filter string for filenames.
events: Events to watch for.
delegate: Callback delegate.
Returns: A new filewatcher aimed at the specified folder.

Grasshopper.Kernel.GH_FileWatcher.Active
Gets or sets the active flag on this watcher.

Grasshopper.Kernel.GH_FileWatcher.Path
Gets the file or folder path currently being watched.

Grasshopper.Kernel.GH_FileWatcher.Buffer
Gets or sets the time during which events are buffered.
If multiple events for the same file occur within the buffered timespan,
they will be merged into one event.

Grasshopper.Kernel.GH_FileWatcher.InvokeOnDefaultThread
Gets or sets invoke behaviour for events.
If true, then the event delegate is called via the Grasshopper main UI thread.
This is almost always what you need.

Grasshopper.Kernel.GH_FileWatcher.SetCustomUIThread(System.Windows.Forms.Control)
If you want to override the default Invoke behaviour, you must set
InvokeOnDefaultThread to False and supply either a custom Control or a Form.
target: GUI target object which will be used for Invoking File System Events.

Grasshopper.Kernel.GH_FileWatcher.SetCustomUIThread(System.Windows.Forms.Form)
If you want to override the default Invoke behaviour, you must set
InvokeOnDefaultThread to False and supply either a custom Control or a Form.
target: GUI target object which will be used for Invoking File System Events.