Grasshopper.Kernel.Geometry.Voronoi.Solver


Grasshopper.Kernel.Geometry.Voronoi.Solver.#ctor
This class cannot be constructed.

Grasshopper.Kernel.Geometry.Voronoi.Solver.Solve_BruteForce(Grasshopper.Kernel.Geometry.Node2List,System.Collections.Generic.IEnumerable{Grasshopper.Kernel.Geometry.Node2})
Solve the voronoi diagram using a Sorted Brute force approach.
Works best with a collection of nodes which are spread along the x-direction.
This function will renumber and sort the nodes.
nodes: Nodes to solve for. This list will be renumbered and sorted.
outline: Initial boundary for every cell.
Returns: The voronoi cells. Order of cells is identical to the order of nodes.

Grasshopper.Kernel.Geometry.Voronoi.Solver.Solve_Connectivity(Grasshopper.Kernel.Geometry.Node2List,Grasshopper.Kernel.Geometry.Delaunay.Connectivity,System.Collections.Generic.IEnumerable{Grasshopper.Kernel.Geometry.Node2})
Solve the voronoi diagram using a minimal connectivity map.
nodes: Nodes to solve for.
diagram: Connectivity diagram. Can be obtained from a Delaunay mesh.
outline: Initial boundary for every cell.