Grasshopper.GUI.Script.GH_ScriptEditor.Language
Gets the language used in this Script editor.

Grasshopper.GUI.Script.GH_ScriptEditor.FindScriptEditor(Grasshopper.Kernel.IGH_DocumentObject)
Find the editor that is already associated with an object.

Grasshopper.GUI.Script.GH_ScriptEditor.AddButton(Grasshopper.GUI.Script.GH_ScriptEditorButton)
Adds another button to the toolbar. Buttons should be added before the form is shown.
button: Button to add.

Grasshopper.GUI.Script.GH_ScriptEditor.EditorFont
Gets or sets the font to use for the editor

Grasshopper.GUI.Script.GH_ScriptEditor.CurrentPosition
Gets the current caret position.

Grasshopper.GUI.Script.GH_ScriptEditor.SetCurrentPosition(System.Drawing.Point)
Set the current caret position.
position: Position to set.

Grasshopper.GUI.Script.GH_ScriptEditor.DefaultAssemblies
Get a list of all the assemblies that are included by default for Scripts.
This list excludes mscorlib.dll as that one is considered non-omittable.

Grasshopper.GUI.Script.GH_ScriptEditor.DefaultAssemblyLocations
Get a list of all the assembly locations that are included by default for Scripts.

Grasshopper.GUI.Script.GH_ScriptEditor.Cache_AppDataDirectory
Gets the directory in windows ApplicationData that contains the source code caches
Returns: A directory path.

Grasshopper.GUI.Script.GH_ScriptEditor.GetAllCacheFiles
Gets a collection of all the cache files.
Returns: Sorted list of all cache files.

Grasshopper.GUI.Script.GH_ScriptEditor.FocusOnSource
Collapses all code blocks except the one containing the mutable sections.