Grasshopper.Kernel.Special.GH_PanelProperties
Aggregates all properties of a Text Panel object.

Grasshopper.Kernel.Special.GH_PanelProperties.Alignment
Gets or sets the String alignment for loose items in the Text Panel.

Grasshopper.Kernel.Special.GH_PanelProperties.Wrap
Gets or sets whether items are wrapped or trimmed.

Grasshopper.Kernel.Special.GH_PanelProperties.Multiline
Gets the sets the usertext multiline parsing option.
If false, every new line in the panel results in a new string item in the
volatile data.

Grasshopper.Kernel.Special.GH_PanelProperties.SpecialCodes
Gets or sets whether special codes are replaced in the panel volatile data.

Grasshopper.Kernel.Special.GH_PanelProperties.DrawPaths
Gets or sets a value indicating whether or not Branch Paths should be included in the display.

Grasshopper.Kernel.Special.GH_PanelProperties.DrawIndices
Gets or sets whether item indices are included in the panel.

Grasshopper.Kernel.Special.GH_PanelProperties.StreamContents
Gets or sets whether the panel streams the contents to a file.

Grasshopper.Kernel.Special.GH_PanelProperties.StreamPath
Gets or sets the filepath for content streaming.

Grasshopper.Kernel.Special.GH_PanelProperties.Colour
Gets or sets the current background colour.

Grasshopper.Kernel.Special.GH_PanelProperties.InferredBackColour
Gets the current inferred background colour.

Grasshopper.Kernel.Special.GH_PanelProperties.InferredForeColour
Gets the current inferred foreground colour.

Grasshopper.Kernel.Special.GH_PanelProperties.InferredBackColourSelected
Gets the current inferred selected background colour.

Grasshopper.Kernel.Special.GH_PanelProperties.InferredForeColourSelected
Gets the current inferred selected foreground colour.

Grasshopper.Kernel.Special.GH_PanelProperties.Font
Gets or sets the font for this panel.

Grasshopper.Kernel.Special.GH_PanelProperties.IncreaseFont
Increase the font one level.
Returns: True if font was increased, false if not.

Grasshopper.Kernel.Special.GH_PanelProperties.DecreaseFont
Decrease the font one level.
Returns: True if font was decreased, false if not.