Grasshopper.Getters.GH_PointGetter.AcceptPreselected
Gets or sets a value indicating whether or not preselected point objects are accepted.

Grasshopper.Getters.GH_PointGetter.PointRefType
Gets or sets the Point Reference type.

Grasshopper.Getters.GH_PointGetter.DefaultRefType
Gets the default point reference type based on the layout of the active doc.

Grasshopper.Getters.GH_PointGetter.RecreateSetup(Grasshopper.Kernel.Types.GH_Point)
Use this function to set up all the properties to mimic an initial getter operation
similar to the one that resulted in the given point.
pt: Point to infer getter options from.

Grasshopper.Getters.GH_PointGetter.GetPoint(System.String,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d@)
Utility function for getting single points. This function properly  Handles Nothing results.
prompt: Prompt to display during GetPoint.
basePoint: Base point for getter or Point3d.Unset for not base point.
outPoint: Resulting point. Only filled out if return is GH_GetterResult.success
Returns: Result of operation.