Grasshopper.Kernel.Data.GH_RuleResult
Enumerates the possible opinions a rule can have.

Grasshopper.Kernel.Data.GH_RuleResult.NoOpinion
The rule does not prohibit or enforce any behaviour.

Grasshopper.Kernel.Data.GH_RuleResult.Include
The rule claims a certain index ought to be included.

Grasshopper.Kernel.Data.GH_RuleResult.Exclude
The rule claims a certain index ought to be exluded.