Grasshopper.Kernel.Special.GH_GeometryCache.CurrentCacheAction
Gets the current action as indicated by several properties.

Grasshopper.Kernel.Special.GH_GeometryCache.DestroyGeometryCaches
Remove all cached objects from the document.

Grasshopper.Kernel.Special.GH_GeometryCache.WriteGeometryCache
Create all cached objects in the document.

Grasshopper.Kernel.Special.GH_GeometryCache.ReadGeometryCache
Repopulate the local data from the current Rhino document.
You must call ExpireSolution() if you want the changes to take place.