Grasshopper.GUI.MRU.GH_TimeLine


Grasshopper.GUI.MRU.GH_TimeLine.ScrollBar
Gets the scroll bar instance of this timeline.

Grasshopper.GUI.MRU.GH_TimeLine.ScrollBarShape
Gets the actual size and position of the scroll bar.

Grasshopper.GUI.MRU.GH_TimeLine.SpanHeight
Gets the height taken up by all the spans.

Grasshopper.GUI.MRU.GH_TimeLine.Offset
Gets the vertical scrolling offset for the timeline.