Grasshopper.GUI.Ribbon.GH_RibbonPanel


Grasshopper.GUI.Ribbon.GH_RibbonPanel.Name
Gets or sets the name of the panel.
Remarks: Panels with names should render those as panel-bars.

Grasshopper.GUI.Ribbon.GH_RibbonPanel.Owner
Gets or sets the owner control for this panel.
The GH_RibbonPanel owner
Remarks: If you supply a NULL value, you cannot call any interface methods

Grasshopper.GUI.Ribbon.GH_RibbonPanel.AllItems
Gets the internal collection of items.

Grasshopper.GUI.Ribbon.GH_RibbonPanel.VisibleItems
Gets all items currently visible on the panel.

Grasshopper.GUI.Ribbon.GH_RibbonPanel.AddItem(Grasshopper.GUI.Ribbon.GH_RibbonItem)
Adds a new item to the content.
item: The item to add
Returns: True on success, false if the item is already referenced
Remarks: If you don't call this method to add icons you must make sure the owner flag on the item is properly set.

Grasshopper.GUI.Ribbon.GH_RibbonPanel.RemoveItem(Grasshopper.GUI.Ribbon.GH_RibbonItem)
Removes an item from the content
item: The item to remove
Returns: True on success, false if the item iis not part of this panel
Remarks: This will set the owner flag on the item to Null

Grasshopper.GUI.Ribbon.GH_RibbonPanel.ItemAt(System.Int32)
Returns the item at the specified index in the item list.
index: Index of item to retrieve.

Grasshopper.GUI.Ribbon.GH_RibbonPanel.ItemAt(System.Drawing.Point)
Returns the first item at the specified pixel in the item list.
pt: Point to test for inclusion.

Grasshopper.GUI.Ribbon.GH_RibbonPanel.IndexAt(System.Drawing.Point)
Returns the index of the item that contains the location
pt: The location to include

Grasshopper.GUI.Ribbon.GH_RibbonPanel.Contains(System.Guid,Grasshopper.Kernel.GH_Exposure)
Checks to see whether a specific id/exposure combination is already present in this panel.

Grasshopper.GUI.Ribbon.GH_RibbonPanel.PanelBarRegion
Computes the panel bar region.

Grasshopper.GUI.Ribbon.GH_RibbonPanel.PerformLayout
Performs a tight-fit stacking of all content items. All items will be layed out and the panel Region will be adjusted to match.

Grasshopper.GUI.Ribbon.GH_RibbonPanel.MoveTo(System.Int32,System.Int32)
Move the panel and all content to a new location.

Grasshopper.GUI.Ribbon.GH_RibbonPanel.VisibleItemRegion
Gets the rectangle containing all visible items.

Grasshopper.GUI.Ribbon.GH_RibbonPanel.CollapseColumn(System.Int32)
Collapse all the items that share a column with the indexed item and
adjust trailing items.
index: Index of item (within the m_itemsVisible collection) to identify column.

Grasshopper.GUI.Ribbon.GH_RibbonPanel.CollapseLastColumn
Removes the rightmost column

Grasshopper.GUI.Ribbon.GH_RibbonPanel.CollapseLeastSignificantColumn
Removes the rightmost column that features only Obscure items.
Returns: True if a column was collapsed, false if no snigle column with only Obscure items could be found.

Grasshopper.GUI.Ribbon.GH_RibbonPanel.MinimumWidth
Gets the minimum width of a panel (a single column of items)

Grasshopper.GUI.Ribbon.GH_RibbonPanel.DesiredHeight(System.Int32)
Calculates the desired height of the panel based on a given height.
initialHeight: The supplied height.
Returns: The nearest desired height.
Remarks: The desired height is the nearest height that is comfortable for this panel.
"Comfortable" being defined as minimum wasted space in the layout.

Grasshopper.GUI.Ribbon.GH_RibbonPanel.Sort
Sorts items on the panel.
Remarks:

Grasshopper.GUI.Ribbon.GH_RibbonPanel.RibbonFont
Returns the font which is used to draw the panel bar tag

Grasshopper.GUI.Ribbon.GH_RibbonPanel.RenderPanelBorder(System.Drawing.Graphics,System.String)
Renders default panel border as etched, rounded rectangle.
g: The graphics object to render with
panelName: If not Null, a panel bar will be included with the text on it

Grasshopper.GUI.Ribbon.GH_RibbonPanel.RenderPanel(System.Drawing.Graphics)
Renders the panel and all the items to the graphics context