Grasshopper.Kernel.IGH_InitCodeAware
Implement this interface in your IGH_DocumentObject class if you want to
handle initialization codes from Canvas Search boxes.

Grasshopper.Kernel.IGH_InitCodeAware.SetInitCode(System.String)
This method will be called when the user inserts an object via the
Canvas Search popup and supplies an "=XXXX" string init code.
Do not throw exceptions in this method! Either handle the code correctly or ignore it.
code: The portion after the first "=" symbol.