Grasshopper.GUI.Stacks.GH_Motion
Provides functionality for individual rectangle animation.

Grasshopper.GUI.Stacks.GH_Motion.m_r0
Element dimensions at t = 0

Grasshopper.GUI.Stacks.GH_Motion.m_r1
Element dimensions at t = 1

Grasshopper.GUI.Stacks.GH_Motion.m_t0
Animation start time in system ticks.

Grasshopper.GUI.Stacks.GH_Motion.m_t1
Animation stop time in system ticks.

Grasshopper.GUI.Stacks.GH_Motion.m_interpolation
Key frame interpolation to use when animating frames.

Grasshopper.GUI.Stacks.GH_Motion.#ctor(System.Drawing.Rectangle,System.Drawing.Rectangle,System.Int32)
Constructor. Create a new stack keyframe animator.
rec_0: Initial dimensions of stack element.
rec_1: Final dimensions of stack element.
duration: The duration, in milliseconds, for the animation

Grasshopper.GUI.Stacks.GH_Motion.#ctor(System.Drawing.Rectangle,System.Drawing.Rectangle,System.Int64,System.Int64)
Constructor. Create a new stack keyframe animator.
rec_0: Initial dimensions of stack element.
rec_1: Final dimensions of stack element.
time_0: Time start override (in system time ticks).
time_1: Time stop override (in system time ticks).
Remarks:

Grasshopper.GUI.Stacks.GH_Motion.Interpolation
Gets or sets the interpolation method for blending frames.

Grasshopper.GUI.Stacks.GH_Motion.InMotion
Gets the motion state of this object.

Grasshopper.GUI.Stacks.GH_Motion.t0
Gets the start time for this animation.

Grasshopper.GUI.Stacks.GH_Motion.t1
Gets the stop time for this animation.

Grasshopper.GUI.Stacks.GH_Motion.Parameter
Gets the normalised time frame parameter for the current instant.

Grasshopper.GUI.Stacks.GH_Motion.InitialBox
Gets the dimensions of the stack box at t=0

Grasshopper.GUI.Stacks.GH_Motion.FinalBox
Gets the dimensions of the stack box at t=1

Grasshopper.GUI.Stacks.GH_Motion.CurrentBox
Gets the rectangle that describes the shape of the box at the current instant.

Grasshopper.GUI.Stacks.GH_Motion.ResizeContainer(System.Drawing.Rectangle,System.Boolean,System.Boolean)
Call this function to override the width or height without
interfering with the animation.
region: New region.
fit_horizontal: If True, all the elements will be fit to the region horizontally.
fit_vertical: If True, all the elements will be fit to the region vertically.

Grasshopper.GUI.Stacks.GH_Motion.InterpolateBox(System.Double)
Linear box interpolation.
t: Normalized interpolation parameter.