Grasshopper.Kernel.GH_ClipboardType
Enumerates all possible clipboards for GH_DocumentIO operations.

Grasshopper.Kernel.GH_ClipboardType.System
Identifies the Operating System clipboard shared amongst all applications.

Grasshopper.Kernel.GH_ClipboardType.Local
Identifies the DocumentIO clipboard which is only accessible from within a single instance of GH_DocumentIO.

Grasshopper.Kernel.GH_ClipboardType.Global
Identifies the DocumentIO clipboard which is accessible from all instances of GH_DocumentIO in this AppDomain.