Grasshopper.Kernel.GH_PreviewFilter
Lists all possible Grasshopper preview filters.

Grasshopper.Kernel.GH_PreviewFilter.None
Specifies no filtering is applied to the preview, i.e. all objects are drawn.

Grasshopper.Kernel.GH_PreviewFilter.Selected
Only selected objects are included in the preview.