Grasshopper.Kernel.Attributes.GH_ComponentAttributes
These Attributes are the default for GH_Components.

Grasshopper.Kernel.Attributes.GH_ComponentAttributes.LayoutComponentBox(Grasshopper.Kernel.IGH_Component)
Utility layout method for GH_Component style UI.
owner: Component to layout.
Returns: The rectangle describing the box of the component name/icon.

Grasshopper.Kernel.Attributes.GH_ComponentAttributes.ContentBox
Gets the bounds of the component area of the attributes.

Grasshopper.Kernel.Attributes.GH_ComponentAttributes.m_innerBounds
Represents the Rectangle that contains the component black box.

Grasshopper.Kernel.Attributes.GH_ComponentAttributes.m_insertRegions
Maintains all Variable parameter insert regions.

Grasshopper.Kernel.Attributes.GH_ComponentAttributes.m_removeRegions
Maintains all Variable parameter remove regions.

Grasshopper.Kernel.Attributes.GH_ComponentAttributes.m_drawZui
Local ZUI flag.

Grasshopper.Kernel.Attributes.GH_ComponentAttributes.InvalidateCanvas(Grasshopper.GUI.Canvas.GH_Canvas,Grasshopper.GUI.GH_CanvasMouseEvent)
The canvas must be invalidated when the mouse is near enough and
this component has variable parameters.

Grasshopper.Kernel.Attributes.GH_ComponentAttributes.RenderComponentParameters(Grasshopper.GUI.Canvas.GH_Canvas,System.Drawing.Graphics,Grasshopper.Kernel.IGH_Component,Grasshopper.GUI.Canvas.GH_PaletteStyle)
Utility method for rendering all component parameters.
canvas: Canvas to draw to.
graphics: Graphics to draw with.
owner: Component to draw parameters for.
style: Component capsule palette style.

Grasshopper.Kernel.Attributes.GH_ComponentAttributes.RenderComponentCapsule(Grasshopper.GUI.Canvas.GH_Canvas,System.Drawing.Graphics)
Utility function, draws the complete component capsule including all parameter data.
canvas: Canvas to draw into.
graphics: Graphics object to draw with.

Grasshopper.Kernel.Attributes.GH_ComponentAttributes.RenderComponentCapsule(Grasshopper.GUI.Canvas.GH_Canvas,System.Drawing.Graphics,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Utility function, draws the component capsule including all specified elements.
canvas: Canvas to draw into.
graphics: Graphics object to draw with.
drawComponentBaseBox: If true, will draw the component background box.
drawComponentNameBox: If true, will draw component nickname/icon element.
drawJaggedEdges: If true, parameterless sides will have jagged edges drawn on them.
drawParameterGrips: If true, will draw parameter grips.
drawParameterNames: If true, will draw parameter nicknames.
drawZuiElements: If true, will draw ZUI variable parameter interface.

Grasshopper.Kernel.Attributes.GH_ComponentAttributes.LayoutVariableParameterZui
Only call this function when you know you need to display variable parameter zui
and it doesn't yet exist.

Grasshopper.Kernel.Attributes.GH_ComponentAttributes.IsZuiCoordinate(System.Drawing.PointF)
Tests whether a coordinate is on a ZUI element.