Grasshopper.Kernel.Types.GH_GeometricGoo`1
Abstract base implementation of IGH_GeometricGoo. If you implement IGH_GeometricGoo, use this for a booster.

Grasshopper.Kernel.Types.GH_GeometricGoo`1.#ctor
Blank constructor, m_value will be set to default (null for reference types, zeroes for value types)

Grasshopper.Kernel.Types.GH_GeometricGoo`1.#ctor(`0)
Data constructor, m_value will be set to internal_data.
internal_data: Value to store inside this Goo instance.

Grasshopper.Kernel.Types.GH_GeometricGoo`1.Duplicate
Make a complete duplicate of this instance. No shallow copies.
Remarks: Classes which implement this interface should also provide type specific Duplicate methods

Grasshopper.Kernel.Types.GH_GeometricGoo`1.DuplicateGeometry
Make a complete duplicate of this geometry. No shallow copies.
Remarks: Each class that implements this interface should also provide a type specific duplication method

Grasshopper.Kernel.Types.GH_GeometricGoo`1.EmitProxy
Create a new proxy for this instance. Return Null if this class does not support proxies.

Grasshopper.Kernel.Types.GH_GeometricGoo`1.IsValid
Gets a value indicating whether or not the current value is valid.

Grasshopper.Kernel.Types.GH_GeometricGoo`1.Boundingbox
Gets the boundingbox for this geometry.
Returns: The boundingbox for this piece of geometry or
Boundingbox.Empty if the geometry is null or invalid.

Grasshopper.Kernel.Types.GH_GeometricGoo`1.GetBoundingBox(Rhino.Geometry.Transform)
Compute an aligned boundingbox.
xform: Transformation to apply to geometry for BoundingBox computation.
Returns: The world aligned boundingbox of the transformed geometry.

Grasshopper.Kernel.Types.GH_GeometricGoo`1.Transform(Rhino.Geometry.Transform)
Transforms the object or a deformable representation of the object.
xform: Transformation matrix.
Returns: Transformed geometry. If the local geometry can be transformed accurately,
then the returned instance equals this instance. Not all geometry types can be accurately
transformed under all circumstances though, if this is the case, this function will
return an instance of another IGH_GeometricGoo derived type which can be transformed.

Grasshopper.Kernel.Types.GH_GeometricGoo`1.Morph(Rhino.Geometry.SpaceMorph)
Morph the object or a deformable representation of the object.
xmorph: Spatial deform.
Returns: Deformed geometry. If the local geometry can be deformed accurately,
then the returned instance equals this instance. Not all geometry types can be accurately
deformed though, if this is the case, this function will
return an instance of another IGH_GeometricGoo derived type which can be deformed.

Grasshopper.Kernel.Types.GH_GeometricGoo`1.Value
Gets or sets the value of this type.
Note that if the type has a ReferenceID this value might get destroyed in the future.

Grasshopper.Kernel.Types.GH_GeometricGoo`1.ReferenceID
Gets or sets the Guid of the object that is referenced.
Not all IGH_GeometricGoo implementations support referenced geometry.
The default implementation is to always return Guid.Empty.

Grasshopper.Kernel.Types.GH_GeometricGoo`1.IsReferencedGeometry
Gets a value indicating whether or not this geometry is referenced.
Not all IGH_GeometricGoo implementations support referenced geometry.

Grasshopper.Kernel.Types.GH_GeometricGoo`1.IsGeometryLoaded
Gets a value indicating whether or not this geometry is currently loaded (assuming it is referenced).
Not all IGH_GeometricGoo implementations support referenced geometry. The default is to always return True.

Grasshopper.Kernel.Types.GH_GeometricGoo`1.LoadGeometry
If the geometry is referenced and currently unloaded, forces loading of the geometry.
Not all IGH_GeometricGoo implementations support referenced geometry.

Grasshopper.Kernel.Types.GH_GeometricGoo`1.LoadGeometry(Rhino.RhinoDoc)
If the geometry is referenced and currently unloaded, forces loading of the geometry.
Not all IGH_GeometricGoo implementations support referenced geometry. The default is to always return True.
doc: Document to use for loading.

Grasshopper.Kernel.Types.GH_GeometricGoo`1.ClearCaches
Clears all caches. Typically if the geometry is referenced, this will erase the local copy.
If your T is a value-type, you must override this function and specifically unset the local value.

Grasshopper.Kernel.Types.GH_GeometricGoo`1.CastFrom(System.Object)
Attempt a cast from generic object.
source: Reference to source of cast.
Returns: True on success, false on failure.
Remarks: If False, the contents of this instance are not to be trusted.

Grasshopper.Kernel.Types.GH_GeometricGoo`1.CastTo``1(``0@)
Attempt a cast to type T.
Type to cast to
target: Pointer to target of cast.
Returns: True on success, false on failure.
Remarks: If false, the target instance contents are not guaranteed to be valid.