Grasshopper.Kernel.IGH_Param
Base interface for all Parameter types in Grasshopper.
Do not implement this interface from scratch, derive from GH_Param or
GH_PersistentParam instead.

Grasshopper.Kernel.IGH_Param.Kind
Gets the parameter kind. The kind is evaluated lazily and cached.

Grasshopper.Kernel.IGH_Param.DataType
Gets the type of the current data state.

Grasshopper.Kernel.IGH_Param.Type
Gets the Framework Type descriptor for the stored Data.

Grasshopper.Kernel.IGH_Param.TypeName
Gets a human readable description of the data stored in this parameter.

Grasshopper.Kernel.IGH_Param.StateTags
Gets all the StateTags that are associated with this parameter.
A state tag is a visual feedback icon that represents specific internal settings.

Grasshopper.Kernel.IGH_Param.WireDisplay
Gets or sets the wire display style for this parameter.
Wire display only affects the wires connected to the parameter input.

Grasshopper.Kernel.IGH_Param.Optional
Gets or sets whether or not this parameter is considered optional by the owner component.
Empty, non-optional parameters prevent the component from being solved.

Grasshopper.Kernel.IGH_Param.DataMapping
Gets or sets the data mapping of this Parameter.

Grasshopper.Kernel.IGH_Param.Access
Gets or sets the Access level for this parameter.

Grasshopper.Kernel.IGH_Param.Reverse
Gets or sets the data reverse modifier of this parameter.

Grasshopper.Kernel.IGH_Param.Simplify
Gets or sets the simplify modifier for this parameter.

Grasshopper.Kernel.IGH_Param.RemoveEffects
Remove all post-process effects.

Grasshopper.Kernel.IGH_Param.AddSource(Grasshopper.Kernel.IGH_Param)
Append a new Source parameter to the end of the Sources list.
Sources provide this parameter with data at runtime.
source: Source to append.

Grasshopper.Kernel.IGH_Param.AddSource(Grasshopper.Kernel.IGH_Param,System.Int32)
Insert a new Source parameter into the Sources list.
Sources provide this parameter with data at runtime.
source: Source to append.
index: Insertion index of source.

Grasshopper.Kernel.IGH_Param.RemoveSource(Grasshopper.Kernel.IGH_Param)
Remove the specified source from this parameter.
source: Source to remove.

Grasshopper.Kernel.IGH_Param.RemoveSource(System.Guid)
Remove the specified source from this parameter.
source_id: InstanceID of source to remove.

Grasshopper.Kernel.IGH_Param.RemoveAllSources
Remove all sources from this parameter.

Grasshopper.Kernel.IGH_Param.ReplaceSource(Grasshopper.Kernel.IGH_Param,Grasshopper.Kernel.IGH_Param)
Replace an existing source with a new one. If the old_source
does not exist in this parameter, nothing happens.
old_source: Source to replace.
new_source: Source to replace with.

Grasshopper.Kernel.IGH_Param.ReplaceSource(System.Guid,Grasshopper.Kernel.IGH_Param)
Replace an existing source with a new one. If the old_source
does not exist in this parameter, nothing happens.
old_source_id: Source to replace.
new_source: Source to replace with.

Grasshopper.Kernel.IGH_Param.Sources
Gets a list of source parameters. Do not modify this list,
if you wish to add or remove sources, use dedicated functions
like AddSource() and RemoveSource instead.
Returns: The sources for this parameter.

Grasshopper.Kernel.IGH_Param.SourceCount
Gets the number of sources for this parameter.

Grasshopper.Kernel.IGH_Param.HasProxySources
Gets a value indicating whether or not this parameter maintains proxy sources.
Proxy sources are used during file IO, when actual sources might not be available yet.
Once an IO operation has been completed there should be no more proxy sources.
Returns: True if the parameter has at least one proxy source, false if not.

Grasshopper.Kernel.IGH_Param.ProxySourceCount
Gets the number of proxy sources for this parameter.
Proxy sources are used during file IO, when actual sources might not be available yet.
Once an IO operation has been completed there should be no more proxy sources.
Returns: The number of proxy sources associated with this parameter.

Grasshopper.Kernel.IGH_Param.RelinkProxySources(Grasshopper.Kernel.GH_Document)
Attempt to replace all proxy sources with real sources.
Proxy sources are used during file IO, when actual sources might not be available yet.
Once an IO operation has been completed there should be no more proxy sources.
Document: The document from which to harvest the real source parameters.
Returns: True on success, false on failure.

Grasshopper.Kernel.IGH_Param.ClearProxySources
Remove all proxy sources without attempting to relink them.

Grasshopper.Kernel.IGH_Param.CreateProxySources
Convert all proper source parameters into proxy sources.

Grasshopper.Kernel.IGH_Param.Recipients
Gets a list of all the recipients of this parameter.
I.e. a recipient has this parameter as one of the sources.
The Recipient list is maintained by the parameter,
do not modify it yourself.

Grasshopper.Kernel.IGH_Param.VolatileDataCount
Gets the total number of volatile data items stored in this parameter.

Grasshopper.Kernel.IGH_Param.VolatileData
Gets the instance of the volatile data tree stored in this parameter.

Grasshopper.Kernel.IGH_Param.AddVolatileData(Grasshopper.Kernel.Data.GH_Path,System.Int32,System.Object)
Inserts an item of volatile data into the data structure.
path: The branch path of the data. If the path doesn't exist yet, it will be created.
index: The item index of the data. If the path doesn't contain the index yet,
it will be enlarged to encompass the index.
data: The data to store.
Returns: True on success, False on failure. If the data cannot be converted, the topology will remain unmolested.

Grasshopper.Kernel.IGH_Param.AddVolatileDataList(Grasshopper.Kernel.Data.GH_Path,System.Collections.IEnumerable)
Inserts a list of items into the data structure.
path: The branch path of the data. If the path doesn't exist yet, it will be created.
list: The data list to store.

Grasshopper.Kernel.IGH_Param.AddVolatileDataTree(Grasshopper.Kernel.Data.IGH_Structure)
Insert an entire data tree into this parameter.
tree: Data tree to insert.
Returns: True on success, false on failure.