Grasshopper.Kernel.GH_ComponentServer
Maintains proxies for all components, parameters and other object types as defined in all grasshopper assemblies.

Grasshopper.Kernel.GH_ComponentServer.Clear
Clear all caches.

Grasshopper.Kernel.GH_ComponentServer.Libraries
Returns a list of Assembly Info objects describing all loaded assemblies.

Grasshopper.Kernel.GH_ComponentServer.FindAssembly(System.Guid)
Gets the assembly that corresponds to the given library ID.
libraryId: Library ID to search for.
Returns: The library info, or null if the ID is not registered.

Grasshopper.Kernel.GH_ComponentServer.FindAssemblyByObject(Grasshopper.Kernel.IGH_DocumentObject)
Gets the assembly that corresponds to the given library ID.
object: Object.
Returns: The library info, or null if the ID is not registered.

Grasshopper.Kernel.GH_ComponentServer.FindAssemblyByObject(System.Guid)
Gets the assembly that corresponds to the given library ID.
objectId: The object ComponentGuid.
Returns: The library info, or null if the ID is not registered.

Grasshopper.Kernel.GH_ComponentServer.ObjectProxyNames
Returns a specialized string collection of all component names.
Remarks: This property is used for autocompletion in textboxes.

Grasshopper.Kernel.GH_ComponentServer.ObjectProxies
Returns a list of all cached GH_ObjectProxy instances.

Grasshopper.Kernel.GH_ComponentServer.GraphProxies
Returns a list of all cached GH_GraphProxy instances.

Grasshopper.Kernel.GH_ComponentServer.TypeHints
Gets a list of all IGH_TypeHint types in all loaded assemblies.
Returns: A list of System.Type containing all classes that implement IGH_TypeHint.

Grasshopper.Kernel.GH_ComponentServer.Upgraders
Gets a list of all the upgraders that have been cached.

Grasshopper.Kernel.GH_ComponentServer.IsUpgrader(System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_DocumentObject})
Checks to see if at least one upgrader is defined for a collection of objects.

Grasshopper.Kernel.GH_ComponentServer.FindUpgrader(System.Guid)
Find the upgrader that can convert from the given target.
target: ComponentID of object to upgrade.
Returns: Matching upgrader or null if no upgrader is defined.

Grasshopper.Kernel.GH_ComponentServer.DiscardedProxies
Returns the total number of IGH_DocumentObjects that were discarded during assembly parsing.
This includes both skipped and replaced proxies.

Grasshopper.Kernel.GH_ComponentServer.IsObjectCached(System.Guid)
Tests the caches for an existing object type ID.
id: The ID to test for.
Returns: True if the ID is cached, false if it aint.

Grasshopper.Kernel.GH_ComponentServer.IsGraphCached(System.Guid)
Tests the graph cache for an existing graph type ID.
id: The ID to test for.
Returns: True if the ID is cached, false if it aint.

Grasshopper.Kernel.GH_ComponentServer.RemoveCachedObject(System.Guid)
Remove a cache entry from the object cache. This cannot be undone.
id: The id to remove.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_ComponentServer.RemoveCachedObject(System.String)
Remove the user object (if any) that loads itself from a specified *.ghuser file.
userObjectFilePath: File name path of user object proxy.
Returns: True if an object proxy was removed, false if not.

Grasshopper.Kernel.GH_ComponentServer.ClearStaleUserObjects
Remove all user objects that no longer point to existing files.

Grasshopper.Kernel.GH_ComponentServer.RemoveCachedGraph(System.Guid)
Remove a cache entry from the graph cache. This cannot be undone.
id: The id to remove.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_ComponentServer.SettingCategories
Gets the cached list of all Setting categories.

Grasshopper.Kernel.GH_ComponentServer.SettingFrontends
Gets the cached list of all Setting frontends.

Grasshopper.Kernel.GH_ComponentServer.EmitObjectProxy(System.Guid)
Get the proxy that is associated with the given Object ID.
id: ID to search for.

Grasshopper.Kernel.GH_ComponentServer.EmitObjectIcon(System.Guid)
Get the icon that is associated with the given Object ID.
id: ID to search for.
Returns: Icon of object or null if object is not defined or if object does not have an icon.

Grasshopper.Kernel.GH_ComponentServer.EmitObject(System.Guid)
Create a new instance of the IGH_DocumentObject that matches the id.
If no proxy can be matched to the id, a null reference will be returned.
id: The component type id to instantiate

Grasshopper.Kernel.GH_ComponentServer.EmitGraph(System.Guid)
Create a new instance of the IGH_Graph that matches the id.
If no proxy can be matched to the id, a null reference will be returned.
id: The graph type id to instantiate

Grasshopper.Kernel.GH_ComponentServer.NewUserObject(Grasshopper.Kernel.IGH_DocumentObject)
Create a new UserObject and write it to the Grasshopper User Object folder.
obj: Object to write.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_ComponentServer.CompareProxies(Grasshopper.Kernel.IGH_ObjectProxy,Grasshopper.Kernel.IGH_ObjectProxy)
Compare two object proxies. Names and exposures are taken into account.
A: First proxy to compare.
B: Second proxy to compare.
Returns:
-1 if A is valued lower than B,
0 if A and B are considered equal,
+1 if A is valued higher than B.

Grasshopper.Kernel.GH_ComponentServer.SetExternalGHAs(System.Collections.Generic.IEnumerable{System.String})
WORK IN PROGRESS FOR V7 - keep as Friend function until we have settled
on an appropriate SDK. Used by GhApper to specify a subset of components to
load in order to reduce start time
names:

Grasshopper.Kernel.GH_ComponentServer.ExternalFiles(System.Boolean,System.Boolean)
Get lists of all the external files (GHA, GHUSER and GHCLUSTER) that will be loaded by Grasshopper.
Note: this does not equal the files that may already have been loaded, just the files that we'll attempt
to load if we were asked to load all plugins now. The list contains no duplicate file paths, but it may contain
identical files which won't be filtered until actual loading.
testGrasshopperCollisions: If true, invalid duplicates of Grasshopper.dll will be tested for and warned about.
testExternalCollisions: If true, duplicates of GHA, GHUSER and GHCLUSTER files will be tested for and warned about.

Grasshopper.Kernel.GH_ComponentServer.LoadExternalFiles(System.Boolean)
Attempt to parse all external files.
This includes GHA libraries, GHUSER objects and GHCLUSTER files.
loadOneByOne: Ask the user prior to loading each file. This helps narrowing down
startup crashes.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_ComponentServer.LoadExternalFiles(System.Collections.Generic.List{Grasshopper.Kernel.GH_ExternalFile},System.Boolean)
Load Grasshopper.dll and all provided external files.

Grasshopper.Kernel.GH_ComponentServer.LoadExternalFile(Grasshopper.Kernel.GH_ExternalFile,System.Boolean)
Load a GHA, GHUSER or GHCLUSTER file.

Grasshopper.Kernel.GH_ComponentServer.ReloadMemoryAssemblies
Unload all COFF loaded assemblies and remove all related objects,
then attempt to reload them all.

Grasshopper.Kernel.GH_ComponentServer.CopyFileToAppropriateFolder(System.String,System.Boolean)
Copy a GHA or GHUSER file into the appropriate Roaming Application Data folder.
Of the file is already in the top-level roaming folder it will not be copied.
filepath: The file to copy.
moveOriginalToBin: If true, the original file will be placed in the recycle bin upon a successful copy.
Returns: The path of the copied file.

Grasshopper.Kernel.GH_ComponentServer.IsAssemblyCompatible(System.Reflection.Assembly)
Tests to see if an Assembly references a newer version of Grasshopper.
A: Assembly to test
Returns: True if the assembly was build against the current or an
older version of Grasshopper.

Grasshopper.Kernel.GH_ComponentServer.ParseGHA(System.Reflection.Assembly,System.String,Grasshopper.Kernel.GH_LoadingMechanism)
Parse an entirely assembly and load all grasshopper related types into cache.
assembly: Assembly to parse.
path: Location assembly was loaded from. You should always set this location if it exists.
mechanism: Mechanism used to load the assembly.
Returns: A GH_AssemblyInfo object on success. The info object has already been stored in the assembly cache.

Grasshopper.Kernel.GH_ComponentServer.GHAFileLoaded
Raised whenever a GHA file has been successfully loaded.
sender: GH_ComponentServer that raised the event.
e: Event arguments.

Grasshopper.Kernel.GH_ComponentServer.AddProxy(Grasshopper.Kernel.IGH_ObjectProxy)
Add a proxy object to the component server.
Expert user function, talk to David Rutten before calling it.
proxy: Proxy to add.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_ComponentServer.AddProxyLibraryInfo(Grasshopper.Kernel.GH_AssemblyInfo)
Add a library info for a proxy object to the component server.
Expert user function, talk to David Rutten before calling it.
assemblyInfo: Library info to add.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_ComponentServer.LoadAliases
Load the Alias table from the settings directory.
Only use this function if you suspect the alias table settings file has changed
due to some external process.

Grasshopper.Kernel.GH_ComponentServer.SaveAliases
Save the alias table to the settings directory.
Use this function if you change the alias table while
ignoring usual channels.

Grasshopper.Kernel.GH_ComponentServer.AddAlias(System.String,System.Guid)
Add an alias to a target.
alias: Alias to add. If the alias string contains spaces or commas,
those will be used to harvest partial aliases.
target: Component ID of object that is targeted by the alias.

Grasshopper.Kernel.GH_ComponentServer.SetAlias(System.String,System.Guid)
Sets the aliases for a given target.
alias: Alias to add. If the alias string contains spaces or commas,
those will be used to harvest partial aliases. Use a zero-length alias to remove all aliases to the target.
target: Component ID of object that is targeted by the alias.

Grasshopper.Kernel.GH_ComponentServer.GetAlias(System.Guid)
Gets the alias display string for a given object.
target: Object id to retrieve aliases for.
Returns: A parsable display string of aliases.

Grasshopper.Kernel.GH_ComponentServer.Aliases
Gets a list of all the defined aliases.

Grasshopper.Kernel.GH_ComponentServer.AliasTargets(System.String)
Get all the target Component IDs for a given alias.
alias: Alias to search for.

Grasshopper.Kernel.GH_ComponentServer.GHA_AppDataDirectory


Grasshopper.Kernel.GH_ComponentServer.GHA_Directories


Grasshopper.Kernel.GH_ComponentServer.GHUser_AppDataDirectory


Grasshopper.Kernel.GH_ComponentServer.AllAddOns
Gets a list of all the gha and ghuser files that will be loaded as Grasshopper add-ons.
Returns: A list of target file paths.

Grasshopper.Kernel.GH_ComponentServer.LoadExternalFiles
Attempt to parse all external files.
This includes GHA libraries, GHUSER objects and GHCLUSTER files.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_ComponentServer.ParseGHA(System.Reflection.Assembly,System.String)
Parse an entirely assembly and load all grasshopper related types into cache.
assembly: Assembly to parse.
path: Location assembly was loaded from. You should always set this location if it exists.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_ComponentServer.FindObjects(System.String[],System.Int32,Grasshopper.Kernel.IGH_ObjectProxy[]@,System.Double[]@)
Searches the list of cached object proxies for objects that might be implied by a search term.
terms: Search terms to use.
maximumResults: Maximum number of allowed hits.
Returns: A sorted list of search results.

Grasshopper.Kernel.GH_ComponentServer.FindObjects(System.Guid)
Find all the objects that are part of a certain library.
libraryID: ID of library to search for.
Returns: A list of all the objects that are defined in the specified library.

Grasshopper.Kernel.GH_ComponentServer.FindObjectByName(System.String,System.Boolean,System.Boolean)
Find an object by name. Obsolete and hidden objects are ignored.
Only exact matches are included.
name: Name to search for. Name may be prefixed by Category and Subcategory.
ignoreWhiteSpace: If true, whitespace is ignored during matching.
ignoreCapitalisation: If true, capitalisation is ignored during matching.
Returns: The proxy that matches the name, or null if no such object could be found.

Grasshopper.Kernel.GH_ComponentServer.LoadingExceptions
Gets a list of all the exceptions that were recorded during the most recent loading sequence.

Grasshopper.Kernel.GH_ComponentServer.ConflictSolutionPrompt(Grasshopper.Kernel.IGH_ObjectProxy,Grasshopper.Kernel.IGH_ObjectProxy,Grasshopper.Kernel.GH_GuidConflictSolution@)
Displays the GUID conflict dialog for types A and B.
a: The resident instance.
b: The conflicting instance.
solution: the current solution value. If solution equals ReplaceAll or SkipAll the dialog is not displayed.

Grasshopper.Kernel.GH_ComponentServer.CreateLoadingUI
Destroys stale UI and recreates the Banner and Progress dialog.

Grasshopper.Kernel.GH_ComponentServer.DestroyLoadingUI
Destroy the loading UI (the banner and the progress bar).

Grasshopper.Kernel.GH_ComponentServer.AddCategoryShortName(System.String,System.String)
Add an abbreviation for a tab category. 2~4 letter abbreviations are best.
fullCategoryName: The full name of the category.
categoryAbbreviation: The abbreviation to display on the tab.

Grasshopper.Kernel.GH_ComponentServer.AddCategorySymbolName(System.String,System.Char)
Add a single char category description.
fullCategoryName: The full name of the category.
symbol: The single char representing the category.

Grasshopper.Kernel.GH_ComponentServer.AddCategoryIcon(System.String,System.Drawing.Bitmap)
Add an icon for a tab category. 16x16 images are required.
fullCategoryName: The full name of the category.
icon: the icon to display on the tab (has to be a 16x16 image).

Grasshopper.Kernel.GH_ComponentServer.GetCategoryShortName(System.String)
Get the abbreviation (short name) for a specific category. If the short name hasn't been defined,
this method will return the full name instead.
fullName: Full name of category.
Returns: The abbreviated name or the full name.

Grasshopper.Kernel.GH_ComponentServer.GetCategorySymbolName(System.String)
Get the single char representation for a specific category. If the char hasn't been defined,
this method will return the first char of the full name instead.
fullName: Full name of category.
Returns: The category char.

Grasshopper.Kernel.GH_ComponentServer.GetCategoryIcon(System.String)
Get the icon for a specific category. If the icon hasn't been defined,
this method will return the default icon.
fullName: Full name of category.
Returns: The category icon.

Grasshopper.Kernel.GH_ComponentServer.UpdateRibbonUI
Forces an update of the Ribbon control on the Grasshopper main form.

Grasshopper.Kernel.GH_ComponentServer.CompleteRibbonLayout
Gets the default component layout featuring all non-hidden components and parameters.