Grasshopper.Kernel.Types.GH_Interval2D
Represents a two-dimensional numeric domain.

Grasshopper.Kernel.Types.GH_Interval2D.#ctor
Default constructor. Creates two empty intervals.

Grasshopper.Kernel.Types.GH_Interval2D.#ctor(Grasshopper.Kernel.Types.UVInterval)
Duplicates a one-dimensional interval in both directions.
uv: UVInterval value.

Grasshopper.Kernel.Types.GH_Interval2D.#ctor(Grasshopper.Kernel.Types.GH_Interval2D)
Create a duplicate of another two-dimensional interval
other: Interval to copy. If null, a default interval will be created.

Grasshopper.Kernel.Types.GH_Interval2D.Duplicate
Create a duplicate of this interval.

Grasshopper.Kernel.Types.GH_Interval2D.DuplicateInterval
Create a duplicate of this interval.

Grasshopper.Kernel.Types.GH_Interval2D.IsValid
Gets the validity of this instance. Valid intervals contain no #NaN extremes

Grasshopper.Kernel.Types.GH_Interval2D.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Kernel.Types.GH_Interval2D.ToString
Format the interval using default grasshopper formatting logic.

Grasshopper.Kernel.Types.GH_Interval2D.CastFrom(System.Object)
Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_Interval2D.CastTo``1(``0@)
Local to Remote caster function. this stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_Interval2D.EmitProxy
Returns a proxy that represents this interval. Do not call this function unless you're