Grasshopper.Kernel.Data.GH_DirtyCaster


Grasshopper.Kernel.Data.GH_DirtyCaster.#ctor
You are not allowed to construct this class, it only exposes static (Shared in VB) methods.

Grasshopper.Kernel.Data.GH_DirtyCaster.CastToList``1(System.Object)
Dirty cast a List(Of GH_ScriptVariable) to a List(Of T),
where T is the GH_ScriptVariable.Type.
Type cast.
in: List(Of GH_ScriptVariable) which must contain only nulls or instances of {T}.
Returns: A list of T.

Grasshopper.Kernel.Data.GH_DirtyCaster.CastToTree``1(System.Object)
Dirty cast a GH_Structure(Of GH_ScriptVariable) to a DataTree(Of T),
where T is the GH_ScriptVariable.Type.
Type cast.
in: GH_Structure(Of GH_ScriptVariable) which must contain only nulls or instances of {T}.
Returns: A DataTree(Of T).