Grasshopper.GUI.GH_Slider_Obsolete
General purpose numeric slider.

Grasshopper.GUI.GH_Slider_Obsolete.Min
Gets or sets the minimum allowed value.

Grasshopper.GUI.GH_Slider_Obsolete.Max
Gets or sets the maximum allowed value.

Grasshopper.GUI.GH_Slider_Obsolete.Value
Gets or sets the current value.

Grasshopper.GUI.GH_Slider_Obsolete.ValueF
Gets or sets the current value in single-floating-point precision.

Grasshopper.GUI.GH_Slider_Obsolete.NumericFormat
Gets or sets the numeric format for the slider. This is the formatting that is applied to the number.
The default is  #0.00   which results in a two digit rounding scheme.

Grasshopper.GUI.GH_Slider_Obsolete.DisplayFormat
Gets or sets the display format fo the slider. This is the formatting that is applied prior to drawing.
The default is {0}   which results in a 1:1 display. Use this to append units or symbols.
Returns:
Remarks:

Grasshopper.GUI.GH_Slider_Obsolete.GripBackColor
Background colour of slider grip.

Grasshopper.GUI.GH_Slider_Obsolete.GripForeColor
Foreground colour of slider grip.

Grasshopper.GUI.GH_Slider_Obsolete.DrawRail
Gets or sets a flag that control whether or not grip rails are drawn.

Grasshopper.GUI.GH_Slider_Obsolete.TickFrequency
Gets or sets the tick frequency of the slider.

Grasshopper.GUI.GH_Slider_Obsolete.TextInputMode
Gets or sets the Text input mode for this slider.

Grasshopper.GUI.GH_Slider_Obsolete.ValueChanged
Raised whenever the value of the slider is changed via GUI interaction.
sender: Slider control raising the event.
nValue: The new value.
bIntermediate: If true, the change is an intermediate.

Grasshopper.GUI.GH_Slider_Obsolete.OnValueChanged
Raise the ValueChanged event
Remarks:

Grasshopper.GUI.GH_Slider_Obsolete.IsIntermediate
Gets the intermediate flag. If True, the user is currently dragging the slider.