Grasshopper.Kernel.Parameters.Param_Boolean


Grasshopper.Kernel.Parameters.Param_Boolean.Invert
Gets or sets the on-the-fly invert feature. If True, every value passing through this parameter will be negated.
Returns:
Remarks: