Grasshopper.Kernel.Types.GH_Colour
Represents an ARGB colour. GH_Colour re-implements the framework System.Drawing.Color type.

Grasshopper.Kernel.Types.GH_Colour.#ctor
Blank constructor

Grasshopper.Kernel.Types.GH_Colour.IsValid
Gets the validity of this instance.

Grasshopper.Kernel.Types.GH_Colour.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Kernel.Types.GH_Colour.QC_Type


Grasshopper.Kernel.Types.GH_Colour.QC_Hash


Grasshopper.Kernel.Types.GH_Colour.QC_Distance(Grasshopper.Kernel.Types.IGH_QuickCast)


Grasshopper.Kernel.Types.GH_Colour.QC_Bool


Grasshopper.Kernel.Types.GH_Colour.QC_Complex


Grasshopper.Kernel.Types.GH_Colour.QC_Matrix


Grasshopper.Kernel.Types.GH_Colour.QC_Int


Grasshopper.Kernel.Types.GH_Colour.QC_Num


Grasshopper.Kernel.Types.GH_Colour.QC_Text


Grasshopper.Kernel.Types.GH_Colour.QC_Pt


Grasshopper.Kernel.Types.GH_Colour.QC_Vec


Grasshopper.Kernel.Types.GH_Colour.QC_Col


Grasshopper.Kernel.Types.GH_Colour.QC_Interval


Grasshopper.Kernel.Types.GH_Colour.QC_CompareTo(Grasshopper.Kernel.Types.IGH_QuickCast)
