Grasshopper.Kernel.GH_ParamAccess
Enumerates the types of access that parameters support.

Grasshopper.Kernel.GH_ParamAccess.item
Every data item is to be treated individually.

Grasshopper.Kernel.GH_ParamAccess.list
All data branches will be treated at the same time.

Grasshopper.Kernel.GH_ParamAccess.tree
The entire data structure will be treated at once.