Grasshopper.GUI.Base.GH_SliderGripDisplay
Enumerates the possible slider grip displays.

Grasshopper.GUI.Base.GH_SliderGripDisplay.None
No grip is drawn.

Grasshopper.GUI.Base.GH_SliderGripDisplay.Numeric
A single box containing the slider value is drawn.

Grasshopper.GUI.Base.GH_SliderGripDisplay.Shape
A constant shape grip is drawn (round for floating point, diamond for integers)

Grasshopper.GUI.Base.GH_SliderGripDisplay.ShapeAndText
Same as Shape, but text with the slider value is drawn besides the grip.