Grasshopper.Kernel.GH_ConnectivityDiagram
Represents a complete connectivity diagram (topology) of a GH_Document.
A connectivity diagram is basically an undirected network of all the wires in a document.

Grasshopper.Kernel.GH_ConnectivityDiagram.#ctor(Grasshopper.Kernel.GH_Document)
Create a new Connectivity Diagram from a GH_Document.
doc: Document to examine.

Grasshopper.Kernel.GH_ConnectivityDiagram.#ctor(Grasshopper.Kernel.GH_ConnectivityDiagram)
Create a duplicate of another Connectivity Diagram.
other: Diagram to copy.

Grasshopper.Kernel.GH_ConnectivityDiagram.Nodes
Gets a proxy for all the Nodes in this diagram.

Grasshopper.Kernel.GH_ConnectivityDiagram.NodeCount
Gets the number of connectivity nodes in this diagram.

Grasshopper.Kernel.GH_ConnectivityDiagram.Node(System.Guid)
Get the connectivity node with the specified ID.
id: ID of node to search for.
Returns: The node on success or null on failure.

Grasshopper.Kernel.GH_ConnectivityDiagram.ContainsID(System.Guid)
Test the diagram for a given Node ID.
id: ID to search for.
Returns: True if the ID is part of this diagram, false if otherwise.

Grasshopper.Kernel.GH_ConnectivityDiagram.GetAllInputs(System.Guid)
Get all the Nodes that are part of the specified node input.
id: ID of node to query.
Returns: A list of input nodes.

Grasshopper.Kernel.GH_ConnectivityDiagram.GetAllOutputs(System.Guid)
Get all the Nodes that are part of the specified node output.
id: ID of node to query.
Returns: A list of output nodes.