Grasshopper.GUI.GH_MenuShortcutEventArgs
Arguments used in the AggregateShortcutMenuItems event.

Grasshopper.GUI.GH_MenuShortcutEventArgs.AppendItem(System.Windows.Forms.ToolStripMenuItem)
Use this method to append your own custom items.
item: Menu item to append.

Grasshopper.GUI.GH_MenuShortcutEventArgs.Owner
Gets the document editor that spawned this event.

Grasshopper.GUI.GH_MenuShortcutEventArgs.MainMenu
Gets the main menu of the document editor that spawned this event.