Grasshopper.Kernel.Types.GH_Time
Represents a date and time. GH_Time re-implements the framework System.DateTime type.

Grasshopper.Kernel.Types.GH_Time.#ctor
Blank constructor

Grasshopper.Kernel.Types.GH_Time.IsValid
Gets the validity of this instance. Datetime is valid if it's not equal to DateTime.MaxValue

Grasshopper.Kernel.Types.GH_Time.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.