Grasshopper.GUI.GH_NumericTextBox
Utility control that improves upon the standard windows numeric text box.

Grasshopper.GUI.GH_NumericTextBox.Suffix
Gets or sets the suffix used during formatting.

Grasshopper.GUI.GH_NumericTextBox.Prefix
Gets or sets the prefix used during formatting.

Grasshopper.GUI.GH_NumericTextBox.Value
Gets or sets the current value. The value will be limited to the domain.
You should set the domain first, or use the Set() function to set all values at once.

Grasshopper.GUI.GH_NumericTextBox.LowerLimit
Gets or sets the lower limit of the scroll.
Adjusting the lower limit will adjust the Value, but not the upper limit.

Grasshopper.GUI.GH_NumericTextBox.UpperLimit
Gets or sets the upper limit of the scroll.
Adjusting the upper limit will adjust the Value, but not the lower limit.

Grasshopper.GUI.GH_NumericTextBox.Set(System.Double,System.Double,System.Double)
Sets limits and value.
l_limit: Lower limit, if l_limit is larger than u_limit, l_limit will become the upper limit.
u_limit: Upper limit, if u_limit is smaller than l_limit, u_limit will become the lower limit.
v_value: Value, the value will be limited to both limits

Grasshopper.GUI.GH_NumericTextBox.Decimals
Gets or sets the number of decimals displayed in the scroller.

Grasshopper.GUI.GH_NumericTextBox.ScrollWidth
Gets or sets the width of the scroller button.

Grasshopper.GUI.GH_NumericTextBox.ScrollIncrement
Gets or sets the scroll increment. The increment is used when clicking on the scroll button.
Also, when the button is in scroll mode, the increment controls the change per vertical pixel.

Grasshopper.GUI.GH_NumericTextBox.ScrollDamping
Gets or sets the damping factor of the scroller. By default, each vertical
pixel alters the value by increment. Damping allows you to slow the effect of a single pixel.