Grasshopper.GUI.Gradient.GH_GradientChangedEventArgs
Arguments for te GradientChanged event.

Grasshopper.GUI.Gradient.GH_GradientChangedEventArgs.Gradient
Gets the gradient that raised this event.

Grasshopper.GUI.Gradient.GH_GradientChangedEventArgs.Intermediate
Gets whether this event is intermediate. I.e. whether it will be
followed by another, similar event.