Grasshopper.GUI.GH_CreateStateDialog
Dialog used to save document states.

Grasshopper.GUI.GH_CreateStateDialog.AddAllDocumentObjects(Grasshopper.Kernel.GH_Document)
Include all IGH_StateAware objects in the document in this dialog and automatically
set inclusion flags for selected objects.