Grasshopper.GUI.Canvas.IGH_CanvasValidator
'Interface used for limiting a collection of typical actions on the canvas.
Do not implement this interface directly if you can help it, instead inherit from GH_CanvasValidator.

Grasshopper.GUI.Canvas.IGH_CanvasValidator.AddedToCanvas(Grasshopper.GUI.Canvas.GH_Canvas)
This method will be called by the Canvas when this validator is added to it.
canvas: Canvas which just added this validator.

Grasshopper.GUI.Canvas.IGH_CanvasValidator.RemovedFromCanvas(Grasshopper.GUI.Canvas.GH_Canvas)
This method will be called by the Canvas when this validator is removed from it.
canvas: Canvas which just removed this validator.

Grasshopper.GUI.Canvas.IGH_CanvasValidator.AppliesToDocument(System.Guid)
Test whether this validator applies to a specific document.
id: Document id or Guid.Empty if no document is available.

Grasshopper.GUI.Canvas.IGH_CanvasValidator.CanAcceptObject(System.Guid)
Validates whether a specific component can be accepted by the canvas at all.

Grasshopper.GUI.Canvas.IGH_CanvasValidator.CanCreateObject(System.Guid,System.Drawing.PointF)
Validates whether a specific component may be inserted at a specific point.

Grasshopper.GUI.Canvas.IGH_CanvasValidator.CanCreateWire(Grasshopper.Kernel.IGH_Param,Grasshopper.Kernel.IGH_Param)
Validates whether a wire-operation can commence.

Grasshopper.GUI.Canvas.IGH_CanvasValidator.CanDeleteWire(Grasshopper.Kernel.IGH_Param,Grasshopper.Kernel.IGH_Param)
Validates whether a wire can be deleted.

Grasshopper.GUI.Canvas.IGH_CanvasValidator.CanDeleteObject(Grasshopper.Kernel.IGH_DocumentObject)
Validates whether a specific object can be deleted.

Grasshopper.GUI.Canvas.IGH_CanvasValidator.CanDragObject(Grasshopper.Kernel.IGH_DocumentObject,System.Drawing.PointF)
Validates whether some components can be dragged.

Grasshopper.GUI.Canvas.IGH_CanvasValidator.CanShowComponentSearchBox(System.Drawing.PointF)
Validates whether the double-click-component-search-window is allowed to pop up at a specific point.

Grasshopper.GUI.Canvas.IGH_CanvasValidator.CanShowCanvasMenu(System.Drawing.PointF)
Validates whether the canvas menus (both the radial and the old-fashioned one) are allowed to pop up at a specific point.

Grasshopper.GUI.Canvas.IGH_CanvasValidator.CanShowObjectMenu(Grasshopper.Kernel.IGH_DocumentObject)
Validates whether the object menu can be shown.

Grasshopper.GUI.Canvas.IGH_CanvasValidator.CanNavigateCanvas
Validates whether the canvas can be navigated (panning, zooming etc)