Grasshopper.Kernel.Undo.GH_ArchivedUndoAction
Base class implementation for undo actions that require (de)serialization of data.

Grasshopper.Kernel.Undo.GH_ArchivedUndoAction.m_data
Internal data storage for serialized archives.

Grasshopper.Kernel.Undo.GH_ArchivedUndoAction.Deserialize(GH_IO.GH_ISerializable)
Deserializes the obj from the local archive.
Throws System.ArgumentNullException: Thrown when obj is a null reference.
Throws System.NullReferenceException: Thrown when the internal archive data is null.
Throws System.IO.IOException: Thrown when the deserialization fails.

Grasshopper.Kernel.Undo.GH_ArchivedUndoAction.Serialize(GH_IO.GH_ISerializable)
Serializes the obj into the local archive.
obj: Object to serialize

Grasshopper.Kernel.Undo.GH_ArchivedUndoAction.SerializeToByteArray(GH_IO.GH_ISerializable)
Serializes the obj into the local archive.
obj: Object to serialize