Grasshopper.Kernel.Types.GH_Material.MaterialType
Enumerates the possible material types.

Grasshopper.Kernel.Types.GH_Material.MaterialType.Shader
Display shader, very basic colour information, nothing more.

Grasshopper.Kernel.Types.GH_Material.MaterialType.RhinoMaterial
A material from the Rhino document, identified by ID.

Grasshopper.Kernel.Types.GH_Material.MaterialType.XmlMaterial
A material defined by an RDK Xml string.

Grasshopper.Kernel.Types.GH_Material.MaterialType.RmtlMaterial
A material loaded from an RMTL file.