Grasshopper.Rhinoceros.Display.DisplayColorStop
Represents a gradient colour stop. Wraps the functionality of the Rhino.Display.ColorStop type.

Grasshopper.Rhinoceros.Display.DisplayColorStop.#ctor
Blank constructor

Grasshopper.Rhinoceros.Display.DisplayColorStop.IsValid
Gets the validity of this instance.

Grasshopper.Rhinoceros.Display.DisplayColorStop.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Rhinoceros.Display.DisplayColorStop.QC_Type


Grasshopper.Rhinoceros.Display.DisplayColorStop.QC_Hash


Grasshopper.Rhinoceros.Display.DisplayColorStop.QC_Distance(Grasshopper.Kernel.Types.IGH_QuickCast)


Grasshopper.Rhinoceros.Display.DisplayColorStop.QC_Bool


Grasshopper.Rhinoceros.Display.DisplayColorStop.QC_Complex


Grasshopper.Rhinoceros.Display.DisplayColorStop.QC_Matrix


Grasshopper.Rhinoceros.Display.DisplayColorStop.QC_Int


Grasshopper.Rhinoceros.Display.DisplayColorStop.QC_Num


Grasshopper.Rhinoceros.Display.DisplayColorStop.QC_Text


Grasshopper.Rhinoceros.Display.DisplayColorStop.QC_Pt


Grasshopper.Rhinoceros.Display.DisplayColorStop.QC_Vec


Grasshopper.Rhinoceros.Display.DisplayColorStop.QC_Col


Grasshopper.Rhinoceros.Display.DisplayColorStop.QC_Interval


Grasshopper.Rhinoceros.Display.DisplayColorStop.QC_CompareTo(Grasshopper.Kernel.Types.IGH_QuickCast)
