Grasshopper.Kernel.Types.GH_Surface
Represents a 3D (trimmed) surface. GH_Surface wraps the functionality of the OpenNURBS OnBrepFace class.

Grasshopper.Kernel.Types.GH_Surface.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.