Grasshopper.GUI.GH_ToolstripItemKeyHandlerResult
Enumerates the possible responses a IGH_ToolstripItemKeyHandler control have have to a keypress.

Grasshopper.GUI.GH_ToolstripItemKeyHandlerResult.Ignored
Control did not handle the key-press, revert to default behaviour.

Grasshopper.GUI.GH_ToolstripItemKeyHandlerResult.CloseMenu
Control handled the keypress and requests that the menu close down.

Grasshopper.GUI.GH_ToolstripItemKeyHandlerResult.MaintainMenu
Control handled the keypress and requests that the menu remains on screen.