Grasshopper.Kernel.Data.GH_GraphicBranch


Grasshopper.Kernel.Data.GH_GraphicBranch.Path
Gets or sets the data tree path of this branch

Grasshopper.Kernel.Data.GH_GraphicBranch.Data
Gets or sets the data contained in this branch.

Grasshopper.Kernel.Data.GH_GraphicBranch.IsEmpty
A branch is considered to be empty if it contains no data items.

Grasshopper.Kernel.Data.GH_GraphicBranch.Offset
Gets or sets the distance factor from the start of the branch to the graph origin.

Grasshopper.Kernel.Data.GH_GraphicBranch.Length
Gets or sets the Length factor of this branch.

Grasshopper.Kernel.Data.GH_GraphicBranch.Angle
Gets or sets the angle (in radians, counter-clock wise from the world x-axis) of this branch.

Grasshopper.Kernel.Data.GH_GraphicBranch.Selected
Gets or sets a value that represents the selected state of this branch.
Setting this value does not affect child branches.

Grasshopper.Kernel.Data.GH_GraphicBranch.SelectAll(System.Boolean)
Select or deselect this branch and all child branches.
bSelect: True to select, False to deselect

Grasshopper.Kernel.Data.GH_GraphicBranch.SelectAll(Grasshopper.Kernel.Data.GH_Path)
Select or deselect all branches that start with a given path.
b_path: Path start to select

Grasshopper.Kernel.Data.GH_GraphicBranch.Parent
Gets or sets the parent of this branch

Grasshopper.Kernel.Data.GH_GraphicBranch.Twigs
Gets or set the twigs (sub branches) of this branch.
If you're setting twigs, consider using the specialized functions instead.

Grasshopper.Kernel.Data.GH_GraphicBranch.IsRoot
A branch is considered to be a root if it lacks a parent.

Grasshopper.Kernel.Data.GH_GraphicBranch.IsLeaf
A branch is considered to be a lead if it lacks twigs.

Grasshopper.Kernel.Data.GH_GraphicBranch.LongestPathLength
Find the longest path in this subtree. This property is forwards recursive,
meaning children will be measures, but siblings are ignored.

Grasshopper.Kernel.Data.GH_GraphicBranch.GrowTree(System.Collections.Generic.List{Grasshopper.Kernel.Data.GH_Path})
Recursively grow a tree that contains all the given paths.
This branch will become a new Root.
paths: Paths to include

Grasshopper.Kernel.Data.GH_GraphicBranch.SolveLeafAngles(System.Single,System.Single,System.Single,Grasshopper.Kernel.Data.GH_GraphicTreeDisplayArgs)
Collects all leafs in this tree and distributes them equally inside an angle domain.
angle: Main growth direction of tree (in radians).
spread: Allowed spread of tree (in radians).
angle_per_item: Maximum angle per item in radians.
This results in a more friedly layout of sparse trees.
args: Display arguments to work with.

Grasshopper.Kernel.Data.GH_GraphicBranch.Distribute_Phylogenetic(System.Double)
Distribute this branch and all subbranches based on an inward solving algorithm.
This distribution results in a standard phylogenetic tree layout. Before this function
is called it is important that all Leaf branches already have a correct angle.
max_path_length_inverse: The inverse of the tree longest path length:
1.0 / MaxPathLength