Grasshopper.GUI.Canvas.IGH_ResponsiveObject
If you wish to participate in Canvas UI events, you must implement this interface.

Grasshopper.GUI.Canvas.IGH_ResponsiveObject.RespondToMouseMove(Grasshopper.GUI.Canvas.GH_Canvas,Grasshopper.GUI.GH_CanvasMouseEvent)
This function will be called when the mouse moves across the canvas.
If you are active, you will be the only object who gets called. If you are inactive,
you might get called if nobody on top of you decides to become active.
sender: Base canvas.
e: Mouse event arguments.
Returns: All Response flags are valid.

Grasshopper.GUI.Canvas.IGH_ResponsiveObject.RespondToMouseDown(Grasshopper.GUI.Canvas.GH_Canvas,Grasshopper.GUI.GH_CanvasMouseEvent)
This function will be called whenever a mouse button is pressed over the canvas.
If you are active, you will be the only object who gets called. If you are inactive,
you might get called if nobody on top of you decides to become active.
sender: Base canvas.
e: Mouse event arguments.
Returns: All Response flags are valid.

Grasshopper.GUI.Canvas.IGH_ResponsiveObject.RespondToMouseUp(Grasshopper.GUI.Canvas.GH_Canvas,Grasshopper.GUI.GH_CanvasMouseEvent)
This function will be called whenever a mouse button is released over the canvas.
If you are active, you will be the only object who gets called. If you are inactive,
you will not be called at all for MouseUp events.
sender: Base canvas.
e: Mouse event arguments.
Returns: All Response flags are valid.

Grasshopper.GUI.Canvas.IGH_ResponsiveObject.RespondToMouseDoubleClick(Grasshopper.GUI.Canvas.GH_Canvas,Grasshopper.GUI.GH_CanvasMouseEvent)
This function will be called whenever the left button is double-clicked over the canvas.
If you are active, you will be the only object who gets called.
sender: Base canvas.
e: Mouse event arguments.
Returns: All Response flags are valid.