Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine
Provides basic Render methods for capsule display.
You typically don't need this class, just use the Render()
overloads on GH_Capsule directly.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.InnerContourPen(System.Single)
Create a gradient from white to transparent white for the edge pen.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.RenderGrips(System.Drawing.Graphics)
Render all the grips associates with the capsule.
Grips are not drawn if the zoom level is less than 50%.
This is usually the first stage in a Capsule rendering.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.RenderGrips_Alternative(System.Drawing.Graphics)
Render all the grips associates with the capsule as semi-circles.
This is needed if the capsule background is not fully opaque.
Grips are not drawn if the zoom level is less than 50%.
This is usually the first stage in a Capsule rendering.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.RenderAlphaFill(System.Drawing.Graphics)
Render a standard transparancy background hatch.
This is only needed when the capsule background colour is not fully opaque.
This is usually the second stage in a capsule rendering, right after the Grips are drawn.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.RenderBackground(System.Drawing.Graphics,System.Single,Grasshopper.GUI.Canvas.GH_PaletteStyle)
Render a default capsule background fill. This is usually the third stage in a capsule rendering.
G: Graphics object to draw with.
zoom: Zoom of graphics object.
style: Final style to draw with.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.RenderBackground_Alternative(System.Drawing.Graphics,System.Drawing.Color,System.Boolean)
Render a custom capsule background fill. This is usually the third stage in a capsule rendering.
G: Graphics object to draw with.
colourOverride: Custom background colour.
drawAlphaGrid: If true, and the background colour is not opaque,
an alpha grid will be drawn as well.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.RenderHighlight(System.Drawing.Graphics)
Render a highlight bar. This is highly zoom-dependant.
Highlight rendering is usually the fourth stage in a Capsule Rendering,
after the background but prior to the edges.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.RenderOutlines(System.Drawing.Graphics,System.Single,Grasshopper.GUI.Canvas.GH_PaletteStyle)
Render default capsule outlines.
If the zoom factor is less than 50% the inner outline is not drawn.
This is usually the fifth stage in a Capsule rendering.
G: Graphics object to draw with.
zoom: Zoom level of graphics object.
style: Palette style that defines edge properties.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.RenderText(System.Drawing.Graphics,System.Drawing.Color)
Render the capsule text.
This is usually the sixth and final stage in a capsule rendering.
G: Graphics object to draw with.
colour: Colour of text.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.RenderIcon(System.Drawing.Graphics,System.Drawing.Image,System.Int32,System.Int32)
Render an image icon centered into the box. If the content box has been defined the icon
will be centered there, otherwise the outline box will be used.
G: Graphics surface to draw onto.
icon: Icon to draw.
offsetX: Additional x-offset (in original pixel units).
offsetY: Additional y-offset (in original pixel units).

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.RenderIcon(System.Drawing.Graphics,System.Drawing.Image,System.Drawing.RectangleF,System.Int32,System.Int32)
Render an image icon centered into the box. If the content box has been defined the icon
will be centered there, otherwise the outline box will be used.
G: Graphics surface to draw onto.
icon: Icon to draw.
box: Box override.
offsetX: Additional x-offset (in original pixel units).
offsetY: Additional y-offset (in original pixel units).

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.RenderBoundaryDots(System.Drawing.Graphics,System.Int32,Grasshopper.GUI.Canvas.GH_PaletteStyle)
Render a collection of boundary dots along the top edge of the capsule.
count: Number of dots to render.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.RenderMessage(System.Drawing.Graphics,System.String,Grasshopper.GUI.Canvas.GH_PaletteStyle)
Render a text message underneath the capsule.
G: Graphics object to draw with.
message: Message to draw.
style: Style to use.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.CreateRoundedRectangle(System.Drawing.Rectangle,System.Int32)
Static (Shared in VB) method for creating rectangles with rounded corners.
dd
rec: Rectangle to fillet. Rectangles smaller than 3 pixels wide/high will be grown.
radius: Radius of corner fillets.
Returns: Graphics path that describes the rounded rectangle.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.CreateRoundedRectangle(System.Drawing.Rectangle,System.Int32,System.Int32,System.Int32,System.Int32)
Static (Shared in VB) method for creating rectangles with rounded corners.
dd
rec: Rectangle to fillet. Rectangles smaller than 3 pixels wide/high will be grown.
R0: Radius of upper left corner. Zero or negative values omit fillets.
R1: Radius of upper right corner. Zero or negative values omit fillets.
R2: Radius of lower right corner. Zero or negative values omit fillets.
R3: Radius of lower left corner. Zero or negative values omit fillets.
Returns: Graphics path that describes the rounded rectangle.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.CreateRoundedRectangle(System.Drawing.RectangleF,System.Single)
Static (Shared in VB) method for creating rectangles with rounded corners.
dd
rec: Rectangle to fillet. Rectangles smaller than 3 pixels wide/high will be grown.
radius: Radius of corner fillets.
Returns: Graphics path that describes the rounded rectangle.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.CreateRoundedRectangle(System.Drawing.RectangleF,System.Single,System.Single,System.Single,System.Single)
Static (Shared in VB) method for creating rectangles with rounded corners.
dd
rec: Rectangle to fillet. Rectangles smaller than 3 pixels wide/high will be grown.
R0: Radius of upper left corner. Zero or negative values omit fillets.
R1: Radius of upper right corner. Zero or negative values omit fillets.
R2: Radius of lower right corner. Zero or negative values omit fillets.
R3: Radius of lower left corner. Zero or negative values omit fillets.
Returns: Graphics path that describes the rounded rectangle.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.CreateJaggedEdgeLeft(System.Drawing.RectangleF)
Create a point array that represents a jagged edge saw tooth.
rec: Rectangle for jagged edge position and size.
Returns: Saw tooth pattern along left side of box (bottom to top).

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.CreateJaggedEdgeRight(System.Drawing.RectangleF)
Create a point array that represents a jagged edge saw tooth.
rec: Rectangle for jagged edge position and size.
Returns: Saw tooth pattern along right side of box (top to bottom).

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.CreateJaggedRectangle(System.Drawing.RectangleF,System.Single,System.Single,System.Single,System.Single,System.Boolean,System.Boolean)
Static (Shared in VB) method for creating rectangles with rounded corners.
dd
rec: Rectangle to fillet. Rectangles smaller than 3 pixels wide/high will be grown.
R0: Radius of upper left corner. Zero or negative values omit fillets.
R1: Radius of upper right corner. Zero or negative values omit fillets.
R2: Radius of lower right corner. Zero or negative values omit fillets.
R3: Radius of lower left corner. Zero or negative values omit fillets.
jaggedLeft: If true, the left edge of the rectangle will be jagged and R0 and R3 will be ignored.
jaggedRight: If true, the right edge of the rectangle will be jagged and R1 and R2 will be ignored.
Returns: Graphics path that describes the rounded rectangle.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.CreateHighlightBar(System.Drawing.Rectangle,System.Int32,System.Int32)
Static (Shared in VB) method for creating Grasshopper Capsule highlight fills.
rec: Rectangle for entire fill.
radius: Corner radius.
size: Highlight fill height.
Returns: Graphics path that describes the highlight fill shape.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.CreateHighlightBar(System.Drawing.Rectangle,System.Int32,System.Int32,System.Boolean,System.Boolean)
Static (Shared in VB) method for creating Grasshopper Capsule highlight fills.
rec: Rectangle for entire fill.
radius: Corner radius.
size: Highlight fill height.
Returns: Graphics path that describes the highlight fill shape.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.CreateHighlightBar(System.Drawing.Rectangle,System.Int32,System.Int32,System.Int32)
Static (Shared in VB) method for creating Grasshopper Capsule highlight fills.
rec: Rectangle for entire fill.
R0: Radius of upper left corner.
R1: Radius of upper right corner.
size: Highlight fill height.
Returns: Graphics path that describes the highlight fill shape.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.CreateHighlightBar(System.Drawing.Rectangle,System.Int32,System.Int32,System.Int32,System.Boolean,System.Boolean)
Static (Shared in VB) method for creating Grasshopper Capsule highlight fills.
rec: Rectangle for entire fill.
R0: Radius of upper left corner.
R1: Radius of upper right corner.
size: Highlight fill height.
Returns: Graphics path that describes the highlight fill shape.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.GetImpliedStyle(Grasshopper.GUI.Canvas.GH_Palette,System.Boolean,System.Boolean,System.Boolean)
Static (Shared in VB) method for solving which palette style is implied by the properties.
palette: Palette hint.
selected: Specifies whether the selected flavour of a palette needs to be returned.
locked: If True, the returned palette style is always Locked.
hidden: If True, the returned palette style is always Hidden.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.GetImpliedStyle(Grasshopper.GUI.Canvas.GH_Palette,Grasshopper.Kernel.IGH_Attributes)
Static (Shared in VB) method for solving which palette style is implied by the properties.
palette: Palette hint.
attributes: Attributes to parse for style details.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.GetImpliedPalette(Grasshopper.Kernel.IGH_ActiveObject)
Static (Shared in VB) method for solving which palette is the default given a specific object's properties.
Default palettes are either GH_Palette.Normal, GH_Palette.Warning or GH_Palette.Error depending on the objects' runtime message level.
obj: Object to evaluate.
Returns: The default palette.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.RenderInputGrip(System.Drawing.Graphics,System.Single,System.Drawing.PointF,System.Boolean)
Static (Shared in VB) method to render a default input grip.
G: Graphics objects to draw with.
zoom: Zoom level of graphics surface.
loc: Location of grip.
full: If true, a complete circular grip will be draw.
If false, a semi-circular grip will be drawn.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.RenderOutputGrip(System.Drawing.Graphics,System.Single,System.Drawing.PointF,System.Boolean)
Static (Shared in VB) method to render a default output grip.
G: Graphics objects to draw with.
zoom: Zoom level of graphics surface.
loc: Location of grip.
full: If true, a complete circular grip will be draw.
If false, a semi-circular grip will be drawn.