Grasshopper.Kernel.GH_MemoryBitmap
Utility class for ultra-fast bitmap sampling and filters.

Grasshopper.Kernel.GH_MemoryBitmap.m_wrap
Wrapmode used in Sampling operations.

Grasshopper.Kernel.GH_MemoryBitmap.m_bitmap
Pointer to original bitmap.
This bitmap is invalid until the Release()
function on this class has been called.

Grasshopper.Kernel.GH_MemoryBitmap.m_block
Copy of the locked bytes.
All filters operate on this array, the Release() function
copies the bytes back into memory and it overwrites the original bitmap.

Grasshopper.Kernel.GH_MemoryBitmap.m_w
Number of horizontal pixels.

Grasshopper.Kernel.GH_MemoryBitmap.m_h
Number of vertical pixels.

Grasshopper.Kernel.GH_MemoryBitmap.m_header
Bitmap header info.

Grasshopper.Kernel.GH_MemoryBitmap.m_pix_siz
Number of bytes used for a single pixel.

Grasshopper.Kernel.GH_MemoryBitmap.m_row_siz
Number of bytes used for an entire row of pixels.
The "stride" contains a padding bytes at the end of each row, even though
none of the supported pixel formats have padding bytes.

Grasshopper.Kernel.GH_MemoryBitmap.m_row_pad
Number of blank bytes at the end of each row. This only happens when
m_width * m_pixel_size is not a multipe of 4, which is never the case
with the pixel formats which are currently supported.

Grasshopper.Kernel.GH_MemoryBitmap.m_offset_a
Offset for alpha channel inside each pixel block.
The alpha channel may not exist if the original image was Format24BppRgb or Format32BppRgb.
In these cases the offset will be negative.

Grasshopper.Kernel.GH_MemoryBitmap.m_offset_r
Offset for red channel inside each pixel block.

Grasshopper.Kernel.GH_MemoryBitmap.m_offset_g
Offset for green channel inside each pixel block.

Grasshopper.Kernel.GH_MemoryBitmap.m_offset_b
Offset for blue channel inside each pixel block.

Grasshopper.Kernel.GH_MemoryBitmap.#ctor(System.Drawing.Bitmap)
Default constructor.
bitmap: Bitmap to operate on. This bitmap will be in an invalid state
until the Release() function has been called.

Grasshopper.Kernel.GH_MemoryBitmap.#ctor(System.Drawing.Bitmap,System.Drawing.Drawing2D.WrapMode)
Constructor with Wrap mode override.
bitmap: Bitmap to operate on. This bitmap will be in an invalid state
until the Release() function has been called.
wrap: Wrap mode to use during sampling.

Grasshopper.Kernel.GH_MemoryBitmap.ToByteArray
Copy all the bytes in the bitmap to a Byte array.
Returns: An array of bytes that is the exact copy of the bitmap memory layout.

Grasshopper.Kernel.GH_MemoryBitmap.FromByteArray(System.Byte[])
Copy a byte-array into the bitmap memory space.
bytes: An array of bytes to copy into memory. Must be the exact same length as the original bitmap size.

Grasshopper.Kernel.GH_MemoryBitmap.Release(System.Boolean)
Release the locked bits. You must call this function when you are done with this GH_MemoryBitmap instance.
includeChanges: If true, changes to the bitmap memory block will be written back into the bitmap.

Grasshopper.Kernel.GH_MemoryBitmap.Width
Gets the width (in pixels) of the local image.

Grasshopper.Kernel.GH_MemoryBitmap.Height
Gets the height (in pixels) of the local image.

Grasshopper.Kernel.GH_MemoryBitmap.SizeOf
Gets the size (in bytes) of the local image.

Grasshopper.Kernel.GH_MemoryBitmap.HasAlphaChannel
Gets a value indicating whether or not the local image has an alpha channel defined.

Grasshopper.Kernel.GH_MemoryBitmap.Remap(System.Int32,System.Int32,System.Int32@,System.Int32@)
Remap a pixel onto the image using the current wrapping mode.
x: The x coordinate of the pixel in infinite space.
y: The y coordinate of the pixel in infinite space.
x_mapped: The remapped x coordinate, or -1 if the mapping is invalid.
y_mapped: The remapped y coordinate, or -1 if the mapping is invalid.

Grasshopper.Kernel.GH_MemoryBitmap.InterpolateSample(System.Double,System.Double,System.Int32@,System.Int32@,System.Double@,System.Int32@,System.Int32@,System.Double@)
Get the neighbouring pixel coordinates and sample parameters based on a floating point sample location.
x: X location of sample point.
y: Y location of sample point.
x0: Pixel index for lesser neighbour.
x1: Pixel index for greater neighbour.
xt: Sample parameter between x0 and x1.
y0: Pixel index for lesser neighbour.
y1: Pixel index for greater neighbour.
yt: Sample parameter between y0 and y1.

Grasshopper.Kernel.GH_MemoryBitmap.Sample(System.Int32,System.Int32,System.Drawing.Color@)
Top level sampling function.
x: Unmapped x pixel coordinate.
y: Unmapped y pixel coordinate.
col: Colour output.
Returns: True on success, false if pixels could not be sampled.

Grasshopper.Kernel.GH_MemoryBitmap.Sample(System.Double,System.Double,System.Drawing.Color@)
Top level sampling function for interpolated sampling.
x: floating point coordinate in pixel space.
y: floating point coordinate in pixel space.
col: Resulting colour

Grasshopper.Kernel.GH_MemoryBitmap.A(System.Int32,System.Int32)
Gets the alpha channel value at the given pixel coordinates.
x: X coordinate (column) of pixel. Must be on image interior.
y: Y coordinate (column) of pixel. Must be on image interior.
Returns: Value of alpha channel at given pixel or 255 if the alpha channel is not defined.

Grasshopper.Kernel.GH_MemoryBitmap.R(System.Int32,System.Int32)
Gets the red channel value at the given pixel coordinates.
x: X coordinate (column) of pixel. Must be on image interior.
y: Y coordinate (column) of pixel. Must be on image interior.
Returns: Value of Red channel at given pixel.

Grasshopper.Kernel.GH_MemoryBitmap.G(System.Int32,System.Int32)
Gets the greeb channel value at the given pixel coordinates.
x: X coordinate (column) of pixel. Must be on image interior.
y: Y coordinate (column) of pixel. Must be on image interior.
Returns: Value of Green channel at given pixel.

Grasshopper.Kernel.GH_MemoryBitmap.B(System.Int32,System.Int32)
Gets the blue channel value at the given pixel coordinates.
x: X coordinate (column) of pixel. Must be on image interior.
y: Y coordinate (column) of pixel. Must be on image interior.
Returns: Value of Blue channel at given pixel.

Grasshopper.Kernel.GH_MemoryBitmap.Colour(System.Int32,System.Int32)
Gets the colour at the given pixel coordinates.
x: X coordinate (column) of pixel. Must be on image interior.
y: Y coordinate (column) of pixel. Must be on image interior.
Returns: Colour at given pixel.

Grasshopper.Kernel.GH_MemoryBitmap.Colour(System.Int32,System.Int32,System.Drawing.Color)
Sets the colour at the given pixel coordinates.
x: X coordinate (column) of pixel. Must be on image interior.
y: Y coordinate (column) of pixel. Must be on image interior.
col: Color to assign.

Grasshopper.Kernel.GH_MemoryBitmap.OpaqueArea
Find the opaque area of a bitmap. The opaque area is the rectangle that contains pixels
with a colour that is not fully transparent.
Returns: Area of bitmap containing all non-transparent pixels.

Grasshopper.Kernel.GH_MemoryBitmap.ChannelOffset(Grasshopper.Kernel.GH_BitmapChannel)
Convert a pure channel to an offset.

Grasshopper.Kernel.GH_MemoryBitmap.Filter_Blur
Blur the image in both directions.

Grasshopper.Kernel.GH_MemoryBitmap.Filter_Blur(System.Int32,System.Int32)
Blur the image in both directions.
interior_weight: Weighting factor for pixels at the center of the convolution matrix.
exterior_weight: Weighting factor for pixels at the edges of the convolution matrix.

Grasshopper.Kernel.GH_MemoryBitmap.Filter_Blur(System.Int32)
Blur the image N times in both directions.
N: Number of times to perform the blurring operation.

Grasshopper.Kernel.GH_MemoryBitmap.Filter_Blur(System.Int32,System.Int32,System.Int32)
Blur the image N times in both directions.
N: Number of times to perform the blurring operation.
interior_weight: Weighting factor for pixels at the center of the convolution matrix.
exterior_weight: Weighting factor for pixels at the edges of the convolution matrix.

Grasshopper.Kernel.GH_MemoryBitmap.Filter_BlurAlpha(System.Int32,System.Int32,System.Int32)
Blur the alpha channel of the image N times in both directions.
N: Number of times to perform the blurring operation.
interior_weight: Weighting factor for pixels at the center of the convolution matrix.
exterior_weight: Weighting factor for pixels at the edges of the convolution matrix.

Grasshopper.Kernel.GH_MemoryBitmap.CopyChannel(Grasshopper.Kernel.GH_BitmapChannel,Grasshopper.Kernel.GH_BitmapChannel)
Copy the contents of one channel into another.
source: Source channel (compound channels are not allowed).
target: Target channel (compound channels are not allowed).

Grasshopper.Kernel.GH_MemoryBitmap.Filter_GreyScale
Convert the image to a greyscale shadow of its former self.

Grasshopper.Kernel.GH_MemoryBitmap.Filter_GreyScale(System.Double)
Convert the image to a greyscale shadow of its former self.
amount: Greyscale factor. 1.0 equals complete greyscale, 0.0 equals no greyscale, -1.0 equals inverse greyscale

Grasshopper.Kernel.GH_MemoryBitmap.Filter_Tint(System.Drawing.Color,System.Double,System.Double)
Colorize the image using Hue and Saturation from a base colour.
tint: Colour of colorize operation.
lum_factor: Luminance blend factor. 0.0 equals no luminance adjustment, 1.0 equals complete luminance adjustment.
sat_factor: Saturation blend factor. 0.0 equals no saturation adjustment, 1.0 equals complete saturation adjustment.

Grasshopper.Kernel.GH_MemoryBitmap.Filter_HueScale
Convert the image to a greyscale representation of the hues.

Grasshopper.Kernel.GH_MemoryBitmap.Filter_SatScale
Convert the image to a greyscale representation of the saturation.

Grasshopper.Kernel.GH_MemoryBitmap.Filter_LumScale
Convert the image to a greyscale representation of the luminance.

Grasshopper.Kernel.GH_MemoryBitmap.Filter_SpectrumScale
Convert the image to a spectral representation of the hues.

Grasshopper.Kernel.GH_MemoryBitmap.Filter_Equalize(Grasshopper.Kernel.GH_BitmapChannel,System.Byte)
Set all the values in a specific channel to a specific value.
channel: Channel(s) to equalize.
value: Value to equalize with.

Grasshopper.Kernel.GH_MemoryBitmap.Filter_Multiply(Grasshopper.Kernel.GH_BitmapChannel,System.Double)
Multiply all values in a specific channel with a specific factor.
channel: Channel(s) to multiply.
factor: Multiplication factor.

Grasshopper.Kernel.GH_MemoryBitmap.Filter_Multiply(Grasshopper.Kernel.GH_BitmapChannel,System.Double,System.Byte)
Multiply all values in a specific channel with a specific factor,
using a custom scaling center anchor.
channel: Channel(s) to multiply.
factor: Multiplication factor.
anchor: Byte value to scale from.

Grasshopper.Kernel.GH_MemoryBitmap.Filter_Shift(Grasshopper.Kernel.GH_BitmapChannel,System.Byte)
Shift all values in a specific channel with a specific amount.
channel: Channel(s) to shift.
amount: Shift amount.

Grasshopper.Kernel.GH_MemoryBitmap.Filter_Contrast(Grasshopper.Kernel.GH_BitmapChannel,System.Double)
Adjust the contrast of a specific channel.
channel: Channel(s) to modify.
factor: Contrast boost factor. A factor of 1.0 will not affect contrast.
Lower values will lessen contrast and higher values will increase contrast.

Grasshopper.Kernel.GH_MemoryBitmap.Filter_Invert(Grasshopper.Kernel.GH_BitmapChannel)
Invert all values in a specific channel.
channel: Channel(s) to invert.

Grasshopper.Kernel.GH_MemoryBitmap.Filter_Dullify
Reduces contrast based on opacity. This filter pulls all colours towards dull grey, without wrecking drop-shadows.

Grasshopper.Kernel.GH_MemoryBitmap.Filter_DropShadow(System.Drawing.Size,System.Int32,System.Double)
Add a drop-shadow to the image. Image is not grown, so if you want the drop shadow to extend
beyond the image boundaries, you have to add padding to the image first.
offset: Number of pixels (x and y) to offset the drop shadow.
blur: Amount of blurring for the shadow.
darkness: Darkness factor for the shadow.

Grasshopper.Kernel.GH_MemoryBitmap.Filter_AlphaEdges(System.Windows.Forms.Padding,System.Byte)
Set the alpha component on all edges to a specific value.
padding: Width of alpha band along all edges. Must be a valid padding construct.
alpha_override: Value of alpha to apply.

Grasshopper.Kernel.GH_MemoryBitmap.Filter_DitherPattern(System.Drawing.Color)
Create a checkerboard dither pattern.
colour: Colour value to set at dithered pixels.

Grasshopper.Kernel.GH_MemoryBitmap.PadBitmap(System.Drawing.Image,System.Windows.Forms.Padding,System.Drawing.Color)
Add padding edges around a bitmap.
bmp: Source bitmap.
padding: Padding to apply.
padding_color: Color of padded edges.
Returns: A new bitmap with padded edges and the same PixelFormat as the original bitmap.

Grasshopper.Kernel.GH_MemoryBitmap.ShrinkBitmap(System.Drawing.Bitmap)
Shrink an image by removing all outer columns and rows that contain only fully transparent pixels.
image: Image to shrink.
Returns: Shrunk bitmap.