Grasshopper.Kernel.Types.GH_Material
Represents a implementation of the Rhino material

Grasshopper.Kernel.Types.GH_Material.#ctor(System.Guid)
Create a new Material from an RDK material ID.
rdkId: ID of RDK material.

Grasshopper.Kernel.Types.GH_Material.#ctor(System.String)
Create a new Material from an RDK xml string.
rdkXml: Xml of RDK material.

Grasshopper.Kernel.Types.GH_Material.#ctor(System.Drawing.Color)
Create a new material based on a colour. The colour is used
to control Diffuse, Emission and Transparency. Ambient, Specular and Shine
are always default.
diffuse: The diffuse colour of the material.

Grasshopper.Kernel.Types.GH_Material.#ctor(Rhino.Display.DisplayMaterial)
Create a new Material.
material: Material to use (an internal copy will be made).

Grasshopper.Kernel.Types.GH_Material.#ctor(Rhino.Render.RenderMaterial)
Create a new Material.
material: Material to use (an internal copy will be made).

Grasshopper.Kernel.Types.GH_Material.#ctor(Grasshopper.Kernel.Types.GH_Material)
Copy another GH_Material instance.
other: Material to mimic.

Grasshopper.Kernel.Types.GH_Material.Duplicate
Duplicate this material.
Returns: An exact duplicate of this material.

Grasshopper.Kernel.Types.GH_Material.DuplicateMaterial
Duplicate this material.
Returns: An exact duplicate of this material.

Grasshopper.Kernel.Types.GH_Material.CreateStandardMaterial(System.Drawing.Color)
Creates a standard Grasshopper material from a colour.
colour: Base colour for material.

Grasshopper.Kernel.Types.GH_Material.CreateRhinoMaterial(System.Drawing.Color)
Creates a standard Rhino material from a colour.
colour: Base colour for material.

Grasshopper.Kernel.Types.GH_Material.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Kernel.Types.GH_Material.Type
Gets the implied type based on what fields have been assigned.
Returns:

Grasshopper.Kernel.Types.GH_Material.RdkMaterialId
Gets or sets the RDK material ID this material is associated with.

Grasshopper.Kernel.Types.GH_Material.RdkMaterialXml
Gets or sets the RDK material Xml string.

Grasshopper.Kernel.Types.GH_Material.RdkMaterialRmtl
Gets or sets the RDK material RMTL file path.

Grasshopper.Kernel.Types.GH_Material.MaterialBestGuess
Gets the best guess RenderMaterial for this shader.
Returns: Material which best describes this shader.

Grasshopper.Kernel.Types.GH_Material.SetFromColour(System.Drawing.Color)
Set this material based on a single colour.
col:

Grasshopper.Kernel.Types.GH_Material.SetFromRdkName(System.String)
Set the fields of this material using an RDK RenderMaterial name from the current document.
name: Name of material.
Returns: Nothing on success, or an reason for failure.

Grasshopper.Kernel.Types.GH_Material.SetFromRdkId(System.Guid)
Set the fields of this material using an RDK RenderMaterial from the current document.
id: Id.
Returns: Nothing on success, or an reason for failure.

Grasshopper.Kernel.Types.GH_Material.SetFromRdkXml(System.String)
Set the fields of this material using an RDK Xml string.
xml: Xml.
Returns: Nothing on success, or an reason for failure.

Grasshopper.Kernel.Types.GH_Material.SetFromRdkMaterial(Rhino.Render.RenderMaterial)
Set the fields of this material using an RDK RenderMaterial.
material: Material.
Returns: Nothing on success, or an reason for failure.

Grasshopper.Kernel.Types.GH_Material.SetFromRmtlFile(System.String)
Set the fields of this material from an RMTL file.
file:
Returns: