Grasshopper.Kernel.Types.GH_Plane
Represents a 3D plane. GH_Plane re-implements the OpenNURBS OnPlane class.

Grasshopper.Kernel.Types.GH_Plane.#ctor
Default constructor. Creates a world XY plane.

Grasshopper.Kernel.Types.GH_Plane.#ctor(Rhino.Geometry.Plane)
Create a duplicate of another plane.
plane: Plane to set.

Grasshopper.Kernel.Types.GH_Plane.#ctor(Grasshopper.Kernel.Types.GH_Plane)
Create a duplicate of another plane.
other: Plane to copy. If null, a default plane will be created.

Grasshopper.Kernel.Types.GH_Plane.DuplicateGeometry
Create a duplicate of this plane.

Grasshopper.Kernel.Types.GH_Plane.DuplicatePlane
Create a duplicate of this plane.

Grasshopper.Kernel.Types.GH_Plane.IsValid
Gets the validity of the plane. If the plane is invalid, attempts are made to fix the data.
If the plane remains invalid, False is returned.

Grasshopper.Kernel.Types.GH_Plane.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Kernel.Types.GH_Plane.ToString
Format the plane using default grasshopper formatting logic.

Grasshopper.Kernel.Types.GH_Plane.CastFrom(System.Object)
Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_Plane.CastTo``1(``0@)
Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_Plane.DrawPlane(Rhino.Display.DisplayPipeline,Rhino.Geometry.Plane)
Draw a plane with default colours and default size.

Grasshopper.Kernel.Types.GH_Plane.EmitProxy
Returns a proxy that represents this plane. Do not call this function unless you're