Grasshopper.Kernel.Special.GH_Cluster.HookTargetMap.Clear
Remove all mappings.

Grasshopper.Kernel.Special.GH_Cluster.HookTargetMap.AddMapping(System.Guid,System.Guid)
Add a new hook|target mapping.

Grasshopper.Kernel.Special.GH_Cluster.HookTargetMap.AddMapping(Grasshopper.Kernel.IGH_Param,Grasshopper.Kernel.IGH_Param)
Add a new hook|target mapping.

Grasshopper.Kernel.Special.GH_Cluster.HookTargetMap.RemoveMapping(System.Guid)
Remove all mappings concerning a specific hook.

Grasshopper.Kernel.Special.GH_Cluster.HookTargetMap.RemoveMapping(Grasshopper.Kernel.IGH_Param)
Remove all mappings concerning a specific hook.

Grasshopper.Kernel.Special.GH_Cluster.HookTargetMap.RemoveMapping(System.Guid,System.Guid)
Remove a specific mapping.

Grasshopper.Kernel.Special.GH_Cluster.HookTargetMap.RemoveMapping(Grasshopper.Kernel.IGH_Param,Grasshopper.Kernel.IGH_Param)
Remove a specific mapping.

Grasshopper.Kernel.Special.GH_Cluster.HookTargetMap.Targets(System.Guid)
Gets all targets associated with a specific hook.

Grasshopper.Kernel.Special.GH_Cluster.HookTargetMap.Targets(Grasshopper.Kernel.IGH_Param)
Gets all targets associated with a specific hook.