Grasshopper.GUI.StringDisplay.GH_StringList`1
Represents a collection of String List Items.
Some implementation of IGH_StringListItem.

Grasshopper.GUI.StringDisplay.GH_StringList`1.AppendItem(`0)
Add a new list item.
item: Item to add, cannot be null.

Grasshopper.GUI.StringDisplay.GH_StringList`1.AppendItems(System.Collections.Generic.IEnumerable{`0})
Add a range of items.
items: Items to add, none of the items can be null.

Grasshopper.GUI.StringDisplay.GH_StringList`1.ListItem(System.Int32)
Get the list item at the specified index.
i: Index of item to retrieve.

Grasshopper.GUI.StringDisplay.GH_StringList`1.BoundingBox
Gets the cached boundingbox for this list.
This box won't be valid until BuildCache() is called.

Grasshopper.GUI.StringDisplay.GH_StringList`1.Count
Gets the total number of items contained in this list.

Grasshopper.GUI.StringDisplay.GH_StringList`1.Capacity
Gets or sets the total capacity of this list.

Grasshopper.GUI.StringDisplay.GH_StringList`1.IsCached
Gets a value indicating whether the cached boundingbox is valid.

Grasshopper.GUI.StringDisplay.GH_StringList`1.StackAlignment
Gets or sets the alignment of the entire stack. This alignment
only comes into play when all the items fit within the drawing destination.

Grasshopper.GUI.StringDisplay.GH_StringList`1.ClearItems
Removes all items from the list and expires the caches.

Grasshopper.GUI.StringDisplay.GH_StringList`1.BuildCache(System.Drawing.Rectangle)
Measures all the items in the collection using the specified formatting domain and font.
layoutBox: The destination of the text. Only the width is used.