Grasshopper.Kernel.Geometry.GH_Segment.OffsetSamples(System.Double)
Compute a collection of offset samples for this segment. If the segment is linear or circular, only two samples will be returned.
distance: Offset distance.
Returns: A bunch of offset samples.

Grasshopper.Kernel.Geometry.GH_Segment.OffsetCurve(System.Double)
Compute an offset curve.
distance: Offset distance.
Returns: Offset result or null on failure.

Grasshopper.Kernel.Geometry.GH_Segment.IsCurveParallel(Rhino.Geometry.Curve,Rhino.Geometry.Curve)
Tests the curve tangent of c0 against the tangent at the closest point on c1.
c0: Curve to test.
c1: Guide curve.
Returns: True if c0 is roughly parallel to c1.