Grasshopper.Kernel.IGH_Component
Base interface for all GH_Component types.
Do not implement this interface from scratch, inherit from GH_Component instead.

Grasshopper.Kernel.IGH_Component.InConstructor
Gets the constructor flag for this instance. If InConstructor = True,
it means the component is still registering parameters and the
layout is not yet complete.

Grasshopper.Kernel.IGH_Component.DataComparison
A data combination flag

Grasshopper.Kernel.IGH_Component.Message
Gets or sets a custom message to be displayed underneath the component.

Grasshopper.Kernel.IGH_Component.Params
Gets the Params object that managed input and output parameters.

Grasshopper.Kernel.IGH_Component.MasterParameterIndex
Gets or sets the master parameter index override.
Negative indices or indices larger than or equal to the input parameter count will
be ignored and regular master parameter detection will kick in.

Grasshopper.Kernel.IGH_Component.IsValidMasterParameterIndex
Gets whether the MasterParameterIndex property identifies a valid parameter.

Grasshopper.Kernel.IGH_Component.RunCount
Gets a value indicating how many times the SolveInstance method was called on this component during the last solution.
This property will return -1 if no valid runcount is available.