Grasshopper.Kernel.Special.GH_ColourWheelStyle
Enumerates all defined palette styles for colour wheels.

Grasshopper.Kernel.Special.GH_ColourWheelStyle.Monochromatic
Represents a single colour range.

Grasshopper.Kernel.Special.GH_ColourWheelStyle.Bichromatic
Represents two disassociated colour ranges.

Grasshopper.Kernel.Special.GH_ColourWheelStyle.Complementary
Represents two opposing colour ranges.

Grasshopper.Kernel.Special.GH_ColourWheelStyle.Trichromatic
Represents three disassociated colour ranges.

Grasshopper.Kernel.Special.GH_ColourWheelStyle.Triad
Represents three opposing colour ranges.

Grasshopper.Kernel.Special.GH_ColourWheelStyle.Tetrachromatic
Represents four disassociated colour ranges.

Grasshopper.Kernel.Special.GH_ColourWheelStyle.Tetrad
Represents four opposing colour ranges.