Grasshopper.GUI.GH_FadeAnimation
Utility class for animating fade ZUI events on the canvas.

Grasshopper.GUI.GH_FadeAnimation.Delay
Gets the number of milliseconds between redraws (25 milliseconds, resulting in ~40 fps)

Grasshopper.GUI.GH_FadeAnimation.#ctor
Creates a new instance of the Animator class with default settings.

Grasshopper.GUI.GH_FadeAnimation.#ctor(System.Single)
Create a new instance of the Animator class with custom values for zoom threshold.
threshold: Zoom threshold at which the animation kicks in. The default is 2.0

Grasshopper.GUI.GH_FadeAnimation.#ctor(System.Single,System.Int32)
Create a new instance of the Animator class with custom values for zoom threshold and duration.
threshold: Zoom threshold at which the animation kicks in. The default is 2.0
duration: The duration (in milliseconds) of the fade animation, the default is 350

Grasshopper.GUI.GH_FadeAnimation.Threshold
Gets or sets the threshold value for the fade animation trigger.

Grasshopper.GUI.GH_FadeAnimation.Duration
Gets or sets the duration (in milliseconds) for ZUI animations.
Negative durations are not allowed. The default is 350 milliseconds.

Grasshopper.GUI.GH_FadeAnimation.Phase
Gets the current animation phase.

Grasshopper.GUI.GH_FadeAnimation.IsFinished
Gets a value indicating whether this animator has finished animating.

Grasshopper.GUI.GH_FadeAnimation.TriggerUpdate
Gets or sets whether this animator triggers canvas updates.

Grasshopper.GUI.GH_FadeAnimation.FadeAlpha
Gets the blend alpha byte for the current state. 0 means fully hidden, 255 means fully shown.

Grasshopper.GUI.GH_FadeAnimation.FadeFactor
Gets the blend factor for the current state.
0.0 means fully hidden, 1.0 means fully shown.

Grasshopper.GUI.GH_FadeAnimation.Evaluate(Grasshopper.GUI.Canvas.GH_Canvas)
Reevaluate the fade animation parameters. You should call this
method from within the Render method of your attributes. If an animation
is currently in progress a redraw of the canvas will be scheduled, whether
or not the attributes are actually visible on the canvas. You should therefore
only call this method if your attributes are already drawing themselves.
canvas: Canvas currently drawing in.

Grasshopper.GUI.GH_FadeAnimation.Evaluate(Grasshopper.GUI.Canvas.GH_Canvas,System.Single)
Reevaluate the fade animation parameters. You should call this
method from within the Render method of your attributes. If an animation
is currently in progress a redraw of the canvas will be scheduled, whether
or not the attributes are actually visible on the canvas. You should therefore
only call this method if your attributes are already drawing themselves.
canvas: Canvas currently drawing in.

Grasshopper.GUI.GH_FadeAnimation.Evaluate(Grasshopper.GUI.Canvas.GH_Canvas,System.Boolean)
Reevaluate the fade animation parameters. You should call this
method from within the Render method of your attributes. If an animation
is currently in progress a redraw of the canvas will be scheduled, whether
or not the attributes are actually visible on the canvas. You should therefore
only call this method if your attributes are already drawing themselves.
canvas: Canvas currently drawing in.
scheduleRedraw: If true and the animator is active, a redraw will be scheduled.

Grasshopper.GUI.GH_FadeAnimation.Evaluate(Grasshopper.GUI.Canvas.GH_Canvas,System.Single,System.Boolean)
Reevaluate the fade animation parameters. You should call this
method from within the Render method of your attributes. If an animation
is currently in progress a redraw of the canvas will be scheduled, whether
or not the attributes are actually visible on the canvas. You should therefore
only call this method if your attributes are already drawing themselves.
canvas: Canvas currently drawing in.
scheduleRedraw: If true and the animator is active, a redraw will be scheduled.

Grasshopper.GUI.GH_FadeAnimation.FadeIn
Low-level method for triggering a fade in animation.

Grasshopper.GUI.GH_FadeAnimation.FadeOut
Low-level method for triggering a fade out animation.