Grasshopper.Kernel.IGH_ActiveObject
Base interface for all objects on the canvas that participate in solutions

Grasshopper.Kernel.IGH_ActiveObject.ClearData
This function is called whenever the object needs to
clear all solution data. This usually amounts to wiping volatile caches and messages.
This function will not affect any other objects, but it will set the Phase flag to
Blank

Grasshopper.Kernel.IGH_ActiveObject.CollectData
This function is called whenever the object is required to collect
all data. Either from Persistent records, from source params or whatever.
This step is only performed if the phase flag is Blank or Failed.
Upon completion, the phase flag will be set to Collected

Grasshopper.Kernel.IGH_ActiveObject.ComputeData
This function is called whenever the object is required to generate new data.
This step is only performed by some objects and only when the Phase flag is Collected.
Upon completion, the Phase will be Computed. If this object throws exceptions,
it is the responsibility of the caller to set the Phase flag to Failed.

Grasshopper.Kernel.IGH_ActiveObject.Phase
Gets the solution phase in which this object is currently stuck.

Grasshopper.Kernel.IGH_ActiveObject.Locked
Gets or sets the locked flag of this object. Locked objects are ignored during solutions.

Grasshopper.Kernel.IGH_ActiveObject.SDKCompliancy(System.Int32,System.Int32)
Test whether this object is compliant with a given Rhino version.
exeVersion: Rhino major release (4, 5, ...).
exeServiceRelease: Rhino minor (service) release.
Returns: True if this object is compliant with the given Rhino release.

Grasshopper.Kernel.IGH_ActiveObject.MutableNickName
Gets or sets a value that enables Nick name changes through the menu.
The default is TRUE.

Grasshopper.Kernel.IGH_ActiveObject.IsDataProvider
Gets whether or not this object is capable of emitting data.

Grasshopper.Kernel.IGH_ActiveObject.DependsOn(Grasshopper.Kernel.IGH_ActiveObject)
Solve the inheritance relationship between this object and a potential parental object.

Grasshopper.Kernel.IGH_ActiveObject.RegisterRemoteIDs(Grasshopper.Kernel.GH_GuidTable)
If this object depends on Rhino Objects, you must register the UUIDs of those objects.
Failure to do so will result in faulty event handling.
id_list: The object ID database Grasshopper is responsive to.

Grasshopper.Kernel.IGH_ActiveObject.ClearRuntimeMessages
Clear all message lists.

Grasshopper.Kernel.IGH_ActiveObject.AddRuntimeMessage(Grasshopper.Kernel.GH_RuntimeMessageLevel,System.String)
Add a new message to this object. Valid message type flags are Warning and Error.
If the Message string is empty or zero-length no message is added.
Type: Type of message. Only Warnings and Errors are recorded.
Message: Content of message.

Grasshopper.Kernel.IGH_ActiveObject.RuntimeMessages(Grasshopper.Kernel.GH_RuntimeMessageLevel)
Gets the list of cached runtime messages that were recorded during solver-time processes.
level: Runtime message type to retrieve.
Returns: A list of runtime message strings.

Grasshopper.Kernel.IGH_ActiveObject.RuntimeMessageLevel
Gets the worst-case level of all messages. I.e. if only warnings have been recorded,
the level will be ::warning. If even a single error exists, the level will be ::error.

Grasshopper.Kernel.IGH_ActiveObject.ProcessorTime
Gets the most recent measured processor time.