Grasshopper.Kernel.Attributes.GH_FloatingParamAttributes
These Attributes are the default for stand-alone Parameters.

Grasshopper.Kernel.Attributes.GH_FloatingParamAttributes.DefaultWidth
Defines the default (and minimum) width of a floating parameter.

Grasshopper.Kernel.Attributes.GH_FloatingParamAttributes.IconHeight
Defines the default height of a floating parameter in Icon display mode.

Grasshopper.Kernel.Attributes.GH_FloatingParamAttributes.TextHeight
Defines the default height of a floating parameter in Text display mode.