Grasshopper.GUI.IGH_SettingFrontend
Represents a single setting in the Settings UI.
Implement this interface to participate in the Grasshopper Settings interface.

Grasshopper.GUI.IGH_SettingFrontend.Category
Category of this setting.

Grasshopper.GUI.IGH_SettingFrontend.Name
Name of this setting.

Grasshopper.GUI.IGH_SettingFrontend.Keywords
Optional keywords for this setting.

Grasshopper.GUI.IGH_SettingFrontend.SettingsUI
Create the winforms UI portion for this setting.