Grasshopper.Kernel.Data.IGH_DataTree
Utility interface for detection of DataTree generic instances.

Grasshopper.Kernel.Data.IGH_DataTree.MergeWithParameter(Grasshopper.Kernel.IGH_Param)
Utility function for assigning Script Data Trees to parameters.
param: Parameter to merge with.