Grasshopper.Kernel.Data.GH_SimplificationMode
Enumerates the possible data structure simplification modes.

Grasshopper.Kernel.Data.GH_SimplificationMode.None
Specifies no simplification is to take place.

Grasshopper.Kernel.Data.GH_SimplificationMode.CollapseLeadingOverlaps
Only overlaps at the leading portion of paths will be simplified.

Grasshopper.Kernel.Data.GH_SimplificationMode.CollapseAllOverlaps
Overlaps along the entire span of the paths will be simplified.