Grasshopper.GUI.IGH_Tooltip
Accessor interface for the Grasshopper Tooltip form.

Grasshopper.GUI.IGH_Tooltip.Icon
Sets the Tooltip Icon image.

Grasshopper.GUI.IGH_Tooltip.Diagram
Sets the tooltip diagram image.
The diagram image is optional and is displayed in the same area
as the ToolTipDescription text.

Grasshopper.GUI.IGH_Tooltip.Title
Gets or sets the tooltip Title.

Grasshopper.GUI.IGH_Tooltip.Text
Gets or sets the tooltip Text.

Grasshopper.GUI.IGH_Tooltip.Description
Gets or sets the tooltip Description.
The Description is optional and is displayed in the same area
as the TooltipDiagram image.

Grasshopper.GUI.IGH_Tooltip.Palette
Gets or sets the tooltip colour palette.