Grasshopper.GUI.MRU.GH_MRU_Entry
Represents a single entry in the MRU server.

Grasshopper.GUI.MRU.GH_MRU_Entry.#ctor(System.DateTime,System.String)
Create a new entry.
new_date: Date of event.
new_path: File path associated with event.

Grasshopper.GUI.MRU.GH_MRU_Entry.FileDate
Gets or sets the Date associated with this event.

Grasshopper.GUI.MRU.GH_MRU_Entry.FilePath
Gets or sets the File path associated with this event.

Grasshopper.GUI.MRU.GH_MRU_Entry.FileName
Gets or sets the File Name associated with this event.
If you do not set the filename, it will be inferred from the FilePath.

Grasshopper.GUI.MRU.GH_MRU_Entry.CompareTo(Grasshopper.GUI.MRU.GH_MRU_Entry)
Compare two MRU Events and sort them by time.