Grasshopper.Kernel.GH_PersistentParam`1
Implementation of GH_Param(Of T) that supports persistent data.
Data type for this parameter.

Grasshopper.Kernel.GH_PersistentParam`1.m_dataPersistent
Local persistent data.

Grasshopper.Kernel.GH_PersistentParam`1.AddPersistentData(System.Object)
Utility function to add a new persistent data item.
If the data is null or cannot be converted into T, this method will fail.
You should probably use the PersistentData property to add type-safe data
if you can.
data: Data to add.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_PersistentParam`1.AddPersistentData(`0)
Utility function to add a new persistent data item.
If the data is null or cannot be converted into T, this method will fail.
You should probably use the PersistentData property to add type-safe data
if you can.
data: Data to add.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_PersistentParam`1.SetPersistentData(System.Object[])
Add a collection of values to the persistent data.
values: Values to add.

Grasshopper.Kernel.GH_PersistentParam`1.SetPersistentData(`0)
Add a single item to the persistent data.
This method will record an undo event, raise the OnObjectChanged event
for PersistentData flags and  place a call to ExpireSolution(False).
If you want to add more than one piece of data, you should use the appropriate overload for this method.
item: Item to add.

Grasshopper.Kernel.GH_PersistentParam`1.SetPersistentData(System.Collections.Generic.IEnumerable{`0})
Assign a list of items to the persistent data.
This method will erase any existing data,
record an undo event,
raise the OnObjectChanged event for PersistentData flags and
place a call to ExpireSolution(False).
If you want to add a tree of data, you should use the appropriate overload for this method.
items: Items to add.

Grasshopper.Kernel.GH_PersistentParam`1.SetPersistentData(Grasshopper.Kernel.Data.GH_Structure{`0})
Assign a tree of items to the persistent data.
This method will erase any existing data,
record an undo event,
raise the OnObjectChanged event for PersistentData flags and
place a call to ExpireSolution(False).
If you want to add a tree of data, you should use the appropriate overload for this method.
items: Items to add.

Grasshopper.Kernel.GH_PersistentParam`1.PersistentData
Gets the persistent data stored in this parameter.
If you modify the persistent data, be sure to call the:
OnObjectChanged(GH_ObjectEventType.PersistentData)
event.

Grasshopper.Kernel.GH_PersistentParam`1.PersistentDataCount
Gets the number of persistent data items stored in this parameter.

Grasshopper.Kernel.GH_PersistentParam`1.Script_ClearPersistentData
Method used primarily for COM_Access code.

Grasshopper.Kernel.GH_PersistentParam`1.Script_AddPersistentData(System.Collections.Generic.List{System.Object})
Method used primarily for COM_Access code.

Grasshopper.Kernel.GH_PersistentParam`1.DataType
Gets the type of data stored in this parameter.

Grasshopper.Kernel.GH_PersistentParam`1.RecordPersistentDataEvent(System.String)
Add an undo record that stores changes to persistent data.
name: Name of undo record.

Grasshopper.Kernel.GH_PersistentParam`1.Menu_CreateMultilineTextEditItem
This function returns a ToolstripMenuItem that embeds a multi-line textbox
for editing persistent data. Only call this method if you know that your
parameter type supports proxies.