Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.PartialSearchResult
Maintains all data necessary to identify a partial search result.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.PartialSearchResult.Distance
Distance (squared) from search locus to this partial result.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.PartialSearchResult.Node
Node containing the partial result.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.PartialSearchResult.LocalIndex
Index in node array for this partial result.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.PartialSearchResult.GlobalIndex
Index in global array for this partial result.