Grasshopper.Kernel.Expressions.GH_Variant
Variant data used in Grasshopper Expressions.

Grasshopper.Kernel.Expressions.GH_Variant.#ctor
Create a new Null variant.

Grasshopper.Kernel.Expressions.GH_Variant.#ctor(System.Boolean)
Create a new Bool variant.
value: Value of Variant.

Grasshopper.Kernel.Expressions.GH_Variant.#ctor(System.Int32)
Create a new Integer variant.
value: Value of Variant.

Grasshopper.Kernel.Expressions.GH_Variant.#ctor(System.Double)
Create a new Double variant.
value: Value of Variant.

Grasshopper.Kernel.Expressions.GH_Variant.#ctor(System.String)
Create a new String variant.
value: Value of Variant.

Grasshopper.Kernel.Expressions.GH_Variant.#ctor(Grasshopper.Kernel.Types.Complex)
Create a new Complex variant.
value: Value of Variant.

Grasshopper.Kernel.Expressions.GH_Variant.#ctor(Rhino.Geometry.Point3d)
Create a new Point variant.
value: Value of Variant.

Grasshopper.Kernel.Expressions.GH_Variant.#ctor(Rhino.Geometry.Vector3d)
Create a new Point variant.
value: Value of Variant.

Grasshopper.Kernel.Expressions.GH_Variant.#ctor(Rhino.Geometry.Plane)
Create a new Plane variant.
value: Value of Variant.

Grasshopper.Kernel.Expressions.GH_Variant.#ctor(Grasshopper.Kernel.Expressions.GH_Variant)
Duplicate a Variant.
other: Variant to duplicate

Grasshopper.Kernel.Expressions.GH_Variant.Duplicate
Duplicate this Variant. If the type of this Variant is [unknown]
the contents are not guaranteed to be duplicated.

Grasshopper.Kernel.Expressions.GH_Variant.IsNumeric
Gets a value indicating whether or not the Variant is a numeric type.
Only Doubles and Integers are considered to be Numeric.

Grasshopper.Kernel.Expressions.GH_Variant.Type
Gets the Type of this Variant.

Grasshopper.Kernel.Expressions.GH_Variant.Data``1
Perform a straight cast of the data inside this Variant.
Returns: The value inside this Variant cast to T.

Grasshopper.Kernel.Expressions.GH_Variant._Bool
Gets the contents of this Variant as a bool.

Grasshopper.Kernel.Expressions.GH_Variant._Int
Gets the contents of this Variant as an integer.

Grasshopper.Kernel.Expressions.GH_Variant._Double
Gets the contents of this Variant as a double.
If the Variant is of type Integer this cast will also work.

Grasshopper.Kernel.Expressions.GH_Variant._String
Gets the contents of this Variant as a String.
This function will work for all Variant types.

Grasshopper.Kernel.Expressions.GH_Variant._Complex
Gets the contents of this Variant as a complex number.

Grasshopper.Kernel.Expressions.GH_Variant._Point
Gets the contents of this Variant as a Point.

Grasshopper.Kernel.Expressions.GH_Variant._Vector
Gets the contents of this Variant as a Vector.

Grasshopper.Kernel.Expressions.GH_Variant._Plane
Gets the contents of this Variant as a Plane.

Grasshopper.Kernel.Expressions.GH_Variant.ToGoo
Attempt to convert a Variant to a Grasshopper IGH_Goo type.
Returns: An instance of a class implementing IGH_Goo or null.

Grasshopper.Kernel.Expressions.GH_Variant.Evaluate
If this variant represents a string, this function will attempt to evaluate that string
and replace the data inside this variant.
Returns: True if the string was evaluated, false if otherwise.