Grasshopper.GUI.RemotePanel.IRcpItem
Implement this interface if you want to be part of a Remote-Control-Panel.

Grasshopper.GUI.RemotePanel.IRcpItem.DesiredHeight
Gets the desired height for this control, based on the current height.

Grasshopper.GUI.RemotePanel.IRcpItem.Bounds
Gets or sets the bounding rectangle for this item.

Grasshopper.GUI.RemotePanel.IRcpItem.OwnerInstanceId
Gets the GUID of the object -if any- which owns this item.
If this item has no owner, then Guid.Empty ought to be returned.

Grasshopper.GUI.RemotePanel.IRcpItem.OnDelete
This method will be called when the RcpItem is removed from the remote panel.

Grasshopper.GUI.RemotePanel.IRcpItem.Render(System.Drawing.Graphics)
Render this item into a graphics context.

Grasshopper.GUI.RemotePanel.IRcpItem.MouseDoubleClick(System.Windows.Forms.MouseEventArgs)
Respond to a mouse double click event.

Grasshopper.GUI.RemotePanel.IRcpItem.MouseClick(System.Windows.Forms.MouseEventArgs)
Respond to a mouse single click event.

Grasshopper.GUI.RemotePanel.IRcpItem.MouseDown(System.Windows.Forms.MouseEventArgs)
Respond to a mouse button down event.

Grasshopper.GUI.RemotePanel.IRcpItem.MouseMove(System.Windows.Forms.MouseEventArgs)
Respond to a mouse move event.

Grasshopper.GUI.RemotePanel.IRcpItem.MouseUp(System.Windows.Forms.MouseEventArgs)
Respond to a mouse button up event.