Grasshopper.Kernel.GH_InstanceDescription
Base implementation of IGH_InstanceDescription. Consider deriving from this class rather than
implementing IGH_InstanceDescription from scratch.

Grasshopper.Kernel.GH_InstanceDescription.#ctor
Create a new blank instance.

Grasshopper.Kernel.GH_InstanceDescription.#ctor(System.String,System.String,System.String,System.String)
Create a new instance. This constructor is maintained for legacy purposes,
use the constructor overload that includes SubCategories!.
name: Name of instance description.
nickName: Nickname of instance description.
description: Descirptive text of instance description.
category: Category of instance description. If you supply a name containing a dot, subcategory will be inferred.

Grasshopper.Kernel.GH_InstanceDescription.#ctor(System.String,System.String,System.String,System.String,System.String)
Create a new instance.
name: Name of instance description.
nickName: Nickname of instance description.
description: Descirptive text of instance description.
category: Category of instance description.
subCategory: Subcategory of the instance description.

Grasshopper.Kernel.GH_InstanceDescription.#ctor(Grasshopper.Kernel.IGH_InstanceDescription)
Duplicate another instance description.
other: Instance description to duplicate

Grasshopper.Kernel.GH_InstanceDescription.SetCategory(System.String,System.Char)
Parses a category string and instantiates the Category and SubCategory fields
CategoryPath: The Compound category string to parse
Delimiter: Optional delimiter symbol
Remarks: Only reads the first two parts. If the Delimiter char occurs more than once, everything after the second char is ignored

Grasshopper.Kernel.GH_InstanceDescription.CopyFrom(Grasshopper.Kernel.IGH_InstanceDescription)
Copy all fields (except the instance ID) from another instance description.
other: Object to mimic.

Grasshopper.Kernel.GH_InstanceDescription.Name
Gets or sets the name of the object. This field typically remains fixed during the lifetime of an object.

Grasshopper.Kernel.GH_InstanceDescription.NickName
Gets or sets the nickname of the object. This field can be changed by the user.

Grasshopper.Kernel.GH_InstanceDescription.Description
Gets or sets the description of the object. This field typically remains fixed during the lifetime of an object.

Grasshopper.Kernel.GH_InstanceDescription.InstanceDescription
Gets a description of the current state of the object.
This field is usually the same as the Description() field, but it might be variable when overridden.

Grasshopper.Kernel.GH_InstanceDescription.Keywords
Gets a list of additional keywords that describe the object. Typically this list is empty but you
can override this property to aid in object searches.

Grasshopper.Kernel.GH_InstanceDescription.Category
Gets or sets the Category in which this object belongs. If HasCategory() returns false, this field has no meaning.

Grasshopper.Kernel.GH_InstanceDescription.SubCategory
Gets or sets the SubCategory in which this object belongs. If HasSubCategory() returns false, this field has no meaning.

Grasshopper.Kernel.GH_InstanceDescription.HasCategory
Gets whether or not the Category field has been set.

Grasshopper.Kernel.GH_InstanceDescription.HasSubCategory
Gets whether or not the SubCategory field has been set.

Grasshopper.Kernel.GH_InstanceDescription.NewInstanceGuid
Generate a new random instance GUID

Grasshopper.Kernel.GH_InstanceDescription.NewInstanceGuid(System.Guid)
Set the instance ID to be a specific GUID. This is very dangerous, only use this function
if you're 6"4' and your first name is David.

Grasshopper.Kernel.GH_InstanceDescription.InstanceGuid
Gets the ID of this runtime instance.

Grasshopper.Kernel.GH_InstanceDescription.Write(GH_IO.Serialization.GH_IWriter)
Default serialization. Only stores Name, NickName, Description and InstanceGuid fields.
If you want to store additional fields use WriteFull() instead.
writer: Object to serialize with.
Returns: Always True.

Grasshopper.Kernel.GH_InstanceDescription.Read(GH_IO.Serialization.GH_IReader)
Default deserialization. Only retrieves Name, NickName, Description and InstanceGuid fields.
If you want to retrieve additional fields use ReadFull() instead. However, ReadFull() will only
work if the archive was written using WriteFull().
reader: Object to deserialize with.
Returns: Always True.

Grasshopper.Kernel.GH_InstanceDescription.WriteFull(GH_IO.Serialization.GH_IWriter)
GH_InstanceDescription does not by default serialize all fields.
Use this function to write all fields to the archive.
This method is compatible with the default Write()/Read() operations.
writer: Writer for serialization.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_InstanceDescription.ReadFull(GH_IO.Serialization.GH_IReader)
GH_InstanceDescription does not by default serialize all fields.
Use this function to read all fields from the archive.
This method is compatible with the default Write()/Read() operations.
reader: Writer for deserialization.
Returns: True on success, false on failure.