Grasshopper.Kernel.Types.GH_Point.CreateFromCoordinate(Rhino.Geometry.Point3d)
Create a new point geometry instance based on a fixed coordinate
pt: The coordinate for the point
Remarks: This 'constructor' merely sets fields, it doesn't load the geometry and it doesn't perform validity checking.

Grasshopper.Kernel.Types.GH_Point.CreateFromPointObject(System.Guid)
Create a new point geometry instance based on point object ID.
Technically this now also accepts Dot object IDs.
id: The identifier of the point object
Remarks: This 'constructor' merely sets fields, it doesn't load the geometry and it doesn't perform validity checking.

Grasshopper.Kernel.Types.GH_Point.CreateFromCurveRatio(System.Guid,Rhino.Geometry.Curve,System.Double)
Create new point geometry instance based on a curve parameter ratio
crv_id: ID of the curve this object references
t: Parameter on curve in domain space
Remarks: This 'constructor' merely sets fields, it doesn't load the geometry and it doesn't perform validity checking.

Grasshopper.Kernel.Types.GH_Point.CreateFromCurveDistance(System.Guid,Rhino.Geometry.Curve,System.Double,System.Boolean)
Create new point geometry instance based on a curve distance parameter
crv_id: ID of the curve this object references
crv: The curve to act on
t: Parameter on the curve that controls the distance measurement
bFromStart: True if the distance is to be measured from the start of the curve
Remarks: This 'constructor' merely sets fields, it doesn't load the geometry and it doesn't perform validity checking.

Grasshopper.Kernel.Types.GH_Point.CreateFromEdgeRatio(System.Guid,Rhino.Geometry.Curve,System.Int32,System.Double)
Create new point geometry instance based on an edge parameter ratio
brp_id: ID of the brep this object references
edge: The edge curve
e_index: Index of edge to reference
t: Parameter on edge in edge domain space
Remarks: This 'constructor' merely sets fields, it doesn't load the geometry and it doesn't perform validity checking.

Grasshopper.Kernel.Types.GH_Point.CreateFromEdgeDistance(System.Guid,Rhino.Geometry.Curve,System.Int32,System.Double,System.Boolean)
Create new point geometry instance based on a curve distance parameter
brp_id: ID of the curve this object references
edge: The edge curve
e_index: Index of edge to reference
t: Parameter along the curve in curve domain space
bFromStart: True if the distance is to be measured from the start of the curve
Remarks: This 'constructor' merely sets fields, it doesn't load the geometry and it doesn't perform validity checking.

Grasshopper.Kernel.Types.GH_Point.CreateFromSurfaceParam(System.Guid,System.Int32,Rhino.Geometry.Surface,System.Double,System.Double)
Create new point geometry instance based on a curve distance parameter
brp_id: ID of the curve this object references
f_index: Index of edge to reference
srf: Surface to work on
u: Parameter in surface U direction
v: Parameter in surface V direction
Remarks: This 'constructor' merely sets fields, it doesn't load the geometry and it doesn't perform validity checking.

Grasshopper.Kernel.Types.GH_Point.EnsureReferenceData
Creates new Reference data if it doesn't already exists

Grasshopper.Kernel.Types.GH_Point.ReferenceData
Gets or sets the reference data of this point geometry.
Remarks: Reference data can be Null

Grasshopper.Kernel.Types.GH_Point.ReferenceIndex
Retrieve the index of the point reference data.
Returns: The index of the reference data. This index describes the sub-object of the reference.
Remarks: If there exists no reference data, -1 is returned.

Grasshopper.Kernel.Types.GH_Point.ReferenceIndex(System.Int32)
Sets the index of the point reference data.
new_index: The index to set. This index describes the sub-object of the reference.
Remarks: If there is no reference data, this function will create a new instance.

Grasshopper.Kernel.Types.GH_Point.ReferenceParam(System.Int32)
Retrieve the indexed param of the point reference data.
index: Index of parameter. Only 0 and 1 are valid values.
Returns: The indexed param of the reference data.
Remarks: If there exists no reference data, NaN is returned.

Grasshopper.Kernel.Types.GH_Point.ReferenceParam(System.Int32,System.Double)
Sets the index of the point reference data.
index: The index of the parameter. Only 0 and 1 are valid values.
new_param: The new value of the parameter
Remarks: If there is no reference data, this function will create a new instance.

Grasshopper.Kernel.Types.GH_Point.SetReferenceParams(System.Double,System.Double)
Sets both param values of the point reference
u: The new u parameter
v: The new v parameter
Remarks: If there is no reference data, this function will create a new instance.

Grasshopper.Kernel.Types.GH_Point.ReferencesEdge
Returns True if this point is based on an edge reference

Grasshopper.Kernel.Types.GH_Point.ReferencesCurve
Returns true if this point is based on a curve reference
Returns:
Remarks:

Grasshopper.Kernel.Types.GH_Point.ReferenceType
Retrieve the reference type of this point object.
Returns: The reference type as specified by the Reference Data.
If there is no reference data, either Unset or Coordinate is returned depending on
whether m_Point is a null reference.

Grasshopper.Kernel.Types.GH_Point.ReferenceType(Grasshopper.Kernel.Types.GH_PointRefType)
Sets the type of the point reference data.
new_type: The new type, if type = Coordinate or Unset, then the Reference data will be erased.
Remarks: If there is no reference data, this function will create a new instance.

Grasshopper.Kernel.Types.GH_Point.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Kernel.Types.GH_Point.QC_Type


Grasshopper.Kernel.Types.GH_Point.QC_Hash


Grasshopper.Kernel.Types.GH_Point.QC_Distance(Grasshopper.Kernel.Types.IGH_QuickCast)


Grasshopper.Kernel.Types.GH_Point.QC_Bool


Grasshopper.Kernel.Types.GH_Point.QC_Complex


Grasshopper.Kernel.Types.GH_Point.QC_Matrix


Grasshopper.Kernel.Types.GH_Point.QC_Int


Grasshopper.Kernel.Types.GH_Point.QC_Num


Grasshopper.Kernel.Types.GH_Point.QC_Text


Grasshopper.Kernel.Types.GH_Point.QC_Pt


Grasshopper.Kernel.Types.GH_Point.QC_Vec


Grasshopper.Kernel.Types.GH_Point.QC_Col


Grasshopper.Kernel.Types.GH_Point.QC_Interval


Grasshopper.Kernel.Types.GH_Point.QC_CompareTo(Grasshopper.Kernel.Types.IGH_QuickCast)
