Grasshopper.GUI.GH_Interpolation
Enumerates the possible animation progression types.

Grasshopper.GUI.GH_Interpolation.None
No animation occurs.

Grasshopper.GUI.GH_Interpolation.NearestNeighbour
Animation interpolation is either equal to A or B, whichever is closest.

Grasshopper.GUI.GH_Interpolation.Linear
Linear interpolation between A and B.

Grasshopper.GUI.GH_Interpolation.EaseIn
Interpolation that has a derivative of zero at the start.

Grasshopper.GUI.GH_Interpolation.EaseOut
Inteprolation that has a derivative of zero at the end.

Grasshopper.GUI.GH_Interpolation.EaseInAndOut
Interpolation that has a derivative of zero at both ends.