Grasshopper.Plugin.Commands.GH_HelpTopicSummary


Grasshopper.Plugin.Commands.GH_HelpTopicSummary.ExtractCategory(System.Collections.Generic.List{Grasshopper.Plugin.Commands.GH_HelpTopic},System.String)
Moves all topics hat share a certain category from the input list into a target list.

Grasshopper.Plugin.Commands.GH_HelpTopicSummary.ExtractSubCategory(System.Collections.Generic.List{Grasshopper.Plugin.Commands.GH_HelpTopic},System.String)
Moves all topics hat share a certain category from the input list into a target list.