Grasshopper.GUI.Canvas.GH_CanvasWidgetListEventArgs
The event arguments are used in the WidgetListCreated event.

Grasshopper.GUI.Canvas.GH_CanvasWidgetListEventArgs.AddWidget(Grasshopper.GUI.Widgets.IGH_Widget)
Append a widget to the canvas.
widget: Widget to append.