Grasshopper.Kernel.GH_RuntimeMessage
Contains all fields that together define a RuntimeMessage. Runtime Messages
are created and recorded by document objects during Grasshopper solutions.

Grasshopper.Kernel.GH_RuntimeMessage.Event
Gets the time at which the message was recorded.

Grasshopper.Kernel.GH_RuntimeMessage.Type
Gets the type qualifier of the message.

Grasshopper.Kernel.GH_RuntimeMessage.Message
Gets the contents of the message.

Grasshopper.Kernel.GH_RuntimeMessage.Source
Gets a string describing the source object that created the message.

Grasshopper.Kernel.GH_RuntimeMessage.HasSource
Gets a value indicating whether or not this message has a source.