Grasshopper.GUI.Canvas.GH_CanvasDropTargetValidator
Utility validator for restricting component creation.

Grasshopper.GUI.Canvas.GH_CanvasDropTargetValidator.DocumentAssociation
Gets or sets the Document filter for this validator.

Grasshopper.GUI.Canvas.GH_CanvasDropTargetValidator.DropRegion
Gets or sets the dropregion for this validator.
Regions are cloned so you can dispose of the original immedately after assignment.

Grasshopper.GUI.Canvas.GH_CanvasDropTargetValidator.DropID
Gets or sets the ID for the allowed component.

Grasshopper.GUI.Canvas.GH_CanvasDropTargetValidator.DropText
Gets or sets the text to display.

Grasshopper.GUI.Canvas.GH_CanvasDropTargetValidator.DropDelegate
Gets or sets the delegate to be invoked when a component is dropped inside the dropregion.