Grasshopper.Kernel.Data.GH_TreeRules
Represents an entire data tree rule set.

Grasshopper.Kernel.Data.GH_TreeRules.#ctor(System.Collections.Generic.IEnumerable{Grasshopper.Kernel.Data.IGH_Rule},Grasshopper.Kernel.Data.IGH_Rule)
Constructs a new rule set for testing data trees.
Unless you know exactly what you are doing, use the FromString() static method instead.
pathRules: A collection of path rules.
indexRule: Optional index rule (may be null).

Grasshopper.Kernel.Data.GH_TreeRules.FromString(System.String,System.String@)
Attempt to parse a Pattern string.
text: String to parse.
message: If this function fails, msg will contain a message describing the error.
Returns: True on success, false on failure.

Grasshopper.Kernel.Data.GH_TreeRules.ProcessRuleString(System.String)
Process and validate the rule text.
If the string violates rule notation syntax an exception will be thrown.
Note that not all mistakes will be caught by this algorithm.
ruleString: String to process.
Returns: The processed string.

Grasshopper.Kernel.Data.GH_TreeRules.GetPathFragments(System.String,System.String[]@)
Extract all path fragments from a rule string.
If fragments cannot be parsed then an exception will be thrown.
text: Rule string to parse.
fragments: Array of all path fragments.

Grasshopper.Kernel.Data.GH_TreeRules.GetItemFragment(System.String,System.String@)
Extract the (optional) item fragment from a rule string.
text: Rule string to parse.
fragment: Item fragment (if found), otherwise null.

Grasshopper.Kernel.Data.GH_TreeRules.GetRuleFragments(System.String,System.String[]@,System.String[]@)
Extract all the rule fragments and associated operators.
text: Text to parse.
rules: Array of rule fragments (at least one).
operators: Array of rule operators (one less than rules)

Grasshopper.Kernel.Data.GH_TreeRules.PathRuleCount
Gets the number of defined path rules.

Grasshopper.Kernel.Data.GH_TreeRules.HasPathRules
Gets whether this rule set has any path rules.

Grasshopper.Kernel.Data.GH_TreeRules.HasItemRule
Gets whether this rule set has a defined index rule.

Grasshopper.Kernel.Data.GH_TreeRules.ContainsRule(Grasshopper.Kernel.Data.GH_RuleKind)
Test whether the path rules contain a rule of the specified kind.
rule: Rule kind to test for.
Returns: True if the path rules contain at least one rule of the specified kind.

Grasshopper.Kernel.Data.GH_TreeRules.Apply(Grasshopper.Kernel.Data.GH_Path,System.Int32)
Apply all the local rules to a path+index combination.
path: Path to test.
index: Index to test.
Returns: True if path+index pass all the rule tests.

Grasshopper.Kernel.Data.GH_TreeRules.Apply(Grasshopper.Kernel.Data.GH_Path)
Apply all the local rules to a path.
path: Path to test.
Returns: True if path passes all the rule tests.

Grasshopper.Kernel.Data.GH_TreeRules.Apply(Grasshopper.Kernel.Data.GH_Path,System.Int32,System.Int32)
Recursive rule application.
path: Path to match against.
pathIndex: Index of path element.
ruleIndex: Index of rule.
Returns: True if this (and all recursive) segments match with the given path.