Grasshopper.GUI.GH_GooProxyList


Grasshopper.GUI.GH_GooProxyList.SetData``1(Grasshopper.Kernel.Data.GH_Structure{``0},Grasshopper.Kernel.Types.IGH_Goo)
Set the content for this control.
data: Data to manage.
baseType: Type instance to use when creating new items or null if T already supports construction.
This instance must support EmitProxy().

Grasshopper.GUI.GH_GooProxyList.SelectedData
Gets a list of all the selected proxies

Grasshopper.GUI.GH_GooProxyList.IsParsable
Gets whether the local type is parsable.

Grasshopper.GUI.GH_GooProxyList.InsertionIndex(System.Int32)
Find the index of the most relevant item at the given vertical pixel coordinate.
y: Vertical component of pixel.
Returns: The index for the most relevant item.

Grasshopper.GUI.GH_GooProxyList.m_dragMode
Represents the current mouse interaction modus.