Grasshopper.GUI.IGH_SettingCategory
Represents a single category in the Settings UI.
Implement this interface or derive from GH_SettingsCategory
to add a new Category to the Grasshopper Settings interface.

Grasshopper.GUI.IGH_SettingCategory.Parent
Gets the name of the parent category. If the category is
supposed to be top-level, this property will return null or
a String.Empty.

Grasshopper.GUI.IGH_SettingCategory.Name
Category name (not case sensitive). Use dots to separate subcategories.

Grasshopper.GUI.IGH_SettingCategory.Description
Category description.

Grasshopper.GUI.IGH_SettingCategory.Icon
Category icon. Image should be 48x48 pixels.