Grasshopper.Kernel.Data.GH_Lexer
Represents a lexical mask for path operations.

Grasshopper.Kernel.Data.GH_Lexer._path
Contains all the elements in the mask string. This list is created lazily.

Grasshopper.Kernel.Data.GH_Lexer._item
Contains the item element in the mask string. This is created lazily.

Grasshopper.Kernel.Data.GH_Lexer.#ctor
Blank constructor.

Grasshopper.Kernel.Data.GH_Lexer.#ctor(System.String)
Create a new mask from a textual string.
mask: Mask string.

Grasshopper.Kernel.Data.GH_Lexer.ParseMask(System.String,System.Collections.Generic.List{System.String}@,System.String@)
Parse the current mask string.

Grasshopper.Kernel.Data.GH_Lexer.Mask
Gets the original string that represents the user input for this lexer.

Grasshopper.Kernel.Data.GH_Lexer.Item
Gets the item string that was extracted from the mask. The default is "append"

Grasshopper.Kernel.Data.GH_Lexer.Path
Gets the list of path strings that was extracted from the mask.
If the mask hasn't been parsed yet, it will be parsed now.
If the returned list is still nothing, parsing failed.

Grasshopper.Kernel.Data.GH_Lexer.IsItem
Gets a value indicating whether or not the item portion of the lexer has been set.

Grasshopper.Kernel.Data.GH_Lexer.IsPath
Gets a value indicating whether or not the path portion of the lexer has been set.

Grasshopper.Kernel.Data.GH_Lexer.EvaluatePath(Grasshopper.Kernel.Expressions.GH_ExpressionParser,Grasshopper.Kernel.Data.GH_Path@,System.Int32@)
Evaluate the variables in this mask with the provided expression solver.
evaluator: Evaluator to use. Must have all variables properly set up.
path: Path result.
index: Index result. If the lexer contains no item representation then
the index remains unmolested.
Returns: True on success, false on failure.

Grasshopper.Kernel.Data.GH_Lexer.PerformLexicalReplace``1(Grasshopper.Kernel.Data.GH_Lexer,Grasshopper.Kernel.Data.GH_Lexer,Grasshopper.Kernel.Data.IGH_Structure,Grasshopper.Kernel.Data.GH_Structure{``0})
Lexical Find..Replace operations.
Type of data in target tree.
source: Search mask.
target: Replace pattern.
structure_in: Source data tree.
structure_out: Target data tree.

Grasshopper.Kernel.Data.GH_Lexer.PerformLexicalReplace``1(Grasshopper.Kernel.Data.GH_Lexer,Grasshopper.Kernel.Data.GH_Lexer,Grasshopper.DataTree{``0},Grasshopper.DataTree{``0})
Lexical Find..Replace operations.
Type of data in target tree.
source: Search mask.
target: Replace pattern.
tree_in: Source data tree.
tree_out: Target data tree.