Grasshopper.GUI.GH_VariableParamProxy
Proxy object for maintaining variable parameters.

Grasshopper.GUI.GH_VariableParamProxy.BlankID
Gets whether the parameter id is empty.

Grasshopper.GUI.GH_VariableParamProxy.ID
Gets or sets the param ID. If this is a new param, the guid will be Guid.Empty.

Grasshopper.GUI.GH_VariableParamProxy.NickName
Gets or sets the param NickName.

Grasshopper.GUI.GH_VariableParamProxy.Variable
Gets or sets a value indicating whether or not the parameter is
indeed variable.

Grasshopper.GUI.GH_VariableParamProxy.Mutable
Gets or sets whether this proxy has a mutable nickname.

Grasshopper.GUI.GH_VariableParamProxy.Deleted
Gets or sets whether the parameter is currently deleted.
Deleted parameter will not be included in the component
once the VarParamManager completes.

Grasshopper.GUI.GH_VariableParamProxy.UpdateUI
Refresh all UI elements to reflect the current settings.