Grasshopper.GUI.GH_FontList
Represents the installed Font collection. This control allows
both navigation and selection of Font Families.

Grasshopper.GUI.GH_FontList.Filter
Gets or sets the filter string.
You must call RecreateFontList() before the new font list is created.

Grasshopper.GUI.GH_FontList.DisplayText
Gets or sets the placeholder string.

Grasshopper.GUI.GH_FontList.FontSize
Gets or sets the font size.

Grasshopper.GUI.GH_FontList.FontStyle
Gets or sets the font style for all families.

Grasshopper.GUI.GH_FontList.FontFamily
Gets or sets the selected font family.

Grasshopper.GUI.GH_FontList.CreateFont
Create a font that best approximates the current settings.