Grasshopper.My.Resources.Res_ContextMenu
A strongly-typed resource class, for looking up localized strings, etc.

Grasshopper.My.Resources.Res_ContextMenu.ResourceManager
Returns the cached ResourceManager instance used by this class.

Grasshopper.My.Resources.Res_ContextMenu.Culture
Overrides the current thread's CurrentUICulture property for all
resource lookups using this strongly typed resource class.

Grasshopper.My.Resources.Res_ContextMenu.Access_Item_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Access_List_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Access_Tree_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Align_Bottom_11x11
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Align_Horizontal_11x11
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Align_Left_11x11
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Align_Right_11x11
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Align_Top_11x11
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Align_Vertical_11x11
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.ClusterInfo_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.ColourWheelBichromatic
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.ColourWheelComplementary
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.ColourWheelMonochromatic
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.ColourWheelTetrachromatic
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.ColourWheelTetrad
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.ColourWheelTriad
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.ColourWheelTrichromatic
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Component_Display_Default
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Component_Display_Icon
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Component_Display_Name
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Distribute_Horizontal_11x11
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Distribute_Vertical_11x11
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Edit_PanelText_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.ErrorSymbol_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Font_Comic_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Font_Courier_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Font_SansSerif_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Font_TimesNewRoman_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Font_Trebuchet_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Graph_Bezier_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Graph_Blank_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Graph_Conic_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Graph_DoubleSine_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Graph_Gaussian_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Graph_Linear_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Graph_Parabola_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Graph_Perlin_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Graph_Power_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Graph_Sinc_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Graph_Sine_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Graph_SquareRoot_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Group_Boxes_Outline_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Group_MetaBall_Outline_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Group_Rectangle_Outline_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.GroupTag_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Help_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.LegendDiscreteHorizontal_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.LegendDiscreteVertical_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.LegendSmoothHorizontal_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.LegendSmoothVertical_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Markov_BottomLeft_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Markov_BottomRight_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Markov_TopLeft_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Markov_TopRight_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Match_CrossReference_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Match_LongestList_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Match_ShortestList_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Modifier_Contains_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Modifier_Degrees_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Modifier_EndsWith_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Modifier_Equals_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Modifier_Expression_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Modifier_Flatten_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Modifier_Graft_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Modifier_Invert_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Modifier_Normalise_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Modifier_NotEquals_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Modifier_Principal_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Modifier_Regex_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Modifier_Reverse_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Modifier_Simplify_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Modifier_StartsWith_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Modifier_Synchronize_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Modifier_Wildcards_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Panel_AlignCenter_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Panel_AlignLeft_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Panel_AlignRight_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Panel_DrawIndices_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Panel_DrawPaths_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Panel_MultilineData_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Panel_StreamContents_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Panel_StreamDestination_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.ParamViewer_DrawTree_16X16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.RemarkSymbol_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Sample_Channel_Alpha_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Sample_Channel_Blue_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Sample_Channel_Colour_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Sample_Channel_Green_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Sample_Channel_Hue_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Sample_Channel_Luminance_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Sample_Channel_Red_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Sample_Channel_Saturation_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Sampling_Clamp_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Sampling_Flip_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Sampling_Tile_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.ValueList_Cyclical_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Variable_Params_Input_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.Variable_Params_Output_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.WarningSymbol_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.WireDisplay_Default
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.WireDisplay_Faint
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ContextMenu.WireDisplay_Hidden
Looks up a localized resource of type System.Drawing.Bitmap.