Grasshopper.Kernel.IGH_InstanceDescription
Base interface for all objects that participate in the Grasshopper GUI.
Remarks:

Grasshopper.Kernel.IGH_InstanceDescription.Name
Gets or sets the name of the object. This field typically remains fixed during the lifetime of an object.

Grasshopper.Kernel.IGH_InstanceDescription.NickName
Gets or sets the nickname of the object. This field can be changed by the user.

Grasshopper.Kernel.IGH_InstanceDescription.Description
Gets or sets the description of the object. This field typically remains fixed during the lifetime of an object.

Grasshopper.Kernel.IGH_InstanceDescription.InstanceDescription
Gets a description of the current state of the object.
This field is usually the same as the Description() field, but it might be variable when overridden.

Grasshopper.Kernel.IGH_InstanceDescription.Category
Gets or sets the Category in which this object belongs. If HasCategory() returns false, this field has no meaning.

Grasshopper.Kernel.IGH_InstanceDescription.SubCategory
Gets or sets the SubCategory in which this object belongs. If HasSubCategory() returns false, this field has no meaning.

Grasshopper.Kernel.IGH_InstanceDescription.Keywords
Gets a list of additional keywords that describe the object. Typically this list is empty but you
can override this property to aid in object searches.

Grasshopper.Kernel.IGH_InstanceDescription.HasCategory
Gets whether or not the Category field has been set.

Grasshopper.Kernel.IGH_InstanceDescription.HasSubCategory
Gets whether or not the SubCategory field has been set.

Grasshopper.Kernel.IGH_InstanceDescription.InstanceGuid
Gets the ID of this runtime instance.

Grasshopper.Kernel.IGH_InstanceDescription.NewInstanceGuid
Generate a new random instance GUID

Grasshopper.Kernel.IGH_InstanceDescription.NewInstanceGuid(System.Guid)
Set the instance ID to be a specific GUID. This is very dangerous, only use this function
if you're 6"4' and called David.