Grasshopper.GUI.Ribbon.GH_RibbonDropdown


Grasshopper.GUI.Ribbon.GH_RibbonDropdown.AutoClose
Gets or sets whether the dropdown closes automatically
due to some winforms event.

Grasshopper.GUI.Ribbon.GH_RibbonDropdown.FindIconRectangle(System.Guid,System.Drawing.Rectangle@)
Finds the icon rectangle that belongs to the proxy with the given ComponentID.
id: ComponentID to search for.
rectangle: Icon rectangle result in dropdown coordinates.
Returns: True on success, false on failure.