Grasshopper.GUI.GH_GraphicsUtil
Utility class with static (Shared) functions that help with colour, shape and text rendering.

Grasshopper.GUI.GH_GraphicsUtil.#ctor
This class only exposes shared (static) functions, do not instantiate it.

Grasshopper.GUI.GH_GraphicsUtil.UiScale
Gets the screen-scaling factor for the entire system.
Use the UiAdjust methods in the Grasshopper top level namespace
(Global_Proc module) to modify integer and single values.
Returns: Scaling factor (dpi / 96).

Grasshopper.GUI.GH_GraphicsUtil.HighlightPen
Gets a new pen object that can be used to draw the edges of hover and focus rectangles.
Caller is responsible for disposing the pen.

Grasshopper.GUI.GH_GraphicsUtil.HighlightBrush
Gets a new brush object that can be used to draw the content of hover and focus rectangles.
Caller is responsible for disposing the brush.

Grasshopper.GUI.GH_GraphicsUtil.RenderHighlightBox(System.Drawing.Graphics,System.Drawing.Rectangle,System.Int32)
Render a typical blueish highlight rectangle
g: Graphics object to render with.
box: Dimensions of selection box.
cornerRadius: Radius (in pixels) of box corners, use zero or less to render crisp rectangles.

Grasshopper.GUI.GH_GraphicsUtil.RenderHighlightBox(System.Drawing.Graphics,System.Drawing.Rectangle,System.Int32,System.Boolean,System.Boolean)
Render a typical blueish highlight rectangle
g: Graphics object to render with.
box: Dimensions of selection box.
cornerRadius: Radius (in pixels) of box corners, use zero or less to render crisp rectangles.
drawFill: If true, the box fill have a blue background.
drawEdge: If true, the box will have a blue edge.

Grasshopper.GUI.GH_GraphicsUtil.RenderHighlightBox(System.Drawing.Graphics,System.Drawing.Rectangle,System.Int32,System.Drawing.Color,System.Drawing.Color)
Render a typical blueish highlight rectangle
g: Graphics object to render with.
box: Dimensions of selection box.
cornerRadius: Radius (in pixels) of box corners, use zero or less to render crisp rectangles.
fill: Fill colour
edge: Edge colour

Grasshopper.GUI.GH_GraphicsUtil.LimitInteger(System.Int32@)
Limits the given integer to the 0~255 range.

Grasshopper.GUI.GH_GraphicsUtil.LimitIntegers(System.Int32@,System.Int32@,System.Int32@)
Limits RGB channels to the 0~255 range,

Grasshopper.GUI.GH_GraphicsUtil.ColourARGB(System.Int32,System.Int32,System.Int32)
Create a colour from integer RGB channels.
Channels are clipped to valid ranges.
Returns: Returns the colour as implied by the RGB channel values.

Grasshopper.GUI.GH_GraphicsUtil.ColourARGB(System.Int32,System.Int32,System.Int32,System.Int32)
Create a colour from integer ARGB channels.
Channels are clipped to valid ranges.
Returns: Returns the colour as implied by the ARGB channel values.

Grasshopper.GUI.GH_GraphicsUtil.ColourARGB(System.Double,System.Double,System.Double)
Create a colour from floating ARGB channels (0.0~1.0).
Channels are clipped to valid ranges.
Returns: The colour implied by the RGB channel values.

Grasshopper.GUI.GH_GraphicsUtil.InvertColour(System.Drawing.Color)
Computes the inverted colour. Alpha remains the same.
Returns: Colour where RGB channels are set to 255-C.

Grasshopper.GUI.GH_GraphicsUtil.ForegroundColour(System.Drawing.Color,System.Int32)
Calculates a suitable foreground color. If the background
is lighter than 50%, the foreground will be darker, otherwise the foreground will be lighter.
contrast: Contrast amount (in 0~255 range)
col: Foreground colour that works well on the given background colour.

Grasshopper.GUI.GH_GraphicsUtil.OffsetColour(System.Drawing.Color,System.Int32)
Add a fixed value to all the channels in a colour.
col: The colour to mutate.
shift: Offset value (-255 ~ +255).
Returns: The offsetted colour.
Remarks: The alpha channel of the colour is not offset.

Grasshopper.GUI.GH_GraphicsUtil.OffsetColour(System.Drawing.Color,System.Int32,System.Int32,System.Int32)
Add a fixed value to all the channels in a colour.
col: The colour to mutate
redShift: Offset value for red channel (-255 ~ +255).
greenShift: Offset value for green channel (-255 ~ +255).
blueShift: Offset value for blue channel (-255 ~ +255).
Returns: The offsetted colour.
Remarks: The alpha channel of the colour is not offset.

Grasshopper.GUI.GH_GraphicsUtil.ScaleColour(System.Drawing.Color,System.Double)
Multiply the channels of a colour construct with a fixed factor.
col: The colour to mutate
factor: An adjustment factor.
Returns: The scaled colour.
Remarks: The alpha channel of the colour is not mutated.

Grasshopper.GUI.GH_GraphicsUtil.BlendInteger(System.Double,System.Double,System.Int32,System.Int32,System.Double)
Calculates a linear blend between two extremes. Although the inputs
are unlimited integers, the output is an integer in the byte range (0-255).
t0: Value of first extreme.
t1: Value of second extreme.
a0: Integer value at first extreme.
a1: Integer value at second extreme.
t: Interpolation parameter.
Returns: Interpolated value.
This function is useful when you need to link colour alpha amounts to zoom levels:
Sub DrawZoomAwareCircle(ByVal G As Graphics, _
ByVal center As PointF, _
ByVal radius As Single, _
ByVal fill As Color)
'Find the zoom level of the Graphics transform.
Dim zoom As Single = G.Transform.Elements(0)
'Abort if zoom less than 25%
If (zoom < 0.25f) Then Return
'Blend the alpha channel byte between 25% and 95% zoom.
Dim alpha As Int32 = GH_GraphicsUtil.BlendByte(0.25, 0.95, 0, 255, zoom)
G.FillEllipse(center.X - radius, center.Y - radius, _
2.0f * radius, 2.0f * radius, _
New SolidBrush(Color.FromARGB(alpha, fill)))
End Sub

Grasshopper.GUI.GH_GraphicsUtil.FadeColour(System.Double,System.Double,System.Double,System.Drawing.Color)
Fade a colour to transparency by linearly blending a parameter between extremes.
t0: First extreme. (represents transparency)
t1: Second extreme. (represent unaltered colour)
t: Blending factor between t0 and t1.
col: Colour to fade.
Returns: The colour adjusted for blending.

Grasshopper.GUI.GH_GraphicsUtil.BlendColour(System.Drawing.Color,System.Drawing.Color)
Overlays two colours. The Alpha component of the top colour controls the blend.
bottom: Base colour.
top: Overlay colour.
Returns: The blended colour. Alpha channels are added together.

Grasshopper.GUI.GH_GraphicsUtil.BlendColour(System.Drawing.Color,System.Drawing.Color,System.Double)
Overlays two colours.
bottom: Base colour.
top: Overlay colour.
factor: Blend factor. 0.0 means the return colour will be identical to the bottom colour,
1.0 means the return colour will be identical to the top colour.
Returns: The blended colour.

Grasshopper.GUI.GH_GraphicsUtil.Distance(System.Drawing.PointF,System.Drawing.PointF)
Compute the distance between two points.
a: First point.
b: Second point.

Grasshopper.GUI.GH_GraphicsUtil.DistanceS(System.Drawing.PointF,System.Drawing.PointF)
Compute the squared distance between two points.
a: First point.
b: Second point.

Grasshopper.GUI.GH_GraphicsUtil.IsPointInEllipse(System.Drawing.RectangleF,System.Drawing.PointF)
Test whether a point is inside or outside an ellipse.
ellipse: Rectangle describing ellipse.
point: Point to test for inclusion.
Returns: True if the point is in or on the ellipse.

Grasshopper.GUI.GH_GraphicsUtil.EtchHorizontal(System.Drawing.Graphics,System.Single,System.Single,System.Single,System.Int32)
Draws an etched line segment.
g: Graphics object to draw with.
x0: x component of start point.
x1: x component of end point.
y: y component of line segment.
alpha: Alpha level of etched line.

Grasshopper.GUI.GH_GraphicsUtil.EtchHorizontal(System.Drawing.Graphics,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
Draws an etched line segment.
g: Graphics object to draw with.
x0: x component of start point.
x1: x component of end point.
y: y component of line segment.
alphaLight: Alpha level of etched lit line.
alphaDark: Alpha level of etched shadow line.

Grasshopper.GUI.GH_GraphicsUtil.EtchFadingHorizontal(System.Drawing.Graphics,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
Draw an etched line with fading on the extremes.
g: Graphics object to draw with.
x0: Left x coordinate of etch.
x1: Right x coordinate of etch.
y: Y coordinate of etch.
alphaLight: Transparancy of bright etch line.
alphaDark: Transparency of dark etch line.

Grasshopper.GUI.GH_GraphicsUtil.EtchVertical(System.Drawing.Graphics,System.Single,System.Single,System.Single,System.Int32)
Draws an etched line segment.
g: Graphics object to draw with.
x: x component of line segment.
y0: x component of start point.
y1: y component of end point.
alpha: Alpha level of etched line.

Grasshopper.GUI.GH_GraphicsUtil.EtchVertical(System.Drawing.Graphics,System.Int32,System.Int32,System.Int32,System.Int32)
Draws an etched line segment.
g: Graphics object to draw with.
x: x component of line segment.
y0: x component of start point.
y1: y component of end point.
alpha: Alpha level of etched line.

Grasshopper.GUI.GH_GraphicsUtil.EtchFadingVertical(System.Drawing.Graphics,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
Draw an etched line with fading on the extremes.
g: Graphics object to draw with.
y0: Top y coordinate of etch.
y1: Bottom y coordinate of etch.
x: X coordinate of etch.
alphaLight: Transparancy of etch.
alphaDark: Transparancy of etch.

Grasshopper.GUI.GH_GraphicsUtil.Grid(System.Drawing.Graphics,System.Drawing.RectangleF,System.Int32)
Draw a default grid.
g: Graphics object to draw with.
rec: Grid rectangle.
density: Density in both directions.

Grasshopper.GUI.GH_GraphicsUtil.Grid(System.Drawing.Graphics,System.Drawing.RectangleF,System.Int32,System.Int32)
Draw a default grid.
g: Graphics object to draw with.
rec: Grid rectangle.
densityX: Density in x direction.
densityY: Density in y direction.

Grasshopper.GUI.GH_GraphicsUtil.Grid(System.Drawing.Graphics,System.Drawing.RectangleF,System.Int32,System.Int32,System.Drawing.Color,System.Drawing.Color)
Draw a grid.
g: Graphics object to draw with.
rec: Grid rectangle.
densityX: Density in x direction.
densityY: Density in y direction.
colorBg: Background colour override, the default is 30/255 white.
colorWire: Grid line colour override, the default is 40/255 black.

Grasshopper.GUI.GH_GraphicsUtil.ShadowHorizontal(System.Drawing.Graphics,System.Single,System.Single,System.Single,System.Single,System.Boolean,System.Int32)
Draws a horizontal shadow edge.
g: Graphics object to draw with.
x0: Start of shadow edge.
x1: End of shadow edge.
y: Elevation of shadow edge.
size: Length of cast shadow.
below: If true, shadow is drawn below elevation line.
darkness: Alpha component of darkness directly underneath the edge.

Grasshopper.GUI.GH_GraphicsUtil.ShadowHorizontal(System.Drawing.Graphics,System.Int32,System.Int32,System.Int32,System.Int32,System.Boolean,System.Int32)
Draws a horizontal shadow edge.
g: Graphics object to draw with.
x0: Start of shadow edge.
x1: End of shadow edge.
y: Elevation of shadow edge.
size: Length of cast shadow.
below: If true, shadow is drawn below elevation line.
darkness: Alpha component of darkness directly underneath the edge.

Grasshopper.GUI.GH_GraphicsUtil.ShadowHorizontal(System.Drawing.Graphics,System.Int32,System.Int32,System.Int32,System.Int32,System.Boolean,System.Drawing.Color)
Draws a horizontal shadow edge.
g: Graphics object to draw with.
x0: Start of shadow edge.
x1: End of shadow edge.
y: Elevation of shadow edge.
size: Length of cast shadow.
below: If true, shadow is drawn below elevation line.
color: Colour at shadow edge.

Grasshopper.GUI.GH_GraphicsUtil.ShadowVertical(System.Drawing.Graphics,System.Single,System.Single,System.Single,System.Single,System.Boolean,System.Int32)
Draws a vertical shadow edge.
g: Graphics object to draw with.
x: Offset of shadow edge.
y0: Start of shadow edge.
y1: End of shadow edge.
size: Length of cast shadow.
right: If true, shadow is drawn to the right of the elevated line.
darkness: Alpha component of darkness directly underneath the edge.

Grasshopper.GUI.GH_GraphicsUtil.ShadowVertical(System.Drawing.Graphics,System.Int32,System.Int32,System.Int32,System.Int32,System.Boolean,System.Int32)
Draws a vertical shadow edge.
g: Graphics object to draw with.
x: Offset of shadow edge.
y0: Start of shadow edge.
y1: End of shadow edge.
size: Length of cast shadow.
right: If true, shadow is drawn to the right of the elevated line.
darkness: Alpha component of darkness directly underneath the edge.

Grasshopper.GUI.GH_GraphicsUtil.ShadowVertical(System.Drawing.Graphics,System.Int32,System.Int32,System.Int32,System.Int32,System.Boolean,System.Drawing.Color)
Draws a vertical shadow edge.
g: Graphics object to draw with.
x: Offset of shadow edge.
y0: Start of shadow edge.
y1: End of shadow edge.
size: Length of cast shadow.
right: If true, shadow is drawn to the right of the elevated line.
color: Color at shadow edge.

Grasshopper.GUI.GH_GraphicsUtil.ShadowRectangle(System.Drawing.Graphics,System.Drawing.Rectangle,System.Int32,System.Int32)
Draws shadow edges on the interior of a rectangle.
g: Graphics object to draw with.
rec: Bounding rectangle.
size: Length of cast shadow.
darkness: Alpha component of darkness directly underneath the edge.

Grasshopper.GUI.GH_GraphicsUtil.ShadowRectangle(System.Drawing.Graphics,System.Drawing.Rectangle,System.Int32,System.Drawing.Color)
Draws shadow edges on the interior of a rectangle.
g: Graphics object to draw with.
rec: Bounding rectangle.
size: Length of cast shadow.
color: Color at edge of shadow.

Grasshopper.GUI.GH_GraphicsUtil.DentHorizontal(System.Drawing.Graphics,System.Drawing.Rectangle)
Draws a horizontal dent. A horizontal dent had dark lines along the top and bottom edges.
g: Graphics object to draw with.
box: Dimensions of the dent.

Grasshopper.GUI.GH_GraphicsUtil.DentHorizontal(System.Drawing.Graphics,System.Drawing.Rectangle,System.Int32,System.Int32)
Draws a horizontal dent. A horizontal dent had dark lines along the top and bottom edges.
g: Graphics object to draw with.
box: Dimensions of the dent.
alphaEdge: Transparency on the middle of the edges.
alphaFill: Transparency on the middle of the fill.

Grasshopper.GUI.GH_GraphicsUtil.DentVertical(System.Drawing.Graphics,System.Drawing.Rectangle)
Draws a vertical dent. A vertical dent had dark lines along the left and right edges.
g: Graphics object to draw with.
box: Dimensions of the dent.

Grasshopper.GUI.GH_GraphicsUtil.DentVertical(System.Drawing.Graphics,System.Drawing.Rectangle,System.Int32,System.Int32)
Draws a vertical dent. A vertical dent had dark lines along the left and right edges.
g: Graphics object to draw with.
box: Dimensions of the dent.
alphaEdge: Transparency on the middle of the edges.
alphaFill: Transparency on the middle of the fill.

Grasshopper.GUI.GH_GraphicsUtil.RenderVerticalString(System.Drawing.Graphics,System.String,System.Drawing.Font,System.Drawing.Color,System.Drawing.RectangleF,System.Drawing.StringFormat)
Render vertical text (rotated 90 degrees counter-clockwise) within a rectangle.
g: Graphics object to draw with.
text: Text to render.
font: Font to render with.
colour: Colour of text content.
format: Formatting flags.

Grasshopper.GUI.GH_GraphicsUtil.RenderUnscaledIcon(System.Drawing.Graphics,System.Drawing.Image,System.Int32,System.Int32)
Draws an image file at 1:1 scale centered on the given coordinates.
g: Graphics object to draw with.
icon: Image to draw.
cx: X center of image in Graphics coordinate.
cy: Y center of image in Graphics coordinate.

Grasshopper.GUI.GH_GraphicsUtil.RenderUnscaledIcon(System.Drawing.Graphics,System.Drawing.Image,System.Int32,System.Int32,System.Double)
Draws an image file at 1:1 scale centered on the given coordinates.
g: Graphics object to draw with.
icon: Image to draw.
cx: X center of image in Graphics coordinate.
cy: Y center of image in Graphics coordinate.
fade: Alpha fading factor.

Grasshopper.GUI.GH_GraphicsUtil.RenderCenteredIcon(System.Drawing.Graphics,System.Drawing.RectangleF,System.Drawing.Image)
Draw an icon centered in a frame. This code is not zoom-aware, but it will
perform consistent rounding (to avoid  pixel-jitter when moving the frame across the screen).
Icon will not be clipped to the frame.
g: Graphics object to render with.
frame: Frame to center icon in.
icon: Icon to render

Grasshopper.GUI.GH_GraphicsUtil.RenderCenteredIcon(System.Drawing.Graphics,System.Drawing.RectangleF,System.Drawing.Image,System.Single)
Draw an icon centered in a frame. This code is not zoom-aware, but it will
perform consistent rounding (to avoid  pixel-jitter when moving the frame across the screen).
Icon will not be clipped to the frame.
g: Graphics object to render with.
frame: Frame to center icon in.
icon: Icon to render

Grasshopper.GUI.GH_GraphicsUtil.RenderIcon(System.Drawing.Graphics,System.Drawing.RectangleF,System.Drawing.Image)
Render an icon into a frame. The icon is positioned in the center and will
be drawn at its own size multiplied by the system UiScale, provided it doesn't exceed the frame.
graphics: Graphics object to draw with.
frame: Limiting frame.
icon: Icon to draw.

Grasshopper.GUI.GH_GraphicsUtil.RenderCenteredIcon(System.Drawing.Graphics,System.Drawing.RectangleF,System.Drawing.Image,System.Double)
Draw an icon centered in a frame. This code is not zoom-aware, but it will
perform consistent rounding (to avoid  pixel-jitter when moving the frame across the screen).
Icon will not be clipped to the frame.
g: Graphics object to render with.
frame: Frame to center icon in.
icon: Icon to render
alpha: Transparency factor.

Grasshopper.GUI.GH_GraphicsUtil.CreateColourIcon(System.Int32,System.Int32,System.Drawing.Color)
Create a colour swatch icon.
width: Width of icon.
height: Height of icon.
colour: Colour for swatch, if colour contains an alpha component, you should draw an alpha-grid behind the icon.
Returns: A bitmap with the requested icon colour.

Grasshopper.GUI.GH_GraphicsUtil.RenderColourIcon(System.Drawing.Graphics,System.Drawing.Rectangle,System.Drawing.Color)
Render a colour icon into a graphics context. A colour icon contains a black outer and white inner edge.
g: Graphics object to draw with.
rec: Rectangle describing icon dimensions.
colour: Colour for icon.

Grasshopper.GUI.GH_GraphicsUtil.RenderColourIcon(System.Drawing.Graphics,System.Drawing.Rectangle,System.Drawing.Color,System.Single)
Render a colour icon into a graphics context. A colour icon contains a black outer and white inner edge.
g: Graphics object to draw with.
rec: Rectangle describing icon dimensions.
colour: Colour for icon.
scale: Scale adjustment.

Grasshopper.GUI.GH_GraphicsUtil.RenderObjectOverlay(System.Drawing.Graphics,Grasshopper.Kernel.IGH_DocumentObject,System.Drawing.RectangleF)
Render all overlay icons for a specific object.
Overlays aren't drawn when the zoom is less than 80%
graphics: Graphics object to draw with.
obj: Object to draw overlay for.
target: Destination area for overlay icons.

Grasshopper.GUI.GH_GraphicsUtil.RenderObjectOverlay(System.Drawing.Graphics,Grasshopper.Kernel.IGH_ObjectProxy,System.Drawing.RectangleF)
Render all overlay icons for a specific object.
Overlays aren't drawn when the zoom is less than 80%
graphics: Graphics object to draw with.
obj: Proxy to draw overlay for.
target: Destination area for overlay icons.

Grasshopper.GUI.GH_GraphicsUtil.TransparencyMatrix(System.Int32)
Create an image transparency matrix for a specific blending factor.
alpha: Alpha level of color matrix.

Grasshopper.GUI.GH_GraphicsUtil.TransparencyMatrix(System.Double)
Create an image transparency matrix for a specific blending factor.
fade: Alpha fade amount. 0.0=complete transparency, 1.0=original transparency.

Grasshopper.GUI.GH_GraphicsUtil.RenderFadedImage(System.Drawing.Graphics,System.Drawing.Image,System.Drawing.Rectangle,System.Int32)
Render an icon into a rectangle with a specific fading factor.
graphics: Graphics object to draw with.
image: Image to draw.
destination: Destination rectangle.
alpha: Alpha value. 0=completely transparent, 255=original transparency.

Grasshopper.GUI.GH_GraphicsUtil.RenderFadedImage(System.Drawing.Graphics,System.Drawing.Image,System.Drawing.Rectangle,System.Double)
Render an icon into a rectangle with a specific fading factor.
graphics: Graphics object to draw with.
image: Image to draw.
destination: Destination rectangle.
fade: Fading amount. 0.0=completely transparent, 1.0=original transparency.

Grasshopper.GUI.GH_GraphicsUtil.RenderWarningIcon(System.Drawing.Graphics,System.Drawing.PointF,System.Single,System.Int32)
Render a typical warning icon into a graphics context.
A warning icon is an upright yellow triangle.
graphics: Graphics object to draw with.
center: Center of icon.
radius: Radius of icon.
alpha: Transparency of icon.

Grasshopper.GUI.GH_GraphicsUtil.RenderRoundBar(System.Drawing.Graphics,System.Drawing.RectangleF,System.Drawing.Color)
Render a cylinder shaped object with round caps.
graphics: Graphics object to draw with.
rec: Rectangle containing shape.
colour: Fill colour of shape.

Grasshopper.GUI.GH_GraphicsUtil.RenderCenteredText(System.Drawing.Graphics,System.String,System.Drawing.Font,System.Drawing.Color,System.Drawing.PointF)
Render a bit of text centered on a point.
g: Graphics object to draw with.
text: Text to draw.
font: Font to use.
color: Text color.
center: Center point.

Grasshopper.GUI.GH_GraphicsUtil.RenderTag(System.Drawing.Graphics,System.String,System.Drawing.Font,System.Drawing.Color,System.Drawing.Color,System.Drawing.RectangleF,System.Drawing.StringAlignment,System.Drawing.StringAlignment)
Render a text tag into a Graphics surface.
g: Graphics object to draw with.
tag: Text to draw.
font: Font to use.
backColor: Tag background colour.
foreColor: Tag foreground colour.
frame: The frame into which the tags should be aligned.
alignH: Horizontal alignment.
alignV: Vertical alignment.
This example shows how to render the 8 corner and edge tags into a rectangle:
Function RenderCornerAndEdgeTags(ByVal G As Graphics, ByVal frame As RectangleF)
Dim font As New Font("Courier New", 8)
Dim bg As Color = Color.White
Dim fg As Color = Color.Black
'Render the 4 corner tags
RenderTag(G, "UL", font, bg, fg, frame, StringAlignment.Near, StringAlignment.Near)
RenderTag(G, "UR", font, bg, fg, frame, StringAlignment.Far, StringAlignment.Near)
RenderTag(G, "LR", font, bg, fg, frame, StringAlignment.Far, StringAlignment.Far)
RenderTag(G, "LL", font, bg, fg, frame, StringAlignment.Near, StringAlignment.Far)
'Render the 4 edge tags
RenderTag(G, "T", font, bg, fg, frame, StringAlignment.Center, StringAlignment.Near)
RenderTag(G, "R", font, bg, fg, frame, StringAlignment.Far, StringAlignment.Center)
RenderTag(G, "B", font, bg, fg, frame, StringAlignment.Center, StringAlignment.Far)
RenderTag(G, "L", font, bg, fg, frame, StringAlignment.Near, StringAlignment.Center)
End Function

Grasshopper.GUI.GH_GraphicsUtil.RenderBalloonTag(System.Drawing.Graphics,System.String,System.Drawing.PointF,System.Drawing.RectangleF)
Draw a default balloon tag in a container.
g: Graphics object to draw with.
text: Text of tag.
tip: Tip of balloon.
container: Container for balloon.

Grasshopper.GUI.GH_GraphicsUtil.RenderBalloonTag(System.Drawing.Graphics,System.String,System.Drawing.Font,System.Drawing.PointF,System.Drawing.RectangleF)
Draw a default balloon tag in a container with a Font override.
g: Graphics object to draw with.
text: Text of tag.
font: Font of tag.
tip: Tip of balloon.
container: Container for balloon.

Grasshopper.GUI.GH_GraphicsUtil.RenderBalloonTag(System.Drawing.Graphics,System.String,System.Drawing.Font,System.Drawing.Color,System.Drawing.Color,System.Drawing.PointF,System.Drawing.RectangleF)
Draw a balloon tag in a container.
g: Graphics object to draw with.
text: Text of tag.
font: Font of tag.
backColor: Background colour of balloon.
foreColor: Foreground colout of balloon edge and text.
tip: Tip of balloon (should be inside container).
container: Container for balloon.

Grasshopper.GUI.GH_GraphicsUtil.RenderBalloonTag(System.Drawing.Graphics,System.String,System.Drawing.Font,System.Drawing.Color,System.Drawing.Color,System.Drawing.PointF,System.Boolean)
Draw a balloon tag in a container.
g: Graphics object to draw with.
text: Text of tag.
font: Font of tag.
backColor: Background colour of balloon.
foreColor: Foreground colour of balloon edge and text.
tip: Tip of balloon.
upright: If true, the balloon will be above the tip point.

Grasshopper.GUI.GH_GraphicsUtil.BoxClosestArcPoint(System.Drawing.PointF,System.Drawing.RectangleF)
Find the closest point on or in a box given a test point. Arc extension is implied.
pt: Sample point.
box: Box to evaluate.

Grasshopper.GUI.GH_GraphicsUtil.BoxClosestPoint(System.Drawing.PointF,System.Drawing.RectangleF)
Find the closest point on or in a box given a test point.
pt: Sample point.
box: Box to evaluate.

Grasshopper.GUI.GH_GraphicsUtil.BoxClosestPoint(System.Drawing.Point,System.Drawing.Rectangle)
Find the closest point on or in a box given a test point.
pt: Sample point.
box: Box to evaluate.

Grasshopper.GUI.GH_GraphicsUtil.BoxFurthestPoint(System.Drawing.PointF,System.Drawing.RectangleF)
Find the furthest point on or in a box given a test point.
pt: Sample point.
box: Box to evaluate.

Grasshopper.GUI.GH_GraphicsUtil.BoxFurthestPoint(System.Drawing.Point,System.Drawing.Rectangle)
Find the furthest point on or in a box given a test point.
pt: Sample point.
box: Box to evaluate.

Grasshopper.GUI.GH_GraphicsUtil.BoxViewCone(System.Drawing.PointF,System.Drawing.RectangleF)
Computes the graphicspath that represents the viewcone for a point and a rectangle.
If the rectangle contains the point, null is returned.

Grasshopper.GUI.GH_GraphicsUtil.SolveArc(System.Drawing.PointF,System.Drawing.PointF,System.Drawing.SizeF,System.Drawing.RectangleF@,System.Single@,System.Single@)
Create a GDI circular arc definition from start-point, end-point and tangent direction.
p0: Start point of arc.
p1: End point of arc.
dir: Tangent direction at start of arc.
box: Bounding box of arc (out)
angle: Start angle of arc (out)
sweep: Sweep angle of arc (out)
Returns: True on success, false on failure.

Grasshopper.GUI.GH_GraphicsUtil.SolveArc(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.RectangleF@,System.Single@,System.Single@)
Create a GDI circular arc definition from start-point, end-point and tangent direction.
p0: Start point of arc.
p1: End point of arc.
dir: Tangent direction at start of arc.
box: Bounding box of arc (out)
angle: Start angle of arc (out)
sweep: Sweep angle of arc (out)
Returns: True on success, false on failure.

Grasshopper.GUI.GH_GraphicsUtil.SolveArc(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Drawing.RectangleF@,System.Single@,System.Single@)
Create a GDI circular arc definition from start-point, end-point and tangent direction.

Grasshopper.GUI.GH_GraphicsUtil.AppendArc(System.Drawing.PointF,System.Drawing.PointF,System.Drawing.SizeF,System.Drawing.Drawing2D.GraphicsPath)
Append an arc segment to a GraphicsPath. If the arc cannot be solved,
a linear segment is appended instead.
p0: Start point of arc.
p1: End point of arc.
dir: Tangent direction at start of arc.
path: Path to append to.

Grasshopper.GUI.GH_GraphicsUtil.AppendArc(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Drawing2D.GraphicsPath)
Append an arc segment to a GraphicsPath. If the arc cannot be solved,
a linear segment is appended instead.
p0: Start point of arc.
p1: End point of arc.
dir: Tangent direction at start of arc.
path: Path to append to.