Grasshopper.GUI.GH_MessageMustReadWindow


Grasshopper.GUI.GH_MessageMustReadWindow.Delay
Gets or sets the delay (in seconds) before this dialog can be closed.
Once the dialog is visible, changing the delay won't have any effect.

Grasshopper.GUI.GH_MessageMustReadWindow.Title
Gets or sets the text displayed as the title for this dialog.

Grasshopper.GUI.GH_MessageMustReadWindow.Content
Gets or sets the text displayed as the content for this dialog.