Grasshopper.GUI.Canvas.GH_Border
Represents a resizing border of a Grasshopper canvas object.

Grasshopper.GUI.Canvas.GH_Border.#ctor(System.Drawing.RectangleF,Grasshopper.GUI.Canvas.GH_BorderTopology)
Create a new border.
rectangle: Shape of border.
topology: Border topology.

Grasshopper.GUI.Canvas.GH_Border.Region
Gets the shape of the border.

Grasshopper.GUI.Canvas.GH_Border.Topology
Gets the type of border.

Grasshopper.GUI.Canvas.GH_Border.Contains(System.Drawing.PointF)
Test a point for border inclusion.
pt: Point to test.
Returns: True if pt is inside or on this border.

Grasshopper.GUI.Canvas.GH_Border.Size_Cursor
Gets the cursor associated with this border.

Grasshopper.GUI.Canvas.GH_Border.CreateBorders(System.Drawing.RectangleF,System.Int32)
Static (Shared) method for creating a set of borders.
box: Box for border creation.
borderSize: The width of all borders.
Returns: A list of borders.

Grasshopper.GUI.Canvas.GH_Border.CreateBorders(System.Drawing.RectangleF,System.Int32,System.Int32)
Static (Shared) method for creating a set of borders.
box: Box for border creation.
borderWidth: The width of all vertical.
borderHeight: The height of all horizontal borders.
Returns: A list of borders.

Grasshopper.GUI.Canvas.GH_Border.CreateBorders(System.Drawing.RectangleF,System.Windows.Forms.Padding)
Static (Shared) method for creating a set of borders.
box: Box for border creation.
padding: The size of the borders along all four edges.
Returns: A list of borders.

Grasshopper.GUI.Canvas.GH_Border.CreateBorders(System.Drawing.RectangleF,System.Int32,System.Int32,System.Int32,System.Int32)
Static (Shared) method for creating a set of borders.
box: Box for border creation.
borderLeft: Width of the leftmost border.
borderRight: Width of the rightmost border.
borderTop: Width of the topmost border.
borderBottom: Width of the bottommost border.
Returns: A list of borders.