Grasshopper.Kernel.GH_AssemblyPriority
Derive from this class if you wish to perform additional steps before any of your components are loaded.
Any class in your project which inherits from GH_AssemblyPriority and which has an
empty constructor will be instantiated prior to any GH_Component or IGH_DocumentObject classes.

Grasshopper.Kernel.GH_AssemblyPriority.PriorityLoad
This method will be called exactly once before any of the Components in your project are loaded.
Returns: Loading instruction. If you wish to abort the loading of your project,
then return GH_LoadingInstruction.Abort.