Grasshopper.My.Resources.Res_GUI
A strongly-typed resource class, for looking up localized strings, etc.

Grasshopper.My.Resources.Res_GUI.ResourceManager
Returns the cached ResourceManager instance used by this class.

Grasshopper.My.Resources.Res_GUI.Culture
Overrides the current thread's CurrentUICulture property for all
resource lookups using this strongly typed resource class.

Grasshopper.My.Resources.Res_GUI.Alpha_Background_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.AutosaveWarning
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Bitmap_Dimensions_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.BloodDrip_48x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.BoldFont_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Close_Toolbar_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Close_Toolbar_Active_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.ClusterInstances_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Collapse_7x7
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Collapsed_11x11
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Colour_Mode_HSV_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Colour_Mode_RGB_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Colour_Mode_SRC_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.ColourWheel
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.CroppingFrame_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.DataRecorder_ClearActive
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.DataRecorder_ClearInactive
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.DataRecorder_RecordActive
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.DataRecorder_RecordInactive
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.DigitScrollTextInput_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.DigitScrollTextInputInactive_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.DisplayVersion_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Doc_Aborted_48x48
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.DragWindow_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.DropDown_11x11
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Expand_7x7
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Expanded_11x11
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Filter_Brep_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Filter_BrepInactive_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Filter_Curve_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Filter_CurveInactive_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Filter_Mesh_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Filter_MeshInactive_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Filter_Point_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Filter_PointInactive_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.FocusFrame_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.ForgetSettings_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.FormattingSettings_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Generic_Library_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Generic_OpenFile_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Generic_Variations_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.GracehopperBug
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Gradient_AddGrip_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.GrasshopperRemotePanel_16x16
Looks up a localized resource of type System.Drawing.Icon similar to (Icon).

Grasshopper.My.Resources.Res_GUI.Grip_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Grip_7x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.IconMarker_72x72
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.ItalicFont_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.KurtGodelLightCone
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.LayoutDeleteActive_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.LayoutDeleteInactive_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.LayoutEditActive_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.LayoutEditInactive_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.LayoutInvisible_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.LayoutVisible_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Locked_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Locked_40x40
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Mapping_Operator_14x15
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Margin_Horizontal_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Margin_Vertical_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.MenuShortCutConflict_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.ObjectMarker_96x96
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Open_Toolbar_Active_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.OpenCluster_Empty_63x56
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Panel_AlignCenter_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Panel_AlignLeft_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Panel_AlignRight_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Panel_DecreaseFont_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Panel_DrawIndices_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Panel_DrawPaths_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Panel_IncreaseFont_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Panel_MultiLine_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Panel_PickColour_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Panel_PickFont_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Panel_SpecialCodes_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Panel_Wrap_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Pause_Symbol_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Play_Symbol_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Prudery_High_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Prudery_Highest_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Prudery_Low_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Prudery_Lowest_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Prudery_Medium_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.RibbonLayout_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.RibbonLayoutExposure_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.RibbonLayoutInsert_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.RibbonLayoutItem_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.RibbonLayoutItems_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.RibbonLayoutPanel_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.RibbonLayoutTab_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Scroll_12x12
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.ShrinkScriptEditor_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Slider_Even_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Slider_Float_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Slider_Integer_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Slider_Odd_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.StripePattern_48x48
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.TabMarker_96x96
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.TimersBlocked_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.TimersBlocked_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.TimersFree_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.trashcan_closed
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.trashcan_open
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Unlocked_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.Viewport_Dimensions_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.ViewportFrame_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_GUI.VoronoiOverdoseWarning
Looks up a localized resource of type System.Drawing.Bitmap.