Grasshopper.Kernel.GH_ObjectSpecies
Contains all object species.

Grasshopper.Kernel.GH_ObjectSpecies.none
Indicates no object type

Grasshopper.Kernel.GH_ObjectSpecies.doc_object
Represents any object that implements IGH_DocumentObject

Grasshopper.Kernel.GH_ObjectSpecies.parameter
Indicates classes that implement IGH_Param

Grasshopper.Kernel.GH_ObjectSpecies.component
Indicates classes that implement IGH_Component
Remarks:

Grasshopper.Kernel.GH_ObjectSpecies.group
Indicates classes of type GH_Group
Remarks:

Grasshopper.Kernel.GH_ObjectSpecies.wire
Currently this is not yet an object type.

Grasshopper.Kernel.GH_ObjectSpecies.grip_in
Represents an input grip.

Grasshopper.Kernel.GH_ObjectSpecies.grip_out
Represents an output grip.

Grasshopper.Kernel.GH_ObjectSpecies.grip
Represents an input or output grip.

Grasshopper.Kernel.GH_ObjectSpecies.balloon
Represents an attribute balloon.

Grasshopper.Kernel.GH_ObjectSpecies.any
Indicates all object types.