Grasshopper.Kernel.GH_Document.GH_UndoUtil
This class is emitted by the Undo property of a GH_Document instance.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.RecordEvent(Grasshopper.Kernel.Undo.GH_UndoRecord)
Add a new record to the undo stack of the owner document.
record: Undo record to add.
Returns: The ID of the newly added undo record or Guid.Empty on failure.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.RecordEvent(System.String,Grasshopper.Kernel.Undo.IGH_UndoAction)
Add a new record to the undo stack of the owner document.
name: Name of undo record.
action: Undo action.
Returns: The ID of the newly added undo record or Guid.Empty on failure.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.RecordEvent(System.String,Grasshopper.Kernel.Undo.IGH_UndoAction[])
Add a new record to the undo stack of the owner document.
name: Name of undo record.
actions: Undo actions.
Returns: The ID of the newly added undo record or Guid.Empty on failure.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.RecordEvent(System.String,System.Collections.Generic.IEnumerable{Grasshopper.Kernel.Undo.IGH_UndoAction})
Add a new record to the undo stack of the owner document.
name: Name of undo record.
actions: Undo actions.
Returns: The ID of the newly added undo record or Guid.Empty on failure.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.MergeRecords(System.Int32)
Attempt to merge the N most recent records into one.
The name of the merged record will be identical to the
name of the oldest record.
count: Number of most recent records to merge.
Returns: True if merge was successful.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.CreatePivotEvent(System.String,Grasshopper.Kernel.IGH_DocumentObject)
Create a new undo record for a single pivot change.
This function must be called before the pivot is changed.
name: Name of undo record.
obj: Target object for undo record.
Returns: A newly created undo record.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.RecordPivotEvent(System.String,Grasshopper.Kernel.IGH_DocumentObject)
Create and Record a new PivotChanged undo record.
name: Name of undo record.
obj: Target object for undo record.
Returns: The ID of the newly added undo record or Guid.Empty on failure.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.CreatePivotEvent(System.String,System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_DocumentObject})
Create a new undo record for a bunch of pivot changes.
This function must be called before the pivots are changed.
name: Name of undo record.
objs: Target objects for undo record.
Returns: A newly created undo record.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.RecordPivotEvent(System.String,System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_DocumentObject})
Create and Record a new PivotChanged undo record.
name: Name of undo record.
objs: Target objects for undo record.
Returns: The ID of the newly added undo record or Guid.Empty on failure.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.CreateLayoutEvent(System.String,Grasshopper.Kernel.IGH_DocumentObject)
Create a new undo record for a single object layout change.
This function must be called before the layout is changed.
name: Name of undo record.
obj: Target object for undo record.
Returns: A newly created undo record.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.RecordLayoutEvent(System.String,Grasshopper.Kernel.IGH_DocumentObject)
Create and Record a new LayoutChanged undo record.
name: Name of undo record.
obj: Target object for undo record.
Returns: The ID of the newly added undo record or Guid.Empty on failure.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.CreateLayoutEvent(System.String,System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_DocumentObject})
Create a new undo record for a bunch of object layout changes.
This function must be called before the layouts are changed.
name: Name of undo record.
objs: Target objects for undo record.
Returns: A newly created undo record.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.RecordLayoutEvent(System.String,System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_DocumentObject})
Create and Record a new LayoutChanged undo record.
name: Name of undo record.
objs: Target objects for undo record.
Returns: The ID of the newly added undo record or Guid.Empty on failure.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.CreateNickNameEvent(System.String,Grasshopper.Kernel.IGH_DocumentObject)
Create a new undo record for an object nickname change.
This function must be called before the nickname is changed.
name: Name of undo record.
obj: Target object for undo record.
Returns: A newly created undo record.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.RecordNickNameEvent(System.String,Grasshopper.Kernel.IGH_DocumentObject)
Create and Record a new NickNameChanged undo record.
name: Name of undo record.
obj: Target object for undo record.
Returns: The ID of the newly added undo record or Guid.Empty on failure.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.CreatePreviewEvent(System.String,Grasshopper.Kernel.IGH_ActiveObject)
Create a new undo record for an object preview change.
This function must be called before the preview is changed.
name: Name of undo record.
obj: Target object for undo record.
Returns: A newly created undo record.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.RecordPreviewEvent(System.String,Grasshopper.Kernel.IGH_ActiveObject)
Create and Record a new PreviewChanged undo record.
name: Name of undo record.
obj: Target object for undo record.
Returns: The ID of the newly added undo record or Guid.Empty on failure.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.CreateEnabledEvent(System.String,Grasshopper.Kernel.IGH_ActiveObject)
Create a new undo record for an object enabled change.
This function must be called before the enabled flag is changed.
name: Name of undo record.
obj: Target object for undo record.
Returns: A newly created undo record.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.RecordEnabledEvent(System.String,Grasshopper.Kernel.IGH_ActiveObject)
Create and Record a new EnabledChanged undo record.
name: Name of undo record.
obj: Target object for undo record.
Returns: The ID of the newly added undo record or Guid.Empty on failure.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.CreateWireEvent(System.String,Grasshopper.Kernel.IGH_Param)
Create a new undo record for a set of Connector wire changes.
This function must be called before the wires are changed.
name: Name of undo record.
param: Target object for undo record.
Returns: A newly created undo record.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.RecordWireEvent(System.String,Grasshopper.Kernel.IGH_Param)
Create and Record a new WiresChanged undo record.
name: Name of undo record.
param: Target parameter for undo record.
Returns: The ID of the newly added undo record or Guid.Empty on failure.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.CreateWireEvent(System.String,System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_Param})
Create a new undo record for a set of Connector wire changes.
This function must be called before the wires are changed.
name: Name of undo record.
params: Target parameters for undo record.
Returns: A newly created undo record.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.RecordWireEvent(System.String,System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_Param})
Create and Record a new WiresChanged undo record.
name: Name of undo record.
params: Target parameters for undo record.
Returns: The ID of the newly added undo record or Guid.Empty on failure.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.CreateAddObjectEvent(System.String,Grasshopper.Kernel.IGH_DocumentObject)
Create a new undo record for a single object addition.
name: Name of undo record.
obj: Object to be added.
Returns: A newly created undo record.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.RecordAddObjectEvent(System.String,Grasshopper.Kernel.IGH_DocumentObject)
Create and Record a new ObjectAdded undo record.
name: Name of undo record.
obj: Target object for undo record.
Returns: The ID of the newly added undo record or Guid.Empty on failure.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.CreateAddObjectEvent(System.String,System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_DocumentObject})
Create a new undo record for a bunch of object additions.
name: Name of undo record.
objs: Objects to be added.
Returns: A newly created undo record.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.RecordAddObjectEvent(System.String,System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_DocumentObject})
Create and Record a new ObjectAdded undo record.
name: Name of undo record.
objs: Target objects for undo record.
Returns: The ID of the newly added undo record or Guid.Empty on failure.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.CreateRemoveObjectEvent(System.String,Grasshopper.Kernel.IGH_DocumentObject)
Create a new undo record for a single object removal.
name: Name of undo record.
obj: Object to be removed.
Returns: A newly created undo record.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.RecordRemoveObjectEvent(System.String,Grasshopper.Kernel.IGH_DocumentObject)
Create and Record a new ObjectRemoved undo record.
name: Name of undo record.
obj: Target object for undo record.
Returns: The ID of the newly added undo record or Guid.Empty on failure.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.CreateRemoveObjectEvent(System.String,System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_DocumentObject})
Create a new undo record for a bunch of object removals.
name: Name of undo record.
objs: Objects to be removed.
Returns: A newly created undo record.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.RecordRemoveObjectEvent(System.String,System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_DocumentObject})
Create and Record a new ObjectRemoved undo record.
name: Name of undo record.
objs: Target objects for undo record.
Returns: The ID of the newly added undo record or Guid.Empty on failure.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.CreateGenericObjectEvent(System.String,Grasshopper.Kernel.IGH_DocumentObject)
Create a new undo record for a generic, single object change.
name: Name of undo record.
obj: Object to be recorded.
Returns: A newly created undo record.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.RecordGenericObjectEvent(System.String,Grasshopper.Kernel.IGH_DocumentObject)
Create and Record a new ObjectChanged undo record.
name: Name of undo record.
obj: Target object for undo record.
Returns: The ID of the newly added undo record or Guid.Empty on failure.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.CreatePersistentDataEvent``1(System.String,Grasshopper.Kernel.GH_PersistentParam{``0})
Create a new undo record for a single object persistent data change.
name: Name of undo record.
obj: Object to be recorded.
Returns: A newly created undo record.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.RecordPersistentDataEvent``1(System.String,Grasshopper.Kernel.GH_PersistentParam{``0})
Create and Record a new PersistentDataChanged undo record.
name: Name of undo record.
obj: Target object for undo record.
Returns: The ID of the newly added undo record or Guid.Empty on failure.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.CreateRemoveStateEvent(System.String,System.Int32,Grasshopper.Kernel.GH_State)
Create a new undo record for a single solution state removal.
name: Name of undo record.
stateIndex: Index of state.
state: Solution state.
Returns: A newly created undo record.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.RecordRemoveStateEvent(System.String,System.Int32,Grasshopper.Kernel.GH_State)
Create and Record a new CreateRemoveStateEvent undo record.
name: Name of undo record.
stateIndex: Index of state.
state: Solution state.
Returns: The ID of the newly added undo record or Guid.Empty on failure.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.CreateAddStateEvent(System.String,System.Int32,Grasshopper.Kernel.GH_State)
Create a new undo record for a single solution state addition.
name: Name of undo record.
stateIndex: Index of state.
state: Solution state.
Returns: A newly created undo record.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.RecordAddStateEvent(System.String,System.Int32,Grasshopper.Kernel.GH_State)
Create and Record a new CreateAddStateEvent undo record.
name: Name of undo record.
stateIndex: Index of state.
state: Solution state.
Returns: The ID of the newly added undo record or Guid.Empty on failure.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.CreateReplaceStateEvent(System.String,System.Int32,Grasshopper.Kernel.GH_State,Grasshopper.Kernel.GH_State)
Create a new undo record for a single solution state addition.
name: Name of undo record.
stateIndex: Index of state.
oldState: Solution state to remove.
newState: Solution state to insert.
Returns: A newly created undo record.

Grasshopper.Kernel.GH_Document.GH_UndoUtil.RecordReplaceStateEvent(System.String,System.Int32,Grasshopper.Kernel.GH_State,Grasshopper.Kernel.GH_State)
Create and Record a new CreateReplaceStateEvent undo record.
name: Name of undo record.
stateIndex: Index of state.
oldState: Solution state to remove.
newState: Solution state to insert.
Returns: The ID of the newly added undo record or Guid.Empty on failure.