Grasshopper.Kernel.Geometry.Delaunay.EdgeList
Provides fast access to a collection of edges

Grasshopper.Kernel.Geometry.Delaunay.EdgeList.#ctor(System.Collections.Generic.List{Grasshopper.Kernel.Geometry.Delaunay.FaceEx})
Creates a collection of edges from a list of Faces (no nulls allowed)
F: Faces

Grasshopper.Kernel.Geometry.Delaunay.EdgeList.#ctor(System.Collections.Generic.List{Grasshopper.Kernel.Geometry.Delaunay.Face})
Creates a collection of edges from a list of Faces (no nulls allowed)
F: Faces