Grasshopper.Kernel.GH_SettingsServer
A single instance of this class is maintained at module level under the
accessor "Settings".

Grasshopper.Kernel.GH_SettingsServer.#ctor(System.String)
Create a new instance of the GH_SettingsServer class. The server
will be associated with a settings xml file in the %ApplicationData%\Grasshopper\ directory.
If a file with the same name already exists, its settings will be automatically loaded.
databaseName: The name of the settings server
(equals the name of the xml file so it must adhere to FAT, FAT32 and NTFS naming conventions).

Grasshopper.Kernel.GH_SettingsServer.#ctor(System.String,System.Boolean)
Create a new instance of the GH_SettingsServer class. The server
will be associated with a settings xml file in the %ApplicationData%\Grasshopper\ directory.
databaseName: The name of the settings server
(equals the name of the xml file so it must adhere to FAT, FAT32 and NTFS naming conventions).
loadSettings: When true and a file with the same name already exists, its settings will be automatically loaded.

Grasshopper.Kernel.GH_SettingsServer.DatabaseName
Gets the name of this settings database.

Grasshopper.Kernel.GH_SettingsServer.Count
Gets the total number of settings stored in this database.

Grasshopper.Kernel.GH_SettingsServer.ConstainsEntry(System.String)
Tests to see if a given entry is stored in this settings database.
name: Entry name to query.
Returns: True if the entry exists, false otherwise.

Grasshopper.Kernel.GH_SettingsServer.EntryType(System.String)
Gets the type of a specific entry.
name: Name of entry.
Returns: Type of entry. If entry doesn't exist, GH_SettingsType._unknown is returned.

Grasshopper.Kernel.GH_SettingsServer.EntryNames
Gets a list of all the entry names in this settings.

Grasshopper.Kernel.GH_SettingsServer.Search(System.String)
Find all the settings in this table that adhere to a certain search pattern.
pattern: Textual search pattern.
Returns: List of all settings that match the pattern.

Grasshopper.Kernel.GH_SettingsServer.WritePersistentSettings
Store all settings in the xml file now.
You must call this function if you want the current settings to persist between sessions.

Grasshopper.Kernel.GH_SettingsServer.ReadPersistentSettings
Read all the settings stored in the registry or the settings file.
This happens automatically whenever you construct the Settings Server,
so you typically should never have to do this.

Grasshopper.Kernel.GH_SettingsServer.Write(GH_IO.Serialization.GH_IWriter)
Low-level serializer.
writer: Object to write with. Writer must represent an empty archive chunk.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_SettingsServer.Read(GH_IO.Serialization.GH_IReader)
Low-level deserializer.
reader: Object to read from.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_SettingsServer.Clear
Destroy all settings.