Grasshopper.Kernel.GH_DocModifiedEventArgs
These arguments are passed along with ModifiedChanged events on GH_Document.

Grasshopper.Kernel.GH_DocModifiedEventArgs.Document
Gets the document that raised the event.

Grasshopper.Kernel.GH_DocModifiedEventArgs.Modified
Gets the value of the document Modified flag at the time the event was raised,
it may have been changed in between by other event handlers.