Grasshopper.Kernel.GH_Author
Maintains author information such as name, company, copyright, address etc.

Grasshopper.Kernel.GH_Author.IsEmpty
Gets whether any of the fields have been assigned.

Grasshopper.Kernel.GH_Author.Clear
Erase all fields.