Grasshopper.Kernel.IGH_BakeAwareData
Implement this interface in your IGH_Goo data type if you want to
be included in baking operations.

Grasshopper.Kernel.IGH_BakeAwareData.BakeGeometry(Rhino.RhinoDoc,Rhino.DocObjects.ObjectAttributes,System.Guid@)
Bake an object in the given Rhino document.
doc: Document to bake into.
att: Attributes to bake with (should not be null).
obj_guid: The id of the baked object.
Returns: True on success. If False, obj_guid and obj_inst are not guaranteed to be valid pointers.