Grasshopper.Kernel.Special.GH_DigitScroller


Grasshopper.Kernel.Special.GH_DigitScroller.Scroller
Gets the internal slider instance.

Grasshopper.Kernel.Special.GH_DigitScroller.ImpliedNickName
Gets the implied nickname for this scroller object.
The implied nickname is just like the regular nickname,
except when the regular nickname equals "" and
there is a single recipient parameter, in which case the nickname
is inherited from the recipient.