Grasshopper.Kernel.Parameters.Param_GenericObject


Grasshopper.Kernel.Parameters.Param_GenericObject.GenericDataCleanup(Grasshopper.Kernel.Data.GH_Structure{Grasshopper.Kernel.Types.IGH_Goo})
Utility function for cleaning generic data structures. This method will simplify
items stored in a GH_Structure(Of IGH_Goo) if this is a lossless conversion.
data: Structure to clean.

Grasshopper.Kernel.Parameters.Param_GenericObject.RepairReferencedData(Grasshopper.Kernel.Data.GH_Structure{Grasshopper.Kernel.Types.IGH_Goo})
Test all data inside a tree and attempt to repair references to Rhino objects.

Grasshopper.Kernel.Parameters.Param_GenericObject.AngleParameter
Gets or sets a value indicating whether this parameter behaves as an angle.
If IsAngleParameter = True, then a Degrees/Radians option will be available in the menu.

Grasshopper.Kernel.Parameters.Param_GenericObject.UseDegrees
Gets or sets whether this parameter uses degrees instead of radians.