Grasshopper.Kernel.IGH_UpgradeObject
Create a class with an empty constructor that implements this interface if you
want to provide an upgrade mechanism.

Grasshopper.Kernel.IGH_UpgradeObject.Version
Return a DateTime object that indicates when this upgrade mechanism was written,
so that it becomes possible to distinguish competing upgrade mechanisms.

Grasshopper.Kernel.IGH_UpgradeObject.UpgradeFrom
Gets the ComponentGuid of the old object (the object to be updated).

Grasshopper.Kernel.IGH_UpgradeObject.UpgradeTo
Gets the ComponentGuid of the new object (the object that will be inserted).

Grasshopper.Kernel.IGH_UpgradeObject.Upgrade(Grasshopper.Kernel.IGH_DocumentObject,Grasshopper.Kernel.GH_Document)
Upgrade an existing object.
target: Object to upgrade.
document: Document that contains the object.
Returns: The newly created object on success, null on failure.