Grasshopper.GUI.Base.GH_DigitNumber
Maintains and provides functionality for evaluating and modifying numbers as used in the GH_DigitScrollerBase control.

Grasshopper.GUI.Base.GH_DigitNumber.#ctor(System.Int32)
Create a new GH_DigitNumber instance with the specified number of decimal places.
decimalPlaces: Amount of decimal places.

Grasshopper.GUI.Base.GH_DigitNumber.#ctor(System.Int32,System.Int32)
Create a new GH_DigitNumber instance with the specified number of decimal places and a given radix position.
decimalPlaces: Amount of decimal places
radixPosition: Index of radix symbol, -1 to disable the radix altogether.

Grasshopper.GUI.Base.GH_DigitNumber.#ctor(Grasshopper.GUI.Base.GH_DigitNumber)
Create an exact duplicate of another GH_DigitNumber instance.
other: Number to copy.

Grasshopper.GUI.Base.GH_DigitNumber.Value
Gets or sets the value of this number.

Grasshopper.GUI.Base.GH_DigitNumber.Epsilon
Gets the smallest possible change.

Grasshopper.GUI.Base.GH_DigitNumber.DigitCount
Gets or sets the amount of digits in this number.

Grasshopper.GUI.Base.GH_DigitNumber.Radix
Gets or sets the radix point index. A negative radix index disables the radix point,
zero is not a valid index.

Grasshopper.GUI.Base.GH_DigitNumber.RadixIndex
Gets the mapped radix.

Grasshopper.GUI.Base.GH_DigitNumber.PrimaryPositive
Gets or sets a value indicating whether the number is positive.

Grasshopper.GUI.Base.GH_DigitNumber.SecondaryPositive
Gets a value indicating whether the secondary number is positive.

Grasshopper.GUI.Base.GH_DigitNumber.Offset
Gets the offset between the primary and secondary digits.

Grasshopper.GUI.Base.GH_DigitNumber.PrimaryDigits
Gets the internal list of primary digits. Do not modify this list.

Grasshopper.GUI.Base.GH_DigitNumber.SecondaryDigits
Gets the internal list of secondary digits. Do not modify this list.

Grasshopper.GUI.Base.GH_DigitNumber.Maximum
Gets the maximum value allowed in this number.

Grasshopper.GUI.Base.GH_DigitNumber.Minimum
Gets the minimum value allowed in this number.

Grasshopper.GUI.Base.GH_DigitNumber.IsPrimaryDigitSignificant(System.Int32)
Gets whether the primary digit at the given index is significant.
index: Index of digit to test.

Grasshopper.GUI.Base.GH_DigitNumber.IsSecondaryDigitSignificant(System.Int32)
Gets whether the secondary digit at the given index is significant.
index: Index of digit to test.

Grasshopper.GUI.Base.GH_DigitNumber.Reset
Reset all parts to zero.

Grasshopper.GUI.Base.GH_DigitNumber.Factor(System.Int32)
Compute the decimal factor at the given index.
index: Index of decimal to evaluate.
Returns: The decimal factor at the given index.

Grasshopper.GUI.Base.GH_DigitNumber.AssignOffset(System.Int32,System.Decimal)
Assign an offset to a given digit and recursively adjust all leftwards offsets if needed.
index: Index of digit to offset.
offset: New offset for digit.
Returns: True on success, false on failure.

Grasshopper.GUI.Base.GH_DigitNumber.Round
Round the number by cancelling the offset in the proper direction.

Grasshopper.GUI.Base.GH_DigitNumber.LimitValue
Limits the value to the minimum and maximum domain.