Grasshopper.Kernel.IGH_RenderAwareData
Implement this interface in your IGH_Goo type if it may have render geometry.

Grasshopper.Kernel.IGH_RenderAwareData.AppendRenderGeometry(Grasshopper.Kernel.GH_RenderArgs,Rhino.Render.RenderMaterial)
Push this geometry down a render pipeline.
args: Render pipeline details.
material: Material to use if you can't think of one yourself.