Grasshopper.DataTree`1
Implements basic Grasshopper Data Tree functionality in an easy-to-use class.
This class is used primarily in Scripting components. If you're using the Grasshopper
SDK you should consider using the Grasshopper.Kernel.Data.GH_Structure`1 class instead.
Data type of this class.

Grasshopper.DataTree`1.m_data
Sorted database of data and paths

Grasshopper.DataTree`1.#ctor
Default constructor, create an empty data tree.

Grasshopper.DataTree`1.#ctor(System.Collections.Generic.IEnumerable{`0},Grasshopper.Kernel.Data.GH_Path)
Create a tree with a single branch
data: Data to append to the tree.
root: Branch path of first branch. If Null, the default path is used.

Grasshopper.DataTree`1.#ctor(Grasshopper.DataTree{`0})
Create a shallow duplicate of another data tree. This means it will create a new tree that contains the same items.
other: Tree to duplicate

Grasshopper.DataTree`1.#ctor(Grasshopper.DataTree{`0},Grasshopper.DataTree{`0}.DuplicateT)
Create a true duplicate of another data tree.
other: Tree to duplicate
copyDelegate: Delegate function used to duplicate individual items.

Grasshopper.DataTree`1.BranchCount
Gets the number of branches defined in this tree.

Grasshopper.DataTree`1.DataCount
Gets the total number of data items (including nulls) stored in all branches.

Grasshopper.DataTree`1.Paths
Gets a list of all the branch paths in this tree.

Grasshopper.DataTree`1.Branches
Gets a list of all the data-arrays in this tree

Grasshopper.DataTree`1.TopologyDescription
Gets a description of the topology of the tree.
Useful for debugging purposes.

Grasshopper.DataTree`1.ToString
Creates a brief description of the tree.
Returns: A String representing the current state of the data tree.

Grasshopper.DataTree`1.PathExists(System.Int32[])
Test if the specified path is already defined inside the tree.
path: The branch path to search for.
Returns: True if the path already exists, false if it doesn't.

Grasshopper.DataTree`1.PathExists(Grasshopper.Kernel.Data.GH_Path)
Test if the specified path is already defined inside the tree.
path: The branch path to search for
Returns: True if the path already exists, false if it doesn't.

Grasshopper.DataTree`1.ItemExists(Grasshopper.Kernel.Data.GH_Path,System.Int32)
Test if the specified path + item index are defined inside the tree.
path: Path to test for.
index: Item index to test.
Returns: True if the specified path exists and contains the specified index.

Grasshopper.DataTree`1.EnsurePath(System.Int32[])
Create a new branch with the specified path if it doesn't already exists.
path: Path of the branch to ensure.
Returns: The list that belongs to the specified path.

Grasshopper.DataTree`1.EnsurePath(Grasshopper.Kernel.Data.GH_Path)
Create a new branch with the specified path if it doesn't already exists.
path: Path of the branch to ensure.
Returns: The list that belongs to the specified path.

Grasshopper.DataTree`1.RemovePath(System.Int32[])
Removes a path and all associated data from the structure.
If the path doesn't exist, nothing will happen.
path: Path to remove.

Grasshopper.DataTree`1.RemovePath(Grasshopper.Kernel.Data.GH_Path)
Removes a path and all associated data from the structure.
If the path doesn't exist, nothing will happen.
path: Path to remove.

Grasshopper.DataTree`1.Path(System.Int32)
Gets the data path at the specified index.
index: Index of path to retrieve.
Throws System.IndexOutOfRangeException: Thrown if the index does not represent a valid path.

Grasshopper.DataTree`1.Branch(System.Int32[])
Gets the list of data which belongs to a given Branch path.
path: Data path to retrieve.

Grasshopper.DataTree`1.Branch(Grasshopper.Kernel.Data.GH_Path)
Gets the list of data which belongs to a given Branch path.
path: Data path to retrieve.

Grasshopper.DataTree`1.Branch(System.Int32)
Gets the list of data which belongs to the branch path at the given index.
index: Index of data to retrieve.
Throws System.IndexOutOfRangeException: Thrown if the index does not represent a valid path.

Grasshopper.DataTree`1.Item(Grasshopper.Kernel.Data.GH_Path,System.Int32)
Gets or set the data item at the specified path and index.
path: Path of the data branch to retrieve. Path must be defined in the tree.
index: Index of item to retrieve. Index must be defined in the branch.
Throws System.NullReferenceException: Thrown if the path doesn't exist.
Throws System.IndexOutOfRangeException: Thrown if the index does not exist within the path list.

Grasshopper.DataTree`1.Add(`0)
Add (append) a data item to the last branch in the tree.
If no branches exist yet, a new one will be created with [path = {0}]
data: Data to append.

Grasshopper.DataTree`1.Add(`0,Grasshopper.Kernel.Data.GH_Path)
Add (append) a data item to the specified branch in the tree.
If the branch doesn't exist yet, it will be created.
data: Data to append.
path: Branch path to append to.

Grasshopper.DataTree`1.Insert(`0,Grasshopper.Kernel.Data.GH_Path,System.Int32)
Insert a data item to the specified branch in the tree.
If the branch doesn't exist yet, it will be created.
data: Data to insert.
path: Branch path to insert into.
index: Insertion index.

Grasshopper.DataTree`1.AddRange(System.Collections.Generic.IEnumerable{`0})
Add (append) a list of data items to the last branch in the tree.
If no branch exists yet, a new one will be created.
data: Data to append

Grasshopper.DataTree`1.AddRange(System.Collections.Generic.IEnumerable{`0},Grasshopper.Kernel.Data.GH_Path)
Add (append) a list of data items to the specified branch in the tree.
If the branch doesn't exist yet, it will be created.
data: Data to append.
path: Data path.

Grasshopper.DataTree`1.SimplifyPaths
Simplify the branches in this tree by removing all identical path entries.
The length of the shortest path will be indicative of the similarity search depth.
If this tree only contains a single branch, the branch wil be simplified to its last index.

Grasshopper.DataTree`1.RenumberPaths
Renumber all paths in this data tree, using a single incrementing path index.

Grasshopper.DataTree`1.RenumberPaths(System.String)
Renumber all paths in this data tree, using a single incrementing path index.
mask:
String formatting mask for paths. Use semi-colons for path index separators and "{i}" as a path index placeholder.
Examples:
"{i}"     -> {i}
"0;{i}"   -> {0;i}
"{i};0;0" -> {i;0;0}

Grasshopper.DataTree`1.Flatten(Grasshopper.Kernel.Data.GH_Path)
Flattens the entire tree into a single path.
flatten_path: The path of the flattened data. If null, the path will be {0}

Grasshopper.DataTree`1.Graft(Grasshopper.Kernel.Data.GH_Path,System.Boolean)
Graft a single path in the tree.
"Grafting" means appending a new branch for every item in an existing branch.
path: Path to graft.
skip_nulls: If true, null items in the grafted path will not be included in the new tree.

Grasshopper.DataTree`1.Graft(System.Boolean)
Graft all paths in this tree.
"Grafting" means appending a new branch for every item in an existing branch.
skip_nulls: If true, null items in the grafted path will not be included in the new tree.

Grasshopper.DataTree`1.MergeTree(Grasshopper.DataTree{`0})
Merges two trees together. Data inside similar branches will be merged into single lists
and unique paths will be appended. The other tree will not be altered, so beware that data is
now shared among both trees.
other: Tree to merge with.
Throws System.ArgumentNullException: Thrown if other is a null reference.

Grasshopper.DataTree`1.MergeStructure(Grasshopper.Kernel.Data.IGH_Structure,Grasshopper.Kernel.Parameters.IGH_TypeHint)
Merge a Grasshopper parameter structure into this DataTree.
Expert user function. If you don't know what a GH_Structure(Of T)
is you don't have to worry about this method.
structure: Parameter data structure to merge.
hint: Type hint converter to use during merging.
Remarks: Expert user function, don't go near GH_Structures if
you're not intimately familiar with the Grasshopper SDK.

Grasshopper.DataTree`1.Clear
Clears the entire tree.

Grasshopper.DataTree`1.ClearData
Removes all data from all branches without affecting the tree topology.

Grasshopper.DataTree`1.TrimExcess
Trims the excess allocated memory in all branches

Grasshopper.DataTree`1.AllData
Collects all data in the tree in a single list.
Does not alter the topology of this tree.
Returns: A linear list containing all data items in all branches.

Grasshopper.DataTree`1.MergeWithParameter(Grasshopper.Kernel.IGH_Param)
Utility function for assigning Script Data Trees to output parameters.
Expert user function, don't worry your pretty little head about this one.
param: Parameter to merge with.
Returns: True on success, false on failure.