Grasshopper.Kernel.Data.GH_ExpandMode
Enumerates the possible expansion modes for structure paths.

Grasshopper.Kernel.Data.GH_ExpandMode.None
Indicates no expansion should take place.

Grasshopper.Kernel.Data.GH_ExpandMode.SimpleReplace
Paths are expanded and collisions are erased.

Grasshopper.Kernel.Data.GH_ExpandMode.SimpleAppend
Paths are expanded and merged with colliding paths.

Grasshopper.Kernel.Data.GH_ExpandMode.Recursive
Before a path is expanded, any collision is expanded first.