Grasshopper.Kernel.Types.IGH_Goo
Base interface for all Data inside Grasshopper. Every parameter must implement a type of Goo.

Grasshopper.Kernel.Types.IGH_Goo.Duplicate
Make a complete duplicate of this instance. No shallow copies.
Remarks: Classes which implement this interface should also provide type specific Duplicate methods

Grasshopper.Kernel.Types.IGH_Goo.ToString
Creates a string description of the current instance value

Grasshopper.Kernel.Types.IGH_Goo.IsValid
Gets a value indicating whether or not the current value is valid.

Grasshopper.Kernel.Types.IGH_Goo.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Kernel.Types.IGH_Goo.TypeName
Gets the name of the type of the implementation.

Grasshopper.Kernel.Types.IGH_Goo.TypeDescription
Gets a description of the type of the implementation.

Grasshopper.Kernel.Types.IGH_Goo.EmitProxy
Create a new proxy for this instance. Return Null if this class does not support proxies.

Grasshopper.Kernel.Types.IGH_Goo.CastFrom(System.Object)
Attempt a cast from generic object
source: Reference to source of cast.
Returns: True on success, false on failure.
Remarks: If False, the contents of this instance are not to be trusted.

Grasshopper.Kernel.Types.IGH_Goo.CastTo``1(``0@)
Attempt a cast to type T
Type to cast to
target: Pointer to target of cast.
Returns: True on success, false on failure.
Remarks: If false, the target instance contents are not guaranteed to be valid.

Grasshopper.Kernel.Types.IGH_Goo.ScriptVariable
This function will be called when the local IGH_Goo instance
disapears into a user Script. This would be an excellent place to
cast your IGH_Goo type to a simple data type.
Returns: The object that represents this IGH_Goo instance in a script.