Grasshopper.Kernel.GH_ParamServerEventArgs
Arguments used in events for the GH_ComponentParamServer type.

Grasshopper.Kernel.GH_ParamServerEventArgs.Server
Gets the GH_ComponentParamServer object that raised the event.

Grasshopper.Kernel.GH_ParamServerEventArgs.Parameter
Gets the parameter that caused the original event.

Grasshopper.Kernel.GH_ParamServerEventArgs.ParameterSide
Gets the side of the parameter that caused the original event.

Grasshopper.Kernel.GH_ParamServerEventArgs.ParameterIndex
Gets the index of the parameter that caused the original event.

Grasshopper.Kernel.GH_ParamServerEventArgs.OriginalArguments
Gets access to the original parameter event arguments.