Grasshopper.Kernel.Special.GH_Cluster.HookParamMap.Clear
Remove all parameter|hook pairs.

Grasshopper.Kernel.Special.GH_Cluster.HookParamMap.AddMapping(System.Guid,System.Guid)
Add another parameter|hook pair.

Grasshopper.Kernel.Special.GH_Cluster.HookParamMap.AddMapping(Grasshopper.Kernel.IGH_Param,Grasshopper.Kernel.IGH_Param)
Add another parameter|hook pair.

Grasshopper.Kernel.Special.GH_Cluster.HookParamMap.RemoveMapping(System.Guid,System.Guid)
Remove a parameter|hook pair.

Grasshopper.Kernel.Special.GH_Cluster.HookParamMap.Parameter(System.Guid)
Get the parameter associated with the hook.

Grasshopper.Kernel.Special.GH_Cluster.HookParamMap.Parameter(Grasshopper.Kernel.IGH_Param)
Get the parameter associated with the hook.

Grasshopper.Kernel.Special.GH_Cluster.HookParamMap.Hook(System.Guid)
Get the hook associated with the parameter.

Grasshopper.Kernel.Special.GH_Cluster.HookParamMap.Hook(Grasshopper.Kernel.IGH_Param)
Get the hook associated with the parameter.

Grasshopper.Kernel.Special.GH_Cluster.HookParamMap.IsParameter(System.Guid)
Gets whether the parameter is defined in the map.

Grasshopper.Kernel.Special.GH_Cluster.HookParamMap.IsParameter(Grasshopper.Kernel.IGH_Param)
Gets whether the parameter is defined in the map.

Grasshopper.Kernel.Special.GH_Cluster.HookParamMap.IsHook(System.Guid)
Gets whether the hook is defined in the map.

Grasshopper.Kernel.Special.GH_Cluster.HookParamMap.IsHook(Grasshopper.Kernel.IGH_Param)
Gets whether the hook is defined in the map.

Grasshopper.Kernel.Special.GH_Cluster.HookParamMap.ParamToHook
Gets the parameter to hook mapping. Parameter ids are key, hook ids are value.

Grasshopper.Kernel.Special.GH_Cluster.HookParamMap.HookToParam
Gets the parameter to hook mapping. Parameter ids are key, hook ids are value.

Grasshopper.Kernel.Special.GH_Cluster.HookParamMap.Write(GH_IO.Serialization.GH_IWriter)
Serialize the mapping to an archive.

Grasshopper.Kernel.Special.GH_Cluster.HookParamMap.Read(GH_IO.Serialization.GH_IReader)
Deserialize the mapping from an archive.