Grasshopper.GUI.Base.GH_SliderTickDisplay
Enumerates the possible slider tick displays.

Grasshopper.GUI.Base.GH_SliderTickDisplay.None
No slider ticks are drawn.

Grasshopper.GUI.Base.GH_SliderTickDisplay.Simple
Slider ticks are drawn as single lines.

Grasshopper.GUI.Base.GH_SliderTickDisplay.Etched
Slider ticks are drawn as etched lines.