Grasshopper.GUI.Canvas.GH_NamedViewType
Types of named view anchor points.

Grasshopper.GUI.Canvas.GH_NamedViewType.target
Anchor represents the location of the target (the canvas origin).

Grasshopper.GUI.Canvas.GH_NamedViewType.center
Anchor represents the point that is supposed to end up in the middle of the canvas.