Grasshopper.GUI.Base.GH_ColourPickerBase
Provides Colour picker GUI not tied to a control-handle.

Grasshopper.GUI.Base.GH_ColourPickerBase.#ctor
Create a new instance of the Colour Picker base control.
This constructor assigns the default Colour space model and involves a call
to the Grasshopper core settings server.
You must call SetupColourPicker()
prior to rendering this control on screen.

Grasshopper.GUI.Base.GH_ColourPickerBase.DisplayScale
Display scaling override.

Grasshopper.GUI.Base.GH_ColourPickerBase.Bounds
Gets or sets the Bounds for this control.

Grasshopper.GUI.Base.GH_ColourPickerBase.Padding
Gets or sets the Padding for this control.

Grasshopper.GUI.Base.GH_ColourPickerBase.AutoSize
Gets or sets a value indicating whether the width and height of the
Bounds are adjusted to fit the UI.

Grasshopper.GUI.Base.GH_ColourPickerBase.DrawChannelSliders
Gets or sets whether or not the three basic channel sliders are included in the UI.

Grasshopper.GUI.Base.GH_ColourPickerBase.DrawAlphaSlider
Gets or sets whether or not the alpha slider is included in the UI.

Grasshopper.GUI.Base.GH_ColourPickerBase.DrawBackground
Gets or sets whether the background of the picker is drawn.

Grasshopper.GUI.Base.GH_ColourPickerBase.BackColour
Gets or sets the background colour of the picker.

Grasshopper.GUI.Base.GH_ColourPickerBase.BaseColour
Gets the original base colour for this picker. Use SetupColourPicker to assign this colour.

Grasshopper.GUI.Base.GH_ColourPickerBase.PickColour
Gets the picked colour.

Grasshopper.GUI.Base.GH_ColourPickerBase.ColourSpace
Gets the Colour space mode used in this picker.

Grasshopper.GUI.Base.GH_ColourPickerBase.Font
Gets or sets the Font used in this Colour Picker.
Do not Dispose the Font returned by this property.

Grasshopper.GUI.Base.GH_ColourPickerBase.SetupColourPicker(System.Drawing.Color,System.Drawing.Color,Grasshopper.GUI.Base.GH_ColourSpace)
Setup all UI elements.
col0: Initial colour for this picker.
col1: Active colour for this picker.
space: Colour space mode for this picker.

Grasshopper.GUI.Base.GH_ColourPickerBase.SetupColourPicker(System.Drawing.Color,Rhino.Geometry.Point4d,Grasshopper.GUI.Base.GH_ColourSpace)
Setup all UI elements.
col0: Initial colour for this picker.
col1: Active colour for this picker.
space: Colour space mode for this picker.

Grasshopper.GUI.Base.GH_ColourPickerBase.SetColourSpace(Grasshopper.GUI.Base.GH_ColourSpace)
Set all sliders to the specific colour space settings.
Thid function does not adjust local colours to match the new space.
space: Space to set.

Grasshopper.GUI.Base.GH_ColourPickerBase.X0
Gets the horizontal offset for the left edge of the UI elements

Grasshopper.GUI.Base.GH_ColourPickerBase.X1
Gets the horizontal offset for the right edge of the UI elements

Grasshopper.GUI.Base.GH_ColourPickerBase.Y0
Gets the vertical offset for the top edge of the colour cube.

Grasshopper.GUI.Base.GH_ColourPickerBase.Y1
Gets the vertical offset for the top edge of the first channel slider.

Grasshopper.GUI.Base.GH_ColourPickerBase.Y2
Gets the vertical offset for the top edge of the swatches.

Grasshopper.GUI.Base.GH_ColourPickerBase.BaseColourBox
Gets the rectangle containing the base colour swatch.

Grasshopper.GUI.Base.GH_ColourPickerBase.PickColourBox
Gets the rectangle containing the pick colour swatch.

Grasshopper.GUI.Base.GH_ColourPickerBase.HSVSpaceBox
Gets the rectangle containing the base colour space.

Grasshopper.GUI.Base.GH_ColourPickerBase.RGBSpaceBox
Gets the rectangle containing the pick colour space.

Grasshopper.GUI.Base.GH_ColourPickerBase.SRCSpaceBox
Gets the rectangle containing the eye-dropper function.

Grasshopper.GUI.Base.GH_ColourPickerBase.DropperPreviewBox
Gets the rectangle in which the eye-dropped preview will be drawn.

Grasshopper.GUI.Base.GH_ColourPickerBase.ColourCubeBox
Gets the rectangle that contains the colour space cube.

Grasshopper.GUI.Base.GH_ColourPickerBase.Cube
Gets the graphics object that describes the current colour cube.

Grasshopper.GUI.Base.GH_ColourPickerBase.ChannelBox0
Gets the rectangle containing the tag string for the first channel slider.

Grasshopper.GUI.Base.GH_ColourPickerBase.ChannelBox1
Gets the rectangle containing the tag string for the second channel slider.

Grasshopper.GUI.Base.GH_ColourPickerBase.ChannelBox2
Gets the rectangle containing the tag string for the third channel slider.

Grasshopper.GUI.Base.GH_ColourPickerBase.ChannelBox3
Gets the rectangle containing the tag string for the fourth channel slider.

Grasshopper.GUI.Base.GH_ColourPickerBase.DesiredHeight
Gets the ideal height for this colour picker given it's width and UI settings.

Grasshopper.GUI.Base.GH_ColourPickerBase.Invalidated
Raised whenever a redraw is required.
sender: GH_ColourPickerBase that raised the event.
e: Blank event arguments.

Grasshopper.GUI.Base.GH_ColourPickerBase.Invalidate
Raise the Invalidated event.

Grasshopper.GUI.Base.GH_ColourPickerBase.ColorChanged
Raised whenever the color of this picker is changed due to User-Interface methods.
sender: GH_ColourPickerBase that raised the event.
e: Arguments for this event.

Grasshopper.GUI.Base.GH_ColourPickerBase.OnColorChanged(System.Boolean)
Raise the ColorChanged event.
intermediate: Set the intermediate state of the event arguments.

Grasshopper.GUI.Base.GH_ColourPickerBase.m_mouse_drag
0 = no drag
1 = pivot drag
2 = grip drag
3 = eye dropper
10 = channel 0 drag
11 = channel 1 drag
12 = channel 2 drag
13 = channel 3 drag

Grasshopper.GUI.Base.GH_ColourPickerBase.MouseDown(System.Windows.Forms.MouseEventArgs,System.Drawing.PointF)
Respond to mouse-down events.
args: Mouse Event arguments.
pt: Mouse cursor position in floating point accuracy.
Returns: True if a Drag operation was started, false if the event went unnoticed.

Grasshopper.GUI.Base.GH_ColourPickerBase.MouseMove(System.Windows.Forms.MouseEventArgs,System.Drawing.PointF)
Respond to mouse-move events.
args: Mouse Event arguments.
pt: Mouse cursor position in floating point accuracy.
Returns: True if a Drag operation was performed, false if the event went unnoticed.

Grasshopper.GUI.Base.GH_ColourPickerBase.MouseUp(System.Windows.Forms.MouseEventArgs,System.Drawing.PointF)
Respond to mouse-up events.
args: Mouse Event arguments.
pt: Mouse cursor position in floating point accuracy.
Returns: True if a Drag operation was terminated, false if the event went unnoticed.

Grasshopper.GUI.Base.GH_ColourPickerBase.MouseClick(System.Windows.Forms.MouseEventArgs,System.Drawing.PointF)
Respond to mouse-click events.
args: Mouse Event arguments.
pt: Mouse cursor position in floating point accuracy.
Returns: True if a Drag operation was terminated, false if the event went unnoticed.

Grasshopper.GUI.Base.GH_ColourPickerBase.MouseDoubleClick(System.Windows.Forms.MouseEventArgs,System.Drawing.PointF,System.Windows.Forms.Control,System.Drawing.Drawing2D.Matrix)
Respond to mouse-doubleclick events.
args: Mouse Event arguments.
pt: Mouse cursor position in floating point accuracy.
owner: Owner control for this colour-picker.
transform: Display Transformation matrix of colour-picker.

Grasshopper.GUI.Base.GH_ColourPickerBase.IsTextInput
Gets whether any of the slider is currently displaying a text input box.

Grasshopper.GUI.Base.GH_ColourPickerBase.Render(System.Drawing.Graphics)
Render this slider into a Graphics context.
G: Graphics to render with.