Grasshopper.Kernel.Types.GH_Matrix
Represents a rectangular numeric matrix. GH_Integer re-implements Rhino.Geometry.Matrix.

Grasshopper.Kernel.Types.GH_Matrix.#ctor
Blank constructor

Grasshopper.Kernel.Types.GH_Matrix.CloneMatrix(Rhino.Geometry.Matrix)
Duplicates a Matrix.

Grasshopper.Kernel.Types.GH_Matrix.IsValid
Gets the validity of this instance. Integers are always valid.

Grasshopper.Kernel.Types.GH_Matrix.QC_Type


Grasshopper.Kernel.Types.GH_Matrix.QC_Hash


Grasshopper.Kernel.Types.GH_Matrix.QC_Distance(Grasshopper.Kernel.Types.IGH_QuickCast)


Grasshopper.Kernel.Types.GH_Matrix.QC_Bool


Grasshopper.Kernel.Types.GH_Matrix.QC_Complex


Grasshopper.Kernel.Types.GH_Matrix.QC_Matrix


Grasshopper.Kernel.Types.GH_Matrix.QC_Int


Grasshopper.Kernel.Types.GH_Matrix.QC_Num


Grasshopper.Kernel.Types.GH_Matrix.QC_Text


Grasshopper.Kernel.Types.GH_Matrix.QC_Pt


Grasshopper.Kernel.Types.GH_Matrix.QC_Vec


Grasshopper.Kernel.Types.GH_Matrix.QC_Col


Grasshopper.Kernel.Types.GH_Matrix.QC_Interval


Grasshopper.Kernel.Types.GH_Matrix.QC_CompareTo(Grasshopper.Kernel.Types.IGH_QuickCast)
