Grasshopper.GUI.GH_VerticalScrollBar
Scroll bar control with floating point accuracy.

Grasshopper.GUI.GH_VerticalScrollBar.TargetHeight
Gets or sets the height of the target area (the area being scrolled)

Grasshopper.GUI.GH_VerticalScrollBar.ScreenHeight
Gets or sets the height of the screen area (the visible area)

Grasshopper.GUI.GH_VerticalScrollBar.TargetRatio
Gets or sets the scroll ration. If the scroll ratio is changed, the
OnScrollRatioChanged event will be raised.

Grasshopper.GUI.GH_VerticalScrollBar.ImpliedVerticalOffset
Gets or sets the offset of the target region as implied by the scroll ratio.
If you set this value, the ratio is reverse engineered.

Grasshopper.GUI.GH_VerticalScrollBar.GripRegion
Gets the grip region for this scroll bar. The Grip Region is the area
in which the grip can be found. It is essentially the Client area minus the padding.

Grasshopper.GUI.GH_VerticalScrollBar.Grip
Gets the actual dimensions of the scroll bar grip.