Grasshopper.GUI.RemotePanel.RcpLayout
Represents a collection of RcpGroup objects.

Grasshopper.GUI.RemotePanel.RcpLayout.LayoutChanged
Raised whenever the layout changes at some level.

Grasshopper.GUI.RemotePanel.RcpLayout.OnLayoutChanged
Raise the LayoutChanged event.

Grasshopper.GUI.RemotePanel.RcpLayout.OnLayoutChanged(Grasshopper.GUI.RemotePanel.RcpLayoutKind)
Raise the LayoutChanged event.

Grasshopper.GUI.RemotePanel.RcpLayout.EnsureGroup
Returns the bottommost group in this layout. If there are no groups, a new group will be created.