Grasshopper.GUI.GH_ColourPicker
Provides the standard Grasshopper Colour picker as a winforms Control.

Grasshopper.GUI.GH_ColourPicker.AllowNumericInput
Gets or sets whether this colour picker pops up a textbox on channel slider double clicks.

Grasshopper.GUI.GH_ColourPicker.Colour
Gets or sets the colour currently specified in the picker.

Grasshopper.GUI.GH_ColourPicker.ShowChannelSliders
Gets or sets whether the channel sliders are included.

Grasshopper.GUI.GH_ColourPicker.ShowAlphaSlider
Gets or sets whether the alpha channel slider is included.

Grasshopper.GUI.GH_ColourPicker.SliceRectangle
Gets the rectangle that outlines the colour cube slice.

Grasshopper.GUI.GH_ColourPicker.DesiredHeight
Gets the ideal height for this control given the current width and UI settings.

Grasshopper.GUI.GH_ColourPicker.ColourChanged
Raised whenever the value of the slider is changed via GUI interaction.
sender: Picker control raising the event.
e: Event arguments.

Grasshopper.GUI.GH_ColourPicker.RespondToEnter


Grasshopper.GUI.GH_ColourPicker.RespondToEscape
