Grasshopper.Rhinoceros.Display.DisplayColorGradient
Represents a gradient colour stop. Wraps the functionality of the Rhino.Display.ColorGradient type.

Grasshopper.Rhinoceros.Display.DisplayColorGradient.#ctor
Blank constructor

Grasshopper.Rhinoceros.Display.DisplayColorGradient.IsValid
Gets the validity of this instance.

Grasshopper.Rhinoceros.Display.DisplayColorGradient.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.