Grasshopper.Kernel.Special.GH_PieChartAttributes.GH_PieChartDisplayData.outline
Represents the outline path for the pie segment.

Grasshopper.Kernel.Special.GH_PieChartAttributes.GH_PieChartDisplayData.text
Represents the text content of the pie segment.

Grasshopper.Kernel.Special.GH_PieChartAttributes.GH_PieChartDisplayData.pivot
Represents the pivot (center of mass) of the segment.

Grasshopper.Kernel.Special.GH_PieChartAttributes.GH_PieChartDisplayData.pivot_radius
Represents the radius of the area surrounding the pivot where tags can be drawn.

Grasshopper.Kernel.Special.GH_PieChartAttributes.GH_PieChartDisplayData.colour
Represents the fill colour of the pie segment.

Grasshopper.Kernel.Special.GH_PieChartAttributes.GH_PieChartDisplayData.valence
Represents the valence of the pie segment (i.e. the number of items that went into making it).