Grasshopper.Kernel.GH_Exposure
Lists the different kinds of GUI exposure an object can have.

Grasshopper.Kernel.GH_Exposure.hidden
Do not expose the object anywhere. This is useful for legacy components.

Grasshopper.Kernel.GH_Exposure.primary
Expose the object in the first section on the toolbar.

Grasshopper.Kernel.GH_Exposure.secondary
Expose the object in the second section on the toolbar.

Grasshopper.Kernel.GH_Exposure.tertiary
Expose the object in the third section on the toolbar.

Grasshopper.Kernel.GH_Exposure.quarternary
Expose the object in the fourth section on the toolbar.

Grasshopper.Kernel.GH_Exposure.quinary
Expose the object in the fifth section on the toolbar.

Grasshopper.Kernel.GH_Exposure.senary
Expose the object in the sixth section on the toolbar.

Grasshopper.Kernel.GH_Exposure.septenary
Expose the object in the seventh section on the toolbar.

Grasshopper.Kernel.GH_Exposure.octonary
Expose the object in the eighth section on the toolbar.

Grasshopper.Kernel.GH_Exposure.last
This exposure will be the last subcategory available.

Grasshopper.Kernel.GH_Exposure.dropdown
Only expose the object on the ribbon dropdown.
Use this option for components which are unlikely to be used often.
You can combine dropdown with any of the other flags (except hidden) to get both
dropdown limitations and section control.

Grasshopper.Kernel.GH_Exposure.obscure
Mark the object as obscure.
Use this option for components which are unlikely to be used often.
You must combine obscure with one of the other flags (except hidden).
Objects which are marked as Obscure will be the first to disappear when a ribbon
resizes and they will always appear at the end of a panel.