Grasshopper.Documentation.GH_Topic
Represents a single topic in the Grasshopper help.

Grasshopper.Documentation.GH_Topic.ParseFile(System.String)
Parse a *.topic file and return a topic entry.
path: File to parse.
Returns: The topic defined by the file. This function always returns a valid topic or it throws an exception.