Grasshopper.GUI.GH_Tooltip
Implements a custom Tooltip class with advanced functionality.
All methods and fields are Shared. There can never be more than one GH_Tooltip.

Grasshopper.GUI.GH_Tooltip.EnsureTooltipForm
Make sure the Tooltip form is non-null and not disposed.
It will not however be shown yet.

Grasshopper.GUI.GH_Tooltip.AltTimerExpired(System.Object,System.EventArgs)
Watches for ALT presses and hides the tooltip accordingly.

Grasshopper.GUI.GH_Tooltip.TooltipCorner
Returns a screen coordinate near the cursor position that indicates the ideal place for the tooltip form.

Grasshopper.GUI.GH_Tooltip.Clear
Hides the tooltip and clears all references and caches.

Grasshopper.GUI.GH_Tooltip.TooltipForm
Gets the internal instance of GH_TooltipForm.

Grasshopper.GUI.GH_Tooltip.Show(System.Windows.Forms.Control)
Display the tooltip on screen.

Grasshopper.GUI.GH_Tooltip.Adjust
Repositions the tooltip to match with new cursor positions.

Grasshopper.GUI.GH_Tooltip.Layout
Layout the tooltip fields. Layout happens automatically if you use the AssigTooltipField method,
if however you poke values directly in the tooltip form you must place a call to Layout() before
showing the tooltip.

Grasshopper.GUI.GH_Tooltip.Tag
Gets or sets the tag object for the tooltip
Returns:
Remarks:

Grasshopper.GUI.GH_Tooltip.IsTag(System.Object)
Returns True if the test object matches the internal Tag object
test:
Returns:
Remarks:

Grasshopper.GUI.GH_Tooltip.IsOwner(System.Windows.Forms.Control)
Returns true if the test control matches the internal Owner control.
Use this method to make sure you actually own this tooltip prior to clearing it.
test:
Returns:
Remarks:

Grasshopper.GUI.GH_Tooltip.AssignTooltipFields(System.String,System.String,System.String,System.Drawing.Image,System.Drawing.Image)
Set all fields of the Tooltip. You'll still need to call Show() to display the tooltip.
title: The Title text on the tooltip
text: The text content of the tooltip
description: The block text to be displayed in the sunken area of the tooltip.
icon: The Icon to be displayed next to the Title.
diagram: The image to be displayed in the sunken area.