Grasshopper.Kernel.Undo.GH_UndoState
State enumeration for undo records.

Grasshopper.Kernel.Undo.GH_UndoState.undo
Record can be undone.

Grasshopper.Kernel.Undo.GH_UndoState.redo
Record can be redone