Grasshopper.Kernel.Data.GH_GraphicTreeDisplayArgs
A class that contains useful information used for drawing GH_GraphicTrees.

Grasshopper.Kernel.Data.GH_GraphicTreeDisplayArgs.origin
The origin point of the tree in Graphics coordinates.

Grasshopper.Kernel.Data.GH_GraphicTreeDisplayArgs.radius
Radius of the outer ring Leaf objects.

Grasshopper.Kernel.Data.GH_GraphicTreeDisplayArgs.maxPathLength
The number of elements in the longest path of the tree.

Grasshopper.Kernel.Data.GH_GraphicTreeDisplayArgs.vp
Gets the viewport of the canvas in which we're drawing.

Grasshopper.Kernel.Data.GH_GraphicTreeDisplayArgs.SetupViewport(Grasshopper.GUI.Canvas.GH_Viewport)
Assign the viewport member with this function to ensure that
other constants are also set.

Grasshopper.Kernel.Data.GH_GraphicTreeDisplayArgs.AdjustMaxPathLength(System.Int32)
Call this function to register a new maximum path length.
This function is only used during the construction of this class.
Do not call this while in the middle of a drawing operation.

Grasshopper.Kernel.Data.GH_GraphicTreeDisplayArgs.RadialX(System.Single,System.Single)
Compute the x-coordinate of a point defined by radial coordinates

Grasshopper.Kernel.Data.GH_GraphicTreeDisplayArgs.RadialY(System.Single,System.Single)
Compute the y-coordinate of a point defined by radial coordinates

Grasshopper.Kernel.Data.GH_GraphicTreeDisplayArgs.RadialCrd(System.Single,System.Single)
Compute the x and y coordinates of a point defined by radial coordinates

Grasshopper.Kernel.Data.GH_GraphicTreeDisplayArgs.RadialBox(System.Single)
Compute the extents of a rectanle within the current layout.

Grasshopper.Kernel.Data.GH_GraphicTreeDisplayArgs.Visible(System.Drawing.PointF)
Test to see if a point is within the visible domain.

Grasshopper.Kernel.Data.GH_GraphicTreeDisplayArgs.Visible(System.Drawing.PointF,System.Single)
Test to see if a circle is within the visible domain.

Grasshopper.Kernel.Data.GH_GraphicTreeDisplayArgs.Visible(System.Drawing.RectangleF)
Test to see if a rectangle is within the visible domain.

Grasshopper.Kernel.Data.GH_GraphicTreeDisplayArgs.Visible(System.Drawing.RectangleF,System.Single)
Test to see if a rectangle is within the visible domain.

Grasshopper.Kernel.Data.GH_GraphicTreeDisplayArgs.Visible(System.Drawing.PointF,System.Drawing.PointF,System.Single)
Test to see if a line segment is within the visible domain.
This test is fuzzy in the interest of performance.

Grasshopper.Kernel.Data.GH_GraphicTreeDisplayArgs.Visible(System.Drawing.PointF,System.Drawing.PointF,System.Drawing.PointF,System.Drawing.PointF,System.Single)
Test to see if a bezier segment is within the visible domain.
This test is fuzzy in the interest of performance.

Grasshopper.Kernel.Data.GH_GraphicTreeDisplayArgs.RemapDegrees(System.Single)
Adjust the angle (in degrees) to match tree orientation

Grasshopper.Kernel.Data.GH_GraphicTreeDisplayArgs.RadToDeg(System.Single)
Convert Radians to Degrees

Grasshopper.Kernel.Data.GH_GraphicTreeDisplayArgs.DistanceSquared(System.Drawing.PointF,System.Drawing.PointF)
Compute the squared distance between two points.

Grasshopper.Kernel.Data.GH_GraphicTreeDisplayArgs.Distance(System.Drawing.PointF,System.Drawing.PointF)
Compute the distance between two points.

Grasshopper.Kernel.Data.GH_GraphicTreeDisplayArgs.Distance(System.Drawing.PointF,System.Drawing.PointF,System.Drawing.PointF)
Compute the distance between a point P and a finite line segment defined by A-B.

Grasshopper.Kernel.Data.GH_GraphicTreeDisplayArgs.ClosestPoint(System.Drawing.PointF,System.Drawing.PointF,System.Drawing.PointF)
Solve the parameter along the A-B segment which is closest to P.