Grasshopper.Kernel.GH_DocumentServer
Manages and maintains a collection of GH_Documents.

Grasshopper.Kernel.GH_DocumentServer.AddDocument(Grasshopper.Kernel.GH_Document)
Add a new document to the global list. If the document is already registered nothing will happen.
document: Document to add.
Throws System.ArgumentNullException: Thrown when the document is a null reference.
Throws System.InvalidOperationException: Thrown when the document doesn't have top-level rank.

Grasshopper.Kernel.GH_DocumentServer.AddDocument(System.String,System.Boolean)
Add a new document to the global list. If there already is a document with the
given path, it will be made active.
filepath: Filepath to document.
makeActive: If true, the document will be loaded into the main canvas.
Returns: The document that was added or activated, or null on failure.

Grasshopper.Kernel.GH_DocumentServer.AddNewDocument
Adds a new document to the global list. If a template file has been set, this document will be based on the template.
Returns: The document thaw was added.

Grasshopper.Kernel.GH_DocumentServer.SafeRemoveDocument(Grasshopper.Kernel.GH_Document)
Remove a document correctly from the server.
This method shows user-interface prompts if there is unsaved data
and will also save if needed.
document: Document to remove.
Returns: True if the document was removed, false if otherwise.

Grasshopper.Kernel.GH_DocumentServer.RemoveDocument(Grasshopper.Kernel.GH_Document)
Removes a specific document from the global list.
If the document isn't registered nothing will happen.
If the document is owned by an IGH_DocumentOwner,
the owner will be informed of the removal.
document: Document to remove.

Grasshopper.Kernel.GH_DocumentServer.RemoveAllDocuments
Remove all documents in the global list.

Grasshopper.Kernel.GH_DocumentServer.PromoteDocument(Grasshopper.Kernel.GH_Document)
Push a document to the top of the list, meaning it will be first in
line when a new default document needs to be selected.
document: Document to promote.

Grasshopper.Kernel.GH_DocumentServer.DocumentCount
Gets the number of documents stored in the global list.

Grasshopper.Kernel.GH_DocumentServer.ModifiedDocumentCount
Gets the total number of modified (unsaved) documents.

Grasshopper.Kernel.GH_DocumentServer.Document(System.Int32)
Gets the document at the given index.
index: Index of document to retrieve.

Grasshopper.Kernel.GH_DocumentServer.NextAvailableDocument
Gets the most important, non-active document.

Grasshopper.Kernel.GH_DocumentServer.IndexOf(Grasshopper.Kernel.GH_Document)
Gets the index of the given document.
doc: Document to search for.
Returns: The index of the given document or -1 if the document is not in the global list.

Grasshopper.Kernel.GH_DocumentServer.IndexOf(System.String)
Gets the index of the document that matches the filepath.
filepath: File path URI to match.
Returns: The index of the document that matches the given path or -1 if no document match is found.

Grasshopper.Kernel.GH_DocumentServer.Contains(Grasshopper.Kernel.GH_Document)
Gets a value indicating whether or not the given document is inside the list.

Grasshopper.Kernel.GH_DocumentServer.IndexOfAutoSave(System.String)
Gets the document index that is associated with the specified autosave location.
autoSavePath: The full path (directory, filename and extension) of the autosave file to test against.
Returns: The index of the document that matches the given autosave path or -1 if no document match is found.

Grasshopper.Kernel.GH_DocumentServer.DocumentNames
Gets a string collection containing all the names of the documents in the global list.