Grasshopper.Kernel.GH_SolutionEventArgs
Event arguments used for Document Solution events.

Grasshopper.Kernel.GH_SolutionEventArgs.Document
Gets the document that raised the event, should be the same
as the "sender" parameter in the event handler.

Grasshopper.Kernel.GH_SolutionEventArgs.StartTime
Gets the time when the current solution began.

Grasshopper.Kernel.GH_SolutionEventArgs.EndTime
Gets the time when the current solution completed.
If the solution hasn't completed yet this field will
be DateTime.MinValue.

Grasshopper.Kernel.GH_SolutionEventArgs.Duration
Gets the duration for this solution.
The duration is a more accurate measure than EndTime-StartTime.