Grasshopper.Kernel.Parameters.GH_ExpressionParam`1
Parameter with expression post-process.
Parameter type

Grasshopper.Kernel.Parameters.GH_ExpressionParam`1.ReplaceExpressionVariable(System.String,System.String,System.String)
Replace one variable name with another in an expression.
expression: Expression to parse.
var0: Variable to search for.
var1: Variable to replace with.
Returns: Updated expression.