Grasshopper.Kernel.GH_SolutionMode
Enumerates all solution modes.

Grasshopper.Kernel.GH_SolutionMode.Default
Represents the standard mode, error messages are displayed in custom forms.

Grasshopper.Kernel.GH_SolutionMode.CommandLine
Represents reduced feedback mode. All messages are send to the Rhino command history,
which is thread safe.

Grasshopper.Kernel.GH_SolutionMode.Silent
Represents null feedback mode. No messages are send to any GUI.