Grasshopper.Kernel.Geometry.SamplingRegion.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Create a new sampling region from curve outlines.
regions: Region outlines. Only closed curves should be used, but open curves will be closed with lines.
Curve z values will be ignored.

Grasshopper.Kernel.Geometry.SamplingRegion.CurveToPath(Rhino.Geometry.Curve,System.Drawing.RectangleF,System.Drawing.RectangleF)
Create a graphicspath from a curve.
The m_regionBox and m_sampleBox will be adjusted as well.
curve: Curve to convert.
Returns: The graphicspath describing the XY shape of the curve.