Grasshopper.Kernel.GH_DocumentObject
Standard implementation of IGH_DocumentObject.

Grasshopper.Kernel.GH_DocumentObject.Attributes
Gets or sets the attributes that are associated with this object.
Only set custom attributes if you know what you are doing.

Grasshopper.Kernel.GH_DocumentObject.CreateAttributes
This function creates the stand-alone attributes for this object.
If you wish to supply your own Attributes, you must override this function.

Grasshopper.Kernel.GH_DocumentObject.IsolateObject
Destroy all connections to other objects.

Grasshopper.Kernel.GH_DocumentObject.AttributesChanged
Raised whenever the number or kind of attributes changes. This event is handled
by GH_Documents who subsequently wipe their attribute caches.
sender: The object that raised the event.
e: Details of event

Grasshopper.Kernel.GH_DocumentObject.OnAttributesChanged
Raises the AttributesChanged event on the toplevel object.

Grasshopper.Kernel.GH_DocumentObject.SolutionExpired
Raised whenever the solution of a certain object becomes invalid.
sender: The object that raised the event.
e: Details of event.

Grasshopper.Kernel.GH_DocumentObject.OnSolutionExpired(System.Boolean)
Raises the SolutionExpired event on the toplevel object.
You probably want to call ExpireSolution() instead of this method directly.
recompute: If True, the solution will be immediately recalculated.

Grasshopper.Kernel.GH_DocumentObject.ExpireSolution(System.Boolean)
Call this function whenever you do something which expires the current solution.
This will make sure all caches are erased, all downstream objects are expired and that
the event is raised.
The default implementation merely places a call to OnSolutionExpired(), override this function
in derived classes to make sure you clear local data caches and expire downstream objects.
recompute: If True, the solution will be recomputed straight away.

Grasshopper.Kernel.GH_DocumentObject.DisplayExpired
Raised whenever the display (on the Canvas) of a certain object becomes invalid.
sender: The object that raised the event.
e: Details of event.

Grasshopper.Kernel.GH_DocumentObject.OnDisplayExpired(System.Boolean)
Raises the DisplayExpired event on the toplevel object.
redraw: If True, the canvas will be immediately redrawn.

Grasshopper.Kernel.GH_DocumentObject.PreviewExpired
Raised whenever the display (in the Rhino viewports) of a certain object becomes invalid.
sender: The object that raised the event.
e: Details of event.

Grasshopper.Kernel.GH_DocumentObject.OnPreviewExpired(System.Boolean)
Raises the PreviewExpired event on the toplevel object.
redraw: If True, the viewports will be immediately redrawn.

Grasshopper.Kernel.GH_DocumentObject.ExpirePreview(System.Boolean)
Call this function when you suspect that the preview has expired for this object.
This will cause the display cache to be eradicated.

Grasshopper.Kernel.GH_DocumentObject.PingDocument
Raised whenever an object needs to know which GH_Document it belongs to.
sender: Object that sends the ping.
e: Ping arguments, documents which handle this event should,
assign themselves to the Document field in this argument.

Grasshopper.Kernel.GH_DocumentObject.OnPingDocument
Raise the PingDocument Event on the toplevel object and try to find
the document which owns this object.
Returns: The document which owns this object if successful,
or nothing if no document owns this object.

Grasshopper.Kernel.GH_DocumentObject.AddedToDocument(Grasshopper.Kernel.GH_Document)
This method will be called when an object is added to a document.
Override this method if you want to handle such events.
document: Document that now owns this object.

Grasshopper.Kernel.GH_DocumentObject.RemovedFromDocument(Grasshopper.Kernel.GH_Document)
This method will be called when an object is removed from a document.
Override this method if you want to handle such events.
document: Document that now no longer owns this object.

Grasshopper.Kernel.GH_DocumentObject.MovedBetweenDocuments(Grasshopper.Kernel.GH_Document,Grasshopper.Kernel.GH_Document)
This method will be called when an object is moved from one document to another.
Override this method if you want to handle such events.
oldDocument: Document that used to own this object.
newDocument: Document that now owns ths object.

Grasshopper.Kernel.GH_DocumentObject.DocumentContextChanged(Grasshopper.Kernel.GH_Document,Grasshopper.Kernel.GH_DocumentContext)
This method will be called when the document that owns this object moves into a different context.
document: Document that owns this object.
context: The reason for this event.

Grasshopper.Kernel.GH_DocumentObject.TriggerAutoSave
Triggers the AutoSave function on the owner document with the object_changed flag.

Grasshopper.Kernel.GH_DocumentObject.TriggerAutoSave(Grasshopper.Kernel.GH_AutoSaveTrigger)
Triggers the AutoSave function on the owner document with a custom flag.
trigger: Reason for the autosave operation. It is possible that a user has decided
to avoid autosave events for specific types, so if you can, try and provide a correct trigger flag.

Grasshopper.Kernel.GH_DocumentObject.TriggerAutoSave(System.Guid)
Triggers the AutoSave function on the owner document with the object_changed flag.
id: ID of autosave event. Consecutive autosave requests with the same ID will be ignored.

Grasshopper.Kernel.GH_DocumentObject.TriggerAutoSave(Grasshopper.Kernel.GH_AutoSaveTrigger,System.Guid)
Triggers the AutoSave function on the owner document with a custom flag.
trigger: Reason for the autosave operation. It is possible that a user has decided
to avoid autosave events for specific types, so if you can, try and provide a correct trigger flag.
id: ID of autosave event. Consecutive autosave requests with the same ID will be ignored.

Grasshopper.Kernel.GH_DocumentObject.RecordUndoEvent(System.String)
Record a generic object change undo event.
undoName: Name of undo record.
Returns: The ID of the newly added record or Guid.Empty on failure.

Grasshopper.Kernel.GH_DocumentObject.RecordUndoEvent(System.String,Grasshopper.Kernel.Undo.IGH_UndoAction)
Record a specific object change undo event.
undoName: Name of undo record.
action: Undo action to record.
Returns: The ID of the newly added record or Guid.Empty on failure.

Grasshopper.Kernel.GH_DocumentObject.RecordUndoEvent(Grasshopper.Kernel.Undo.GH_UndoRecord)
Record an entire undo record.
record: Record to push.

Grasshopper.Kernel.GH_DocumentObject.Obsolete
Gets whether this object is obsolete. Default implementation returns true if
the class name contains the string "OBSOLETE" or if this class has been decorated with the
ObsoleteAttribute.
You are free to override this if you want, but I suggest adding the ObsoleteAttribute instead.

Grasshopper.Kernel.GH_DocumentObject.Exposure
Gets the exposure of this object in the Graphical User Interface.
The default is to expose everywhere.

Grasshopper.Kernel.GH_DocumentObject.AppendMenuItems(System.Windows.Forms.ToolStripDropDown)
This function is called when a context menu is about to be displayed.
Override it to set custom items.
menu: Menu object to populate.
Returns: If true, the menu will be displayed, if false the menu will be supressed.

Grasshopper.Kernel.GH_DocumentObject.Menu_AppendSeparator(System.Windows.Forms.ToolStrip)
Utility function for appending separators to a menu dropdown.
If the dropdown is empty or if it already has a separator at the bottom, nothing will happen.
menu: Menu to append separator to.
Returns: The appended separator or null if no separator was appended.

Grasshopper.Kernel.GH_DocumentObject.Menu_AppendGenericMenuItem(System.Windows.Forms.ToolStrip,System.String,System.EventHandler,System.Drawing.Image,System.Object,System.Boolean,System.Boolean)
This method is obsolete.

Grasshopper.Kernel.GH_DocumentObject.Menu_AppendItem(System.Windows.Forms.ToolStrip,System.String)
Utility function for appending generic menu items.
menu: Menu to append item to.
text: Item text.
Returns: The appended item

Grasshopper.Kernel.GH_DocumentObject.Menu_AppendItem(System.Windows.Forms.ToolStrip,System.String,System.EventHandler)
Utility function for appending generic menu items.
menu: Menu to append item to.
text: Item text.
click: Delegate that handles click events. If nothing, the click event will not be handled.
Returns: The appended item

Grasshopper.Kernel.GH_DocumentObject.Menu_AppendItem(System.Windows.Forms.ToolStrip,System.String,System.EventHandler,System.Boolean)
Utility function for appending generic menu items.
menu: Menu to append item to.
text: Item text.
click: Delegate that handles click events. If nothing, the click event will not be handled.
enabled: If true, the item will be enabled.
Returns: The appended item

Grasshopper.Kernel.GH_DocumentObject.Menu_AppendItem(System.Windows.Forms.ToolStrip,System.String,System.EventHandler,System.Boolean,System.Boolean)
Utility function for appending generic menu items.
menu: Menu to append item to.
text: Item text.
click: Delegate that handles click events. If nothing, the click event will not be handled.
enabled: If true, the item will be enabled.
checked: If true, the item will be checked.
Returns: The appended item

Grasshopper.Kernel.GH_DocumentObject.Menu_AppendItem(System.Windows.Forms.ToolStrip,System.String,System.EventHandler,System.Drawing.Image)
Utility function for appending generic menu items.
menu: Menu to append item to.
text: Item text.
click: Delegate that handles click events. If nothing, the click event will not be handled.
icon: Item icon, or null for no icon.
Returns: The appended item

Grasshopper.Kernel.GH_DocumentObject.Menu_AppendItem(System.Windows.Forms.ToolStrip,System.String,System.EventHandler,System.Drawing.Image,System.Object)
Utility function for appending generic menu items.
menu: Menu to append item to.
text: Item text.
click: Delegate that handles click events. If nothing, the click event will not be handled.
icon: Item icon, or null for no icon.
tag: Tag to assign to menu item.
Returns: The appended item

Grasshopper.Kernel.GH_DocumentObject.Menu_AppendItem(System.Windows.Forms.ToolStrip,System.String,System.EventHandler,System.Drawing.Image,System.Boolean,System.Boolean)
Utility function for appending generic menu items.
menu: Menu to append item to.
text: Item text.
click: Delegate that handles click events.
icon: Item icon.
enabled: If true, the item will be enabled.
checked: If true, the item will be checked.
Returns: The appended item.

Grasshopper.Kernel.GH_DocumentObject.Menu_MoveItem(System.Windows.Forms.ToolStripItem,System.String[])
Utility function for moving menu items.
item: Item to move, it must already be part of a dropdown menu.
precedingItems: Names of preceding items, the item will be inserted below the first name, if that fails the second, etc. etc.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_DocumentObject.Menu_MoveItem(System.Windows.Forms.ToolStripItem,System.Boolean,System.String[])
Utility function for moving menu items.
item: Item to move, it must already be part of the dropdown menu.
insertBelow: If true, the item will be inserted below the match, if false, above the match.
targets: Names of move to targets, the item will be inserted next to the first name, if that fails the second, etc. etc.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_DocumentObject.Menu_AppendTextItem(System.Windows.Forms.ToolStripDropDown,System.String,Grasshopper.GUI.GH_MenuTextBox.KeyDownEventHandler,Grasshopper.GUI.GH_MenuTextBox.TextChangedEventHandler,System.Boolean)
Utility function for inserting text boxes into menus.
menu: Menu to add a textbox to.
text: Content of textbox.
keydown: Delegate for the KeyDown event.
textchanged: Delegate for the TextChanged event.
lockOnFocus: If true, then a GotFocus event will lock the other menu items.
Returns: The appended text box item.

Grasshopper.Kernel.GH_DocumentObject.Menu_AppendTextItem(System.Windows.Forms.ToolStripDropDown,System.String,Grasshopper.GUI.GH_MenuTextBox.KeyDownEventHandler,Grasshopper.GUI.GH_MenuTextBox.TextChangedEventHandler,System.Boolean,System.Int32,System.Boolean)
Utility function for inserting text boxes into menus.
menu: Menu to add a textbox to.
text: Content of textbox.
keydown: Delegate for the KeyDown event.
textchanged: Delegate for the TextChanged event.
enabled: If true, the textbox will be enabled.
width: If larger than zero, we'll do our very best to grow the menu to the given width. No guarantees.
lockOnFocus: If true, then a GotFocus event will lock the other menu items.
Returns: The appended text box item.

Grasshopper.Kernel.GH_DocumentObject.Menu_AppendDigitScrollerItem(System.Windows.Forms.ToolStripDropDown,System.Decimal,System.Decimal,System.Decimal,System.Int32)
Utility function for inserting a digit scroller into menus.
menu:
Returns: The digit scroller object that was inserted into the menu.

Grasshopper.Kernel.GH_DocumentObject.Menu_AppendCustomItem(System.Windows.Forms.ToolStripDropDown,System.Windows.Forms.Control)
Utility function for inserting exotic controls into dropdown menus.
menu: Dropdown to add a control to.
control: Control to insert.

Grasshopper.Kernel.GH_DocumentObject.Menu_AppendCustomItem(System.Windows.Forms.ToolStripDropDown,System.Windows.Forms.Control,Grasshopper.GUI.GH_MenuCustomControl.KeyDownEventHandler)
Utility function for inserting exotic controls into dropdown menus.
menu: Dropdown to add a control to.
control: Control to insert.
keydown: Delegate for key-presses.

Grasshopper.Kernel.GH_DocumentObject.Menu_AppendCustomItem(System.Windows.Forms.ToolStripDropDown,System.Windows.Forms.Control,Grasshopper.GUI.GH_MenuCustomControl.KeyDownEventHandler,System.Boolean,System.Int32,System.Boolean)
Utility function for inserting exotic controls into dropdown menus.
menu: Dropdown to add a control to.
control: Control to insert.
keydown: Delegate for key-presses.
enabled: If true, the control will be enabled.
width: Width hint for the control.
lockOnFocus: If true and the control gets focus, the rest of the menu will be locked.

Grasshopper.Kernel.GH_DocumentObject.Menu_AppendColourPicker(System.Windows.Forms.ToolStripDropDown,System.Drawing.Color,Grasshopper.Kernel.GH_DocumentObject.ColourEventHandler)
Add a colour picker to a menu.
menu: Menu to add to.
colour: Default colour.
colourChanged: Handler for Colour picker changed events.
Returns: Menu item representing the colour picker.

Grasshopper.Kernel.GH_DocumentObject.Menu_AppendObjectNameEx(System.Windows.Forms.ToolStripDropDown)
Appends the default object name + display mode menu item.

Grasshopper.Kernel.GH_DocumentObject.Menu_AppendObjectName(System.Windows.Forms.ToolStripDropDown)
Appends the old-fashioned object name menu item. If you also want the
Display mode toggle then use Menu_AppendObjectNameEx()

Grasshopper.Kernel.GH_DocumentObject.Menu_AppendPublish(System.Windows.Forms.ToolStripDropDown)
Appends the default item for publishing to RCP.
This menu will only appear if the current class implement IRcpAwareObject

Grasshopper.Kernel.GH_DocumentObject.HtmlHelp_Source
Return a String which contains HTML formatted source for the help topic.
If you want to pass a URL that points to a remote page, then prefix the URL with a GOTO: tag, like so:
GOTO:http://www.YourWebAddressHere.com
Remarks: You can use the GUI.GH_HtmlFormatter class to generate an HTML page which conforms to Grasshopper Help standards

Grasshopper.Kernel.GH_DocumentObject.Menu_AppendObjectHelp(System.Windows.Forms.ToolStripDropDown)
Appends the default object Help menu item.

Grasshopper.Kernel.GH_DocumentObject.DestroyIconCache
Call this method to erase the existing icon cache.
You must call this if you want to change the display icon of an object.

Grasshopper.Kernel.GH_DocumentObject.SetIconOverride(System.Drawing.Bitmap)
Set a new custom icon override for this object.
customIcon: Icon override. Should be a 24x24 image.

Grasshopper.Kernel.GH_DocumentObject.Icon_24x24
The icon associated with this object.

Grasshopper.Kernel.GH_DocumentObject.Icon_24x24_Locked
The greyscale icon of this object.

Grasshopper.Kernel.GH_DocumentObject.Internal_Icon_24x24
Override this function to supply a custom icon. The result of this property is cached,
so don't worry if icon retrieval is not very fast.

Grasshopper.Kernel.GH_DocumentObject.Icon
Override this function to supply a custom icon (24x24 pixels). The result of this property is cached,
so don't worry if icon retrieval is not very fast.

Grasshopper.Kernel.GH_DocumentObject.IconDisplayMode
Gets the current display mode of the object.

Grasshopper.Kernel.GH_DocumentObject.ComponentGuid
Returns a consistent ID for this object type. Every object must supply a unique and unchanging
ID that is used to identify objects of the same type.

Grasshopper.Kernel.GH_DocumentObject.EnsureValueTable
Ensures the existence of the value table.

Grasshopper.Kernel.GH_DocumentObject.ValueTable
Gets the value table of this object. If the value table doesn't exist yet, null will be returned.

Grasshopper.Kernel.GH_DocumentObject.ValuesChanged
Override this method if you want to respond to changes to the value table.
The base implementation is empty, so you don't have to call it.

Grasshopper.Kernel.GH_DocumentObject.GetValue(System.String,System.Boolean)
Get a boolean value from the component value table.
valueName: Name of boolean to retrieve.
default: Default value to return in case of missing named value.
Returns: The boolean value with the given name of the default value.

Grasshopper.Kernel.GH_DocumentObject.GetValue(System.String,System.Int32)
Get an integer value from the component value table.
valueName: Name of integer to retrieve.
default: Default value to return in case of missing named value.
Returns: The integer value with the given name of the default value.

Grasshopper.Kernel.GH_DocumentObject.GetValue(System.String,System.Double)
Get a double value from the component value table.
valueName: Name of double to retrieve.
default: Default value to return in case of missing named value.
Returns: The double value with the given name of the default value.

Grasshopper.Kernel.GH_DocumentObject.GetValue(System.String,System.String)
Get a string value from the component value table.
valueName: Name of string to retrieve.
default: Default value to return in case of missing named value.
Returns: The string value with the given name of the default value.

Grasshopper.Kernel.GH_DocumentObject.GetValue(System.String,System.Drawing.Color)
Get a color value from the component value table.
valueName: Name of color to retrieve.
default: Default value to return in case of missing named value.
Returns: The color value with the given name of the default value.

Grasshopper.Kernel.GH_DocumentObject.SetValue(System.String,System.Boolean)
Set a named value. This value will be serialized with the component.
valueName: Name of value.
value: Value itself.

Grasshopper.Kernel.GH_DocumentObject.SetValue(System.String,System.Int32)
Set a named value. This value will be serialized with the component.
valueName: Name of value.
value: Value itself.

Grasshopper.Kernel.GH_DocumentObject.SetValue(System.String,System.Double)
Set a named value. This value will be serialized with the component.
valueName: Name of value.
value: Value itself.

Grasshopper.Kernel.GH_DocumentObject.SetValue(System.String,System.String)
Set a named value. This value will be serialized with the component.
valueName: Name of value.
value: Value itself.

Grasshopper.Kernel.GH_DocumentObject.SetValue(System.String,System.Drawing.Color)
Set a named value. This value will be serialized with the component.
valueName: Name of value.
value: Value itself.