Grasshopper.Kernel.GH_PreviewUtil
This class exposes functionality that makes it easy to draw temporary geometry in Rhino viewports.

Grasshopper.Kernel.GH_PreviewUtil.Enabled
Gets or sets the enabled state of this Preview util.

Grasshopper.Kernel.GH_PreviewUtil.Redraw
Forces a redraw the the viewports.

Grasshopper.Kernel.GH_PreviewUtil.WireColour
Gets or sets the colour to use for Preview geometry.

Grasshopper.Kernel.GH_PreviewUtil.Clear
Clear all temporary geometry.

Grasshopper.Kernel.GH_PreviewUtil.AddPoint(Rhino.Geometry.Point3d)
Add a point to the temporary Preview lists.
point: Point to add. Invalid points will be ignored.

Grasshopper.Kernel.GH_PreviewUtil.AddLine(Rhino.Geometry.Line)
Add a line to the temporary Preview lists.
line: Line to add. Invalid lines will be ignored.

Grasshopper.Kernel.GH_PreviewUtil.AddVector(Rhino.Geometry.Line)
Add a vector to the temporary Preview lists.
vector: Vector to add. Invalid vectors will be ignored.

Grasshopper.Kernel.GH_PreviewUtil.AddPlane(Rhino.Geometry.Plane)
Add a plane to the temporary Preview lists.
plane: Plane to add. Invalid planes will be ignored.

Grasshopper.Kernel.GH_PreviewUtil.AddCurve(Rhino.Geometry.Curve)
Add a curve to the temporary Preview lists.
curve: Curve to add. Invalid curves will be ignored.

Grasshopper.Kernel.GH_PreviewUtil.AddBrep(Rhino.Geometry.Brep)
Add a brep to the temporary Preview lists.
brep: Brep to add. Invalid breps will be ignored.

Grasshopper.Kernel.GH_PreviewUtil.AddBox(Rhino.Geometry.Box)
Add a box to the temporary Preview lists.
box: Box to add.

Grasshopper.Kernel.GH_PreviewUtil.AddMesh(Rhino.Geometry.Mesh)
Add a mesh to the temporary Preview lists.
mesh: Mesh to add. Invalid meshes will be ignored.