Grasshopper.Kernel.GH_VarParamEventArgs
Arguments used in Variable Parameter events.

Grasshopper.Kernel.GH_VarParamEventArgs.Index
Gets the index of the parameter.

Grasshopper.Kernel.GH_VarParamEventArgs.Side
Gets the side of the parameter.

Grasshopper.Kernel.GH_VarParamEventArgs.Param
Gets the parameter.