Grasshopper.GUI.GH_ProgressBar
General utility progress bar.

Grasshopper.GUI.GH_ProgressBar.Message
Gets or sets the text displayed on the progress bar.

Grasshopper.GUI.GH_ProgressBar.Progress
Gets or sets the progress value (0.0 ~ 1.0)

Grasshopper.GUI.GH_ProgressBar.CurrentStep
Gets the current step of the process.

Grasshopper.GUI.GH_ProgressBar.DrawPercentage
Gets or sets a value that controls whether or not the percentage is included in progress bar rendering.

Grasshopper.GUI.GH_ProgressBar.DrawSteps
Gets or sets a value that controls whether or not the steps are included in progress bar rendering.

Grasshopper.GUI.GH_ProgressBar.SetMaxSteps(System.Int32)
Sets the maximum number of steps that will be handled during the upcoming progress.
S: Number of steps.

Grasshopper.GUI.GH_ProgressBar.SetStep(System.Int32)
Set the current step.
N: Current step.

Grasshopper.GUI.GH_ProgressBar.SetStep(System.Int32,System.String)
Set the current step and message.
N: Current step
sText: Message for this step.