Grasshopper.GUI.Canvas.GH_CanvasWireValidator
Utility validator for restricting wire creation.

Grasshopper.GUI.Canvas.GH_CanvasWireValidator.DocumentAssociation
Gets or sets the Document filter for this validator.

Grasshopper.GUI.Canvas.GH_CanvasWireValidator.WireSource
Gets or sets the wire source filter.

Grasshopper.GUI.Canvas.GH_CanvasWireValidator.WireTarget
Gets or sets the wire target filter.

Grasshopper.GUI.Canvas.GH_CanvasWireValidator.WireSourceText
Gets or sets the text to draw at the wire source location.

Grasshopper.GUI.Canvas.GH_CanvasWireValidator.WireTargetText
Gets or sets the text to draw at the wire target location.

Grasshopper.GUI.Canvas.GH_CanvasWireValidator.WireMotionText
Gets or sets the text to draw at the wire interior.

Grasshopper.GUI.Canvas.GH_CanvasWireValidator.WireDelegate
Gets or sets the delegate to be invoked when a wire is created.