Grasshopper.Kernel.IGH_UserPromptAware
Implement this interface in your IGH_Param if you want to allow users to set data
either through the menu or by double clicking.

Grasshopper.Kernel.IGH_UserPromptAware.PromptMenuSingleItem
Create a menu item that will be inserted into the Parameter context menu
for getting single values.

Grasshopper.Kernel.IGH_UserPromptAware.PromptMenuMultipleItems
Create a menu item that will be inserted into the Parameter context menu
for getting multiple values.

Grasshopper.Kernel.IGH_UserPromptAware.PromptSingleItem
Get a single item from the user.
Returns: The item if successful or nothing on abort/failure.

Grasshopper.Kernel.IGH_UserPromptAware.PromptMultipleItems
Get multiple items from the user.
Returns: A data tree of items if successful or nothing on abort/failure.