Grasshopper.Kernel.Components.GH_PlaceholderComponent.#ctor(System.Guid,System.String,Grasshopper.Kernel.GH_Document.PluginInfo)
Prevent inclusion of the placeholder in the component server
by specifying a non-empty constructor.