Grasshopper.Kernel.GH_TimeKind
Enumerates the possible kinds that a System.DateTime value can imply.

Grasshopper.Kernel.GH_TimeKind.Unset
Unset kind.

Grasshopper.Kernel.GH_TimeKind.Mixed
Mixed indicates there isn't a single clear answer.

Grasshopper.Kernel.GH_TimeKind.PureTime
DateTime value implies a pure time (no date part).

Grasshopper.Kernel.GH_TimeKind.PureDate
DateTime value implies a pute date (no time part).

Grasshopper.Kernel.GH_TimeKind.DateAndTime
DateTime value implies both a date and a time component.