Grasshopper.Kernel.Data.GH_TreeFilter
Represents a collection of rules for validating DataTree paths and indices.

Grasshopper.Kernel.Data.GH_TreeFilter.ParsePattern(System.String)
Parses a textual filter and returns an instance of the GH_TreeFilter.
If the filter cannot be parsed an exception will be thrown.
filter: Filter to parse.
Returns: An instance of GH_TreeFilter describing the textual filter.

Grasshopper.Kernel.Data.GH_TreeFilter.FindPathBrackets(System.String,System.Int32@,System.Int32@)
Locate the two curly brackets that delineate the path segment of an Index Rule set.
text: String to search.
index0: Index of opening curly bracket.
index1: Index of closing curly bracket.
Returns: True if valid brackets were found, false if not.

Grasshopper.Kernel.Data.GH_TreeFilter.FindItemBrackets(System.String,System.Int32@,System.Int32@)
Locate the two parenthesis that delineate the index segment of an Index Rule set.
text: String to search.
index0: Index of opening parenthesis.
index1: Index of closing parenthesis.
Returns: True if valid parenthesis were found, false if not.

Grasshopper.Kernel.Data.GH_TreeFilter.FindNextLevelChar(System.String,System.Int32,System.Char)
Find the next occurance of a char in a string that is level with the search start index.
text: String to search.
index: Index to search from.
char: Char to match.
Returns: The index of the first level character match or -1 if no such character could be found.

Grasshopper.Kernel.Data.GH_TreeFilter.FindPrevLevelChar(System.String,System.Int32,System.Char)
Find the previous occurance of a char in a string that is level with the search start index.
text: String to search.
index: Index to search from.
char: Char to match.
Returns: The index of the first level character match or -1 if no such character could be found.

Grasshopper.Kernel.Data.GH_TreeFilter.SplitStringWithExpressions(System.String,System.Char)
Split a string into segments using level-aware split.
This method throws exceptions if the input string is not correctly formatted.
text: String to split.
separator: Splitting character.
Returns: A list of string segments.
Throws Grasshopper.Kernel.Data.GH_BracketMismatchException: Thrown when the opening and closing brackets don't add up.
Throws Grasshopper.Kernel.Data.GH_StringMismatchException: Thrown when the string delimeter symbols don't add up.