Grasshopper.Kernel.GH_Component.GH_StructureIterator.PathIndex
Maintains all the required information regarding where to put new data.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.PathIndex.m_path
Represents the current output path for new data.
This path will be incremented during IncrementBranchIndices()

Grasshopper.Kernel.GH_Component.GH_StructureIterator.PathIndex.m_index
Represents the current index in the current path where new data will be stored.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.PathIndex.Grafted
If the current path has already been grafted, Grafted[i] will be True.
If a path has been grafted, the path field of this instance will be incomplete.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.PathIndex.Index
Gets or sets the item index component of the PathIndex.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.PathIndex.Path
Gets the current path component of this PathIndex.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.PathIndex.Collides(Grasshopper.Kernel.Data.GH_Path)
Test a path for potential collision.
path: Path to test for collision.
Returns: True if the path collides.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.PathIndex.Collision
Gets or sets the collision path.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.PathIndex.CollisionOffset
Gets or sets the collision offset.