Grasshopper.Kernel.IGH_ObjectProxy
Provides proxy data for all Grasshopper components and parameters.

Grasshopper.Kernel.IGH_ObjectProxy.Location
Gets the location of the target object. If the proxy represents a Compiled Object,
the location refers to the file path of the assembly, in the case of User Objects,
the location refers to the object file.

Grasshopper.Kernel.IGH_ObjectProxy.LibraryGuid
Gets the ID of the library (GHA file) that defines this object.

Grasshopper.Kernel.IGH_ObjectProxy.SDKCompliant
Gets whether this object is compliant with the current Rhino version.

Grasshopper.Kernel.IGH_ObjectProxy.Obsolete
Gets whether this proxy represents an obsolete object.

Grasshopper.Kernel.IGH_ObjectProxy.Type
Gets the Type for the target object. If the proxy references a User Object,
the Type member will be null.

Grasshopper.Kernel.IGH_ObjectProxy.Kind
Gets the kind of the Proxy target object.

Grasshopper.Kernel.IGH_ObjectProxy.Guid
Gets the Guid of the target object. In the case of Compiled Objects,
the Guid represents the ComponentID, in the case of User Objects,
the Guid is a hash of the file path.

Grasshopper.Kernel.IGH_ObjectProxy.Icon
Gets the icon for this object.

Grasshopper.Kernel.IGH_ObjectProxy.Desc
Gets the Instance Description associated with this proxy.

Grasshopper.Kernel.IGH_ObjectProxy.Exposure
Gets or sets the Exposure of the target object.
Only set the exposure if you know what you are doing.

Grasshopper.Kernel.IGH_ObjectProxy.DuplicateProxy
Create a duplicate of this proxy.

Grasshopper.Kernel.IGH_ObjectProxy.CreateInstance
Create a new instance from the target object.
Returns: An IGH_DocumentObject instance on success or null on failure.