Grasshopper.Kernel.GH_ListUtil
Provides utilities for dealing with list of Data from input parameters.

Grasshopper.Kernel.GH_ListUtil.RemoveNullRefs``1(System.Collections.Generic.List{``0})
Remove all null references from a list of items.
Type of list
L: List to filter
Returns: List containing only non-null items. References are shared with L

Grasshopper.Kernel.GH_ListUtil.CountNullRefs``1(System.Collections.Generic.List{``0})
Count all null references in L
Type of list
L: List to parse
Returns: Number of nulls in L

Grasshopper.Kernel.GH_ListUtil.CountNonNullRefs``1(System.Collections.Generic.List{``0})
Count all object references in L
Type of list
L: List to parse
Returns: Number of proper objects in L

Grasshopper.Kernel.GH_ListUtil.EnsureNonNullCount``1(System.Collections.Generic.List{``0},System.Int32)
Tests a list to see if it contains sufficient non-null references.
Type of list
L: List to parse
Returns: True if L contains N or more non-null references.

Grasshopper.Kernel.GH_ListUtil.FirstNonNullItem``1(System.Collections.Generic.List{``0})
Returns the index of the first non-null item in a list.
Type of list
L: List to parse.
Returns: The index of the first non-null item or -1 if no object reference could be found.