Grasshopper.Tracing
Class that provides useful static methods for debugging, tracing and messaging.

Grasshopper.Tracing.#ctor
This class only provids static (Shared in VB) methods and cannot be constructed.

Grasshopper.Tracing.Assert(System.Guid)
Display a typical ASSERT dialog with stack information.
assert_id: ID of assert message. Every assert must have a unique ID so individual messages can be ignored.

Grasshopper.Tracing.Assert(System.Guid,System.String)
Display a typical assert dialog with stack information.
assert_id: ID of assert message. Every assert must have a unique ID so individual messages can be ignored.
message: The text to display as the assert message.

Grasshopper.Tracing.Assert(System.Guid,System.Exception)
Display a typical assert dialog with stack information.
assert_id: ID of assert message. Every assert must have a unique ID so individual messages can be ignored.
exception: Exception object to harvest further information from.

Grasshopper.Tracing.Assert(System.Guid,System.String,System.Exception)
Display a typical assert dialog with stack information.
assert_id: ID of assert message. Every assert must have a unique ID so individual messages can be ignored.
message: The text to display as the assert message.
exception: Exception object to harvest further information from.

Grasshopper.Tracing.DebugLogBeginBlock(System.String)
Start a new block in the debug data. You must end all your own blocks.
This function will only work if the Grasshopper window exists. This method is threadsafe.
name: Name of block

Grasshopper.Tracing.DebugLogEndBlock
Start a new block in the debug data. You must end all your own blocks.
This function will only work if the Grasshopper window exists. This method is threadsafe.

Grasshopper.Tracing.DebugLogAddEntry(System.String)
Add a message to the debug log. If the debug log doesn't exist yet, it will be created.
This function will only work if the Grasshopper window exists. This method is threadsafe.
message: Message to post.

Grasshopper.Tracing.CloseDebugLog
Close the debug log stream.
Remarks: