Grasshopper.GUI.Script.GH_CodeBlocks
Represents a list of source code blocks in a GH_ScriptEditor window.

Grasshopper.GUI.Script.GH_CodeBlocks.GetAllLines(System.String[]@,System.Boolean[]@)
Convert all blocks to a single array of lines and readonly flags.

Grasshopper.GUI.Script.GH_CodeBlocks.GetMutableCodeBlock(System.Int32)
Get all the lines that belong to the Nth mutable code block.
index: Index of mutable code block to retrieve.
Returns: An array of source code lines or null if there is no Nth block.

Grasshopper.GUI.Script.GH_CodeBlocks.StringSplit(System.String,System.String)
String split utility class.
delim:
stream:
Returns:
Remarks:

Grasshopper.GUI.Script.GH_CodeBlocks.MergeConsecutiveBlocks
Merge all consecutive blocks with identical readonly flags.
Returns: Number of blocks merged.