Grasshopper.Kernel.GH_PickBox
Represents the different ways in which picking rectangles can behave.

Grasshopper.Kernel.GH_PickBox.Window
The picking box must completely surround the object box.

Grasshopper.Kernel.GH_PickBox.Crossing
The picking box must only partially intersect the object box.