Grasshopper.GUI.Ribbon.GH_RibbonItem


Grasshopper.GUI.Ribbon.GH_RibbonItem.Owner
Gets or sets the owner control for this item.
The GH_RibbonItem owner
Remarks: If you supply a NULL value, you cannot call any interface methods

Grasshopper.GUI.Ribbon.GH_RibbonItem.Proxy
Gets or sets the proxy object that this item refers to.