Grasshopper.Documentation.GH_RuntimeFile
Runtime representation of a Grasshopper help file.
A GH_RuntimeFile is nothing more than a collection of keywords with associated content.
This class does not interpret a file or check its validity, it merely
figures out the different content section based on "Keyword:" entries.

Grasshopper.Documentation.GH_RuntimeFile.#ctor(System.String)
This class cannot be constructed, use the ParseFile() static method instead.

Grasshopper.Documentation.GH_RuntimeFile.ParseFile(System.String)
Parse a file and return the runtime representation of said file.
path: Path to file.
Returns: The runtime representation of the file on the disk.

Grasshopper.Documentation.GH_RuntimeFile.Path
Gets the path of this help file.

Grasshopper.Documentation.GH_RuntimeFile.ContainsKey(System.String)
Test whether a certain key is present in the File.
key: Key to search for.
Returns: True if the key is present in the file, false if not.

Grasshopper.Documentation.GH_RuntimeFile.Keys
Gets a list of all the keys present in the File.

Grasshopper.Documentation.GH_RuntimeFile.Content(System.String)
Gets the data associated with a certain key. For every time the key appears
in the file, an array of content strings will be returned.
key: Key to search for, key comparison is not case-sensitive.

Grasshopper.Documentation.GH_RuntimeFile.TagAuthor
String tag used to identify Author fields in documentation source files.

Grasshopper.Documentation.GH_RuntimeFile.TagContact
String tag used to identify Author contact details in documentation source files.

Grasshopper.Documentation.GH_RuntimeFile.TagTitle
String tag used to identify title fields in documentation source files.

Grasshopper.Documentation.GH_RuntimeFile.TagSeeAlso
String tag used to identify See Also collections in documentation source files.

Grasshopper.Documentation.GH_RuntimeFile.TagCategory
String tag used to identify Category fields in documentation source files.

Grasshopper.Documentation.GH_RuntimeFile.TagKeywords
String tag used to identify Keyword collections in documentation source files.

Grasshopper.Documentation.GH_RuntimeFile.TagSynonyms
String tag used to identify Synonym collections in glossary source files.

Grasshopper.Documentation.GH_RuntimeFile.TagErranyms
String tag used to identify Do Not Confuse collections in documentation source files.

Grasshopper.Documentation.GH_RuntimeFile.TagComponent
String tag used to identify Component IDs in documentation source files.

Grasshopper.Documentation.GH_RuntimeFile.TagRhinoCommand
String tag used to identify Similar Rhino Commands in documentation source files.

Grasshopper.Documentation.GH_RuntimeFile.TagPronunciation
String tag used to identify Pronunciaion Guide fields (IPA) in glossary source files.

Grasshopper.Documentation.GH_RuntimeFile.TagExpert
String tag used t o identify Expert Level Help Content in documentation source files.

Grasshopper.Documentation.GH_RuntimeFile.TagBeginner
String tag used t o identify Beginner Level Help Content in documentation source files.

Grasshopper.Documentation.GH_RuntimeFile.TagDescription
String tag used t o identify Description fields in glossary source files.

Grasshopper.Documentation.GH_RuntimeFile.TagIntermediate
String tag used t o identify Intermediate Level Help Content in documentation source files.

Grasshopper.Documentation.GH_RuntimeFile.TagAutoLink
String tag used to signal whether automatic linking to a topic is allowed.

Grasshopper.Documentation.GH_RuntimeFile.TagInclude
String tag used to signal whether inclusion of a topic is allowed.

Grasshopper.Documentation.GH_RuntimeFile.Tags
Gets a collection of all the pre-defined keywords.
Use IsKeyword(string) if you want to know whether a string equals a keyword.
It's both faster and more reliable than comparing against this collection.

Grasshopper.Documentation.GH_RuntimeFile.IsTagLine(System.String,System.String@,System.String@)
Tests whether a line of text starts with a Grasshopper Help keyword.
line: Line of text to test.
keyword: This is where the keyword is returned.
remainder: This is where the non-keyword part of the line is returned.
Returns: True if the line starts with a keyword.

Grasshopper.Documentation.GH_RuntimeFile.IsTag(System.String)
Tests whether a string is a predefined Grasshopper Help keyword.
text: String to test. Should contain no whitespace, but does not need to properly cased.
Returns: True if text is a predefined keyword, false if not.