Grasshopper.Kernel.Special.GH_LegendData


Grasshopper.Kernel.Special.GH_LegendData.Names
Gets the internal list of names.

Grasshopper.Kernel.Special.GH_LegendData.Colours
Gets the internal list of colours.

Grasshopper.Kernel.Special.GH_LegendData.Type
Gets or sets the legend type.

Grasshopper.Kernel.Special.GH_LegendData.Bounds3D
Gets or sets the 3D bounds.

Grasshopper.Kernel.Special.GH_LegendData.Bounds2D
Gets or sets the 2D bounds.

Grasshopper.Kernel.Special.GH_LegendData.BalanceLegend
Call this method to ensure there are equal numbers of tags and colours.

Grasshopper.Kernel.Special.GH_LegendData.Render(System.Drawing.Graphics)
Render this legend to a GDI Graphics surface.
graphics: Graphics object to draw with.

Grasshopper.Kernel.Special.GH_LegendData.ClearCachedGeometry
You must call this function when making changes to the legend object
after it was drawn at least once.