Grasshopper.My.Resources.Res_FileIcons
A strongly-typed resource class, for looking up localized strings, etc.

Grasshopper.My.Resources.Res_FileIcons.ResourceManager
Returns the cached ResourceManager instance used by this class.

Grasshopper.My.Resources.Res_FileIcons.Culture
Overrides the current thread's CurrentUICulture property for all
resource lookups using this strongly typed resource class.

Grasshopper.My.Resources.Res_FileIcons.AssemblyDll_32
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_FileIcons.AssemblyExe_32
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_FileIcons.AssemblyGha_32
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_FileIcons.AssemblyRhp_32
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_FileIcons.AssemblyUnk_32
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_FileIcons.FileCSharp_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_FileIcons.FileVisualBasic_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_FileIcons.GH_Assembly_24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_FileIcons.GH_Assembly_48
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_FileIcons.GH_Cluster_48
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_FileIcons.GH_User_48
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_FileIcons.MRU_GH_32x36
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_FileIcons.MRU_GH_Missing_32x36
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_FileIcons.MRU_GHX_32x36
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_FileIcons.MRU_GHX_Missing_32x36
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_FileIcons.MRU_ScriptCache_32x36
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_FileIcons.MRU_Unknown_32x36
Looks up a localized resource of type System.Drawing.Bitmap.