Grasshopper.GUI.Widgets.GH_ProfilerWidget


Grasshopper.GUI.Widgets.GH_ProfilerWidget.ShowDuration
Gets or sets the number of milliseconds per object below which the profiler widget is not displayed.

Grasshopper.GUI.Widgets.GH_ProfilerWidget.Threshold
Gets or sets the number of milliseconds per object below which the profiler widget is not displayed.