Grasshopper.Kernel.GH_UpgradeUtil
Exposes several utility functions for migrating parameters and wires between components useful
while upgrading components.

Grasshopper.Kernel.GH_UpgradeUtil.MigrateSources(Grasshopper.Kernel.IGH_Param,Grasshopper.Kernel.IGH_Param)
Migrate all sources from A to B, while maintaining order.
from: Parameter to move sources from.
to: Parameter to move sources to.
Returns: Number of sources migrated.

Grasshopper.Kernel.GH_UpgradeUtil.MigrateSources(System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_Param},Grasshopper.Kernel.IGH_Param)
Utility method for bulk assigning a bunch of sources.

Grasshopper.Kernel.GH_UpgradeUtil.MigrateRecipients(Grasshopper.Kernel.IGH_Param,Grasshopper.Kernel.IGH_Param)
Migrate all recipients from A to B, while maintaining order.
from: Parameter to move recipients from.
to: Parameter to move recipients to.
Returns: Number of recipients migrated.

Grasshopper.Kernel.GH_UpgradeUtil.MigrateRecipients(System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_Param},Grasshopper.Kernel.IGH_Param)
Utility method for bulk assigning a bunch of sources.

Grasshopper.Kernel.GH_UpgradeUtil.MigrateInputParameters(Grasshopper.Kernel.IGH_Component,Grasshopper.Kernel.IGH_Component)
Migrate all input parameters.
source: Source component.
target: Target component.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_UpgradeUtil.MigrateInputParameters(Grasshopper.Kernel.IGH_Component,Grasshopper.Kernel.IGH_Component,System.Int32[],System.Int32[])
Migrate a bunch of input parameters.
source: Source component.
target: Target component.
index0: List of input indices to migrate.
index1: Matching list of target indices.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_UpgradeUtil.MigrateOutputParameters(Grasshopper.Kernel.IGH_Component,Grasshopper.Kernel.IGH_Component)
Migrate all output parameters.
source: Source component.
target: Target component.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_UpgradeUtil.MigrateOutputParameters(Grasshopper.Kernel.IGH_Component,Grasshopper.Kernel.IGH_Component,System.Int32[],System.Int32[])
Migrate a bunch of output parameters.
source: Source component.
target: Target component.
index0: List of output indices to migrate.
index1: Matching list of target indices.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_UpgradeUtil.ReplaceInputParameters(Grasshopper.Kernel.IGH_Component,Grasshopper.Kernel.IGH_Component)
Move all input parameters from one component to another.
Only use this function if the target component can handle the input layout of the source component.
source: Component to move parameters from.
target: Component to move parameters to.

Grasshopper.Kernel.GH_UpgradeUtil.ReplaceOutputParameters(Grasshopper.Kernel.IGH_Component,Grasshopper.Kernel.IGH_Component)
Move all output parameters from one component to another.
Only use this function if the target component can handle the output layout of the source component.
source: Component to move parameters from.
target: Component to move parameters to.

Grasshopper.Kernel.GH_UpgradeUtil.SwapComponents(Grasshopper.Kernel.IGH_Component,System.Guid)
Replace an existing component with a different one. All parameters (input and output) will be migrated.
oldComponent: Component current in a GH_Document.
newComponentGuid: ComponentGuid of the component to add.
Returns: Component that was added.

Grasshopper.Kernel.GH_UpgradeUtil.SwapComponents(Grasshopper.Kernel.IGH_Component,System.Guid,System.Boolean)
Replace an existing component with a different one. All parameters (input and output) will be migrated.
oldComponent: Component current in a GH_Document.
newComponentGuid: ComponentGuid of the component to add.
migrateParameters: If true, all parameters will be moved from old to new.
Returns: Component that was added.

Grasshopper.Kernel.GH_UpgradeUtil.SwapComponents(Grasshopper.Kernel.IGH_Component,Grasshopper.Kernel.IGH_Component)
Replace an existing component with a different one. All parameters (input and output) will be migrated.
oldComponent: Component current in a GH_Document.
newComponent: Component to swap.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_UpgradeUtil.SwapComponents(Grasshopper.Kernel.IGH_Component,Grasshopper.Kernel.IGH_Component,System.Boolean)
Replace an existing component with a different one. All parameters (input and output) will be migrated.
oldComponent: Component current in a GH_Document.
newComponent: Component to swap.
migrateParameters: If true, all parameters will be moved from old to new.
Returns: True on success, false on failure.