Grasshopper.GUI.Ribbon.GH_TabDisplay
Enumerates the possible display modes a tab can have.

Grasshopper.GUI.Ribbon.GH_TabDisplay.None
The name of a tab is not drawn, though the icon may be.

Grasshopper.GUI.Ribbon.GH_TabDisplay.FullName
The full name of the tab is drawn.

Grasshopper.GUI.Ribbon.GH_TabDisplay.ShortName
The short name of the tab is drawn.

Grasshopper.GUI.Ribbon.GH_TabDisplay.Symbol
Only a single character of the tab is drawn.

Grasshopper.GUI.Ribbon.GH_TabDisplay.Icon
Only the icon will be drawn.