Grasshopper.Kernel.GH_StringMatcher
Utility class for finding matches in a database of Strings.

Grasshopper.Kernel.GH_StringMatcher.ComputeWeight(System.String,System.String,System.StringComparison)
Compute the weight of the match. Utility function that performs all match types until a match is found.
value: Value to match.
key: Key to match against.
comp: String comparison to use during matching.
Returns: An integer describing the weighting of the match.

Grasshopper.Kernel.GH_StringMatcher.ComputeWeight(System.String,System.String,Grasshopper.Kernel.GH_MatchLevel,System.StringComparison)
Compute the weight of the match. Utility function that performs specified match types until a match is found.
value: Value to match.
key: Key to match against.
level: Matching level to apply (multiple levers are possible).
comp: String comparison to use during matching.
Returns: An integer describing the weighting of the match.

Grasshopper.Kernel.GH_StringMatcher.LevenshteinDistance(System.String,System.String)
Bottom up implementation of the Levenshtein Distance algorithm.
see: http://en.wikipedia.org/wiki/Levenshtein_distance for further details.
A: Base string. Case sensitive.
B: Target string. Case sensitive.
Returns: Number of edit operations required to change A into B.