Grasshopper.My.Resources.Res_TextData
A strongly-typed resource class, for looking up localized strings, etc.

Grasshopper.My.Resources.Res_TextData.ResourceManager
Returns the cached ResourceManager instance used by this class.

Grasshopper.My.Resources.Res_TextData.Culture
Overrides the current thread's CurrentUICulture property for all
resource lookups using this strongly typed resource class.

Grasshopper.My.Resources.Res_TextData.CultureLocales
Looks up a localized string similar to af-ZA;Afrikaans;South Africa;Zuid Afrika
am-ET;Amharic;Ethiopia;Amarəñña
ar-AE;Emirati;Emirates;Arab Emirates;U.A.E;UAE
ar-BH;Bahrain;Bahrani
ar-DZ;Algeria;Algerian
ar-EG;Egypt;Egyptian;Masˤreyyīn
ar-IQ;Iraq;Iraqi;Irāqīyūn;Iraqiyun
ar-JO;Jordan;Jordanian
ar-KW;Kuwait;Kuwaiti
ar-LB;Lebanon;Lebanese
ar-LY;Libya;Libyan
ar-MA;Morocco;Moroccan
arn-CL;Mapudungun
ar-OM;Oman;Omani
ar-QA;Qatar
ar-SA;Arabic;Saudi Arabia
ar-SY;Syria
ar-TN;Tunisia;Tunis
ar-YE;Yemen;Yemeni
as-IN;Assamese;Ôxômiya;Oxomiya
az-Latn-AZ;Azeri [rest of string was truncated]";.

Grasshopper.My.Resources.Res_TextData.LineParserTemplate
Looks up a localized string similar to Option Strict Off
Option Explicit On
Imports Rhino
Imports Rhino.Geometry
Imports Rhino.DocObjects
Imports Rhino.Collections
Imports Grasshopper
Imports Grasshopper.Kernel
Imports Grasshopper.Kernel.Data
Imports Grasshopper.Kernel.Types
Imports Grasshopper.Kernel.Expressions
Imports System
Imports System.IO
Imports System.Xml
Imports System.Xml.Linq
Imports System.Linq
Imports System.Data
Imports System.Text
Imports System.Drawing
Imports System.Reflection
Imports System.Collections
Imports System.Window [rest of string was truncated]";.

Grasshopper.My.Resources.Res_TextData.Pangrams
Looks up a localized string similar to The wizard quickly jinxed the gnomes before they vaporized.
The quick brown fox jumps over the lazy dog.
Pack my box with five dozen liquor jugs.
My faxed joke won a pager in the cable TV quiz show.
Amazingly few discotheques provide jukeboxes.
By Jove, my quick study of lexicography won a prize.
Sixty zippers were quickly picked from the woven jute bag.
Just keep examining every low bid quoted for zinc etchings.
Nechť již hříšné saxofony ďáblů rozzvučí síň úděsnými tóny waltzu, tanga a quickstepu.
Quizdelt [rest of string was truncated]";.