Grasshopper.Kernel.Data.GH_Structure`1
Represents a data tree where each branch has a unique path
The data type that this structure maintains. Must implement IGH_Goo or derive from a class that implements IGH_Goo.

Grasshopper.Kernel.Data.GH_Structure`1.#ctor
Default constructor, create a blank data structure.

Grasshopper.Kernel.Data.GH_Structure`1.#ctor(Grasshopper.Kernel.Data.GH_Structure{`0},System.Boolean)
Copy constructor, duplicate another data structure.
other: Structure to copy, if null, this structure will be empty.
shallowCopy: If True, data item pointers are shared among this and the [other] structure.

Grasshopper.Kernel.Data.GH_Structure`1.Duplicate
Create an exact duplicate of this structure. All data items are copied as well.

Grasshopper.Kernel.Data.GH_Structure`1.ShallowDuplicate
Create a structure with a similar topology to this one with pointers to the same data items.

Grasshopper.Kernel.Data.GH_Structure`1.DuplicateCast``1(Grasshopper.Kernel.Data.GH_Structure{`0}.ConversionDelegate{`0,``0})
Create a duplicate of this structure in a different type.
Type of conversion.
conversion: Conversion delegate.
Returns: A duplicate of this structure with all valid casts.

Grasshopper.Kernel.Data.GH_Structure`1.IsEmpty
Gets the Empty state of the structure. If the structure is Empty it contains no paths and no branches.

Grasshopper.Kernel.Data.GH_Structure`1.PathCount
Gets the number of paths defined in this structure.

Grasshopper.Kernel.Data.GH_Structure`1.DataCount
Gets the total number of data items stored in all paths.

Grasshopper.Kernel.Data.GH_Structure`1.Paths
Gets a list of all the paths in this structure.

Grasshopper.Kernel.Data.GH_Structure`1.Branches
Gets a list of all the data-arrays in this structure

Grasshopper.Kernel.Data.GH_Structure`1.StructureProxy
Gets a proxy list of all the data-arrays in this structure.

Grasshopper.Kernel.Data.GH_Structure`1.TopologyDescription
Gets a description of the topology of the structure.
Useful for debugging purposes.

Grasshopper.Kernel.Data.GH_Structure`1.PathExists(Grasshopper.Kernel.Data.GH_Path)
Returns True if the specified path is already defined inside the structure.
path: The data path to search for

Grasshopper.Kernel.Data.GH_Structure`1.PathIndex(Grasshopper.Kernel.Data.GH_Path,System.Int32@,System.Int32@)
Find the indices that surround the given path domain. Indices may be out of bounds.
path: Path to search for (it need not exist in the structure).
idx0: The index of the path itself or the first smaller path if the path is not defined.
idx1: The index of th path itself of the first larger path if the path is not defined.

Grasshopper.Kernel.Data.GH_Structure`1.EnsurePath(System.Int32[])
Create a new branch with the specified path if it doesn't already exists.
path: Path of the branch to ensure.
Returns: The list that belongs to the specified path.

Grasshopper.Kernel.Data.GH_Structure`1.EnsurePath(Grasshopper.Kernel.Data.GH_Path)
Create a new branch with the specified path if it doesn't already exists.
path: Path of the branch to ensure.
Returns: The list that belongs to the specified path.

Grasshopper.Kernel.Data.GH_Structure`1.RemovePath(Grasshopper.Kernel.Data.GH_Path)
Removes a path and all associated data from the structure.
If the path doesn't exist, nothing will happen.
path: Path to remove.

Grasshopper.Kernel.Data.GH_Structure`1.RemoveData(`0)
Removes the first occurence of a data instance in the tree.
data: Data to remove.

Grasshopper.Kernel.Data.GH_Structure`1.Path(System.Int32)
Gets the data path at the specified index.
index: Index of path to retrieve.
Throws System.IndexOutOfRangeException: Thrown if the index does not represent a valid path.

Grasshopper.Kernel.Data.GH_Structure`1.LongestPathIndex
Finds the path in this structure with the most dimensions.
In case of multiple equally long longest paths, the last one
will be returned.
Returns: The index of the longest path or -1 if there are no paths.

Grasshopper.Kernel.Data.GH_Structure`1.ShortestPathIndex
Finds the path in this structure with the least dimensions.
In case of multiple equally long longest paths, the first one
will be returned.
Returns: The index of the shortest path or -1 if there are no paths.

Grasshopper.Kernel.Data.GH_Structure`1.Branch(Grasshopper.Kernel.Data.GH_Path)
Gets a limited access pointer to the data list associated with a certain path.
path: Data path to retrieve.

Grasshopper.Kernel.Data.GH_Structure`1.Branch(System.Int32)
Gets a limited access pointer to the data list at the specified index
index: Index of data to retrieve.

Grasshopper.Kernel.Data.GH_Structure`1.DataList(System.Int32)
Gets a direct pointer to the list of data under the specified index.
index: Index of the data branch to retrieve.
Throws System.IndexOutOfRangeException: Thrown if the index does not represent a valid branch.

Grasshopper.Kernel.Data.GH_Structure`1.DataList(Grasshopper.Kernel.Data.GH_Path)
Gets a direct pointer to the list of data under a specific path.
path: Path of the data branch to retrieve. If the path doesn't exist, null is returned.

Grasshopper.Kernel.Data.GH_Structure`1.DataItem(Grasshopper.Kernel.Data.GH_Path,System.Int32)
Gets a direct pointer to a data item under a specific path and index.
path: Path of the data branch to retrieve.
index: Index of item to retrieve.
Throws System.NullReferenceException: Thrown if the path doesn't exist.
Throws System.IndexOutOfRangeException: Thrown if the index does not exist within the path list.

Grasshopper.Kernel.Data.GH_Structure`1.DataItem(System.Int32)
Gets the item at a given offset. The structure is treated as a linear list in this case.
If index is out of range, null is returned. For repeated indexed retrieval,
consider using a For Each loop since the enumerator is more efficient.
index: Offset of item to retrieve
Throws System.IndexOutOfRangeException: Thrown if index is smaller than zero or larger than the size of the collection

Grasshopper.Kernel.Data.GH_Structure`1.FirstItem(System.Boolean)
Gets the first item in the structure.
If no such item exists, null is returned.
filter_nulls: If True, nulls will be skipped.

Grasshopper.Kernel.Data.GH_Structure`1.LastItem(System.Boolean)
Gets the last item in the structure.
If no such item exists, null is returned.
filter_nulls: If True, nulls will be skipped.

Grasshopper.Kernel.Data.GH_Structure`1.Append(`0)
Append a data item to the last branch in the structure.
If no branch exist yet, a new one will be created with [path = {0}]
data: Data to append.

Grasshopper.Kernel.Data.GH_Structure`1.Append(`0,Grasshopper.Kernel.Data.GH_Path)
Append a data item to the specified branch in the structure.
If the branch doesn't exist yet, it will be created.
data: Data to append
path: Data path

Grasshopper.Kernel.Data.GH_Structure`1.AppendRange(System.Collections.Generic.IEnumerable{`0})
Append a list of data items to the last branch in the structure
data: Data to append

Grasshopper.Kernel.Data.GH_Structure`1.AppendRange(System.Collections.Generic.IEnumerable{`0},Grasshopper.Kernel.Data.GH_Path)
Append a list of data items to the specified branch in the structure.
If the branch doesn't exist yet, it will be created.
data: Data to append
path: Data path

Grasshopper.Kernel.Data.GH_Structure`1.Insert(`0,Grasshopper.Kernel.Data.GH_Path,System.Int32)
Insert a data item into the specified branch in the structure.
If the branch doesn't exist yet, it will be created.
data: Data to insert.
path: Path of branch to insert into.
index: Insertion index.

Grasshopper.Kernel.Data.GH_Structure`1.MergeStructure(Grasshopper.Kernel.Data.GH_Structure{`0})
Merges two structures together. Data inside similar paths will be merged into single lists
and unique paths will be appended. The other structure will not be altered, so beware that data is
now shared among both structures.
other: Structure to merge

Grasshopper.Kernel.Data.GH_Structure`1.ReplacePath(Grasshopper.Kernel.Data.GH_Path,Grasshopper.Kernel.Data.GH_Path)
Replace an existing path with a different one.
If the operation is successfull, then the 'find' path
will be deleted. If the 'replace' path is already defined,
the items in 'find' will be appended to the existing path.
find: The path to search for.
replace: The new path.

Grasshopper.Kernel.Data.GH_Structure`1.ExpandPath(Grasshopper.Kernel.Data.GH_Path,System.Int32,Grasshopper.Kernel.Data.GH_ExpandMode)
Expand a path in this structure by appending an element.
path: Path to expand, if the path doesn't exist, nothing will happen.
element: Element to append to the path.
mode: Expansion mode.

Grasshopper.Kernel.Data.GH_Structure`1.AllData(System.Boolean)
Gets an enumerator for all the data items in this structure.
skipNulls: If True, null items will be skipped.

Grasshopper.Kernel.Data.GH_Structure`1.Clear
Clears the entire structure.

Grasshopper.Kernel.Data.GH_Structure`1.ClearData
Removes all data from all paths without affecting the structure topology.

Grasshopper.Kernel.Data.GH_Structure`1.TrimExcess
Trims the excess allocated memory in all branches.

Grasshopper.Kernel.Data.GH_Structure`1.EnsureCapacity(System.Int32)
Ensures that all current branches have a certain capacity.
capacity: Capacity per branch.

Grasshopper.Kernel.Data.GH_Structure`1.Reverse
Reverse the order of items in all branches.

Grasshopper.Kernel.Data.GH_Structure`1.Graft(System.Boolean)
Grafts all paths by reallocating all data into child paths.
clearSingleNulls: If True, nulls will not be grafted.

Grasshopper.Kernel.Data.GH_Structure`1.Graft(Grasshopper.Kernel.Data.GH_Path,System.Boolean)
Grafts a specific path by reallocating all data into child paths.
If a grafted path coincides with an existing path,
the data item in question will be appended to the existing path.
path: Path of data to graft.
clearSingleNulls: If true, nulls will not be grafted.

Grasshopper.Kernel.Data.GH_Structure`1.Graft(Grasshopper.Kernel.Data.GH_GraftMode)
Grafts all paths by reallocating all data into child paths.
mode: Graft mode.

Grasshopper.Kernel.Data.GH_Structure`1.Graft(Grasshopper.Kernel.Data.GH_GraftMode,Grasshopper.Kernel.Data.GH_Path)
Grafts a specific path by reallocating all data into child paths.
If a grafted path coincides with an existing path,
the data item in question will be appended to the existing path.
mode: Graft mode.
path: Path to graft

Grasshopper.Kernel.Data.GH_Structure`1.Flatten(Grasshopper.Kernel.Data.GH_Path)
Flattens the entire structure into a single path.
flat_path: The path of the flattened data. If null, the path will be {0}

Grasshopper.Kernel.Data.GH_Structure`1.FlattenData
Collects all data in the structure under a single list.
Does not alter the state of this structure.
Returns: A linear list containing all data items in all branches.

Grasshopper.Kernel.Data.GH_Structure`1.Simplify(Grasshopper.Kernel.Data.GH_SimplificationMode)
Simplify the data structure by collapsing path indices shared by all branches.
mode: Simplification algorithm to use.

Grasshopper.Kernel.Data.GH_Structure`1.DataDescription(System.Boolean,System.Boolean)
Gets a description of the data contained in this structure.
includeIndices: If true, every data item will be prefixed by its index.
includePaths: If true, every branch of data will be preceded by the path.
Returns: A string describing the data.

Grasshopper.Kernel.Data.GH_Structure`1.NonNulls
Get an enumerator for this structure that allow
linear iteration over the data hierarchy while
skipping all Null entries.
This Enumerator has been optimized,
do not cache instances of it.

Grasshopper.Kernel.Data.GH_Structure`1.Write(GH_IO.Serialization.GH_IWriter)
Write the entire GH_Structure to an archive.
This method relies on the the serialization of the IGH_Goo items it contains.
writer: Archive to write to.
Returns: True on success, false on failure.

Grasshopper.Kernel.Data.GH_Structure`1.Read(GH_IO.Serialization.GH_IReader)
Read the entire GH_Structure from an archive.
This method relies on the the serialization of the IGH_Goo items it contains.
Also, the IGH_Goo T generic must have a public constructor that takes no arguments.
reader: Archive to read from.
Returns: True on success, false on failure.