Grasshopper.GUI.GH_SourceCodeBlock
Represents a continuous collection of source code lines with similar READONLY flags.

Grasshopper.GUI.GH_SourceCodeBlock.#ctor(System.Int32,System.Int32,System.Boolean)
Create a new block.
i0: Line index for start of block
i1: Line index for end of block
b_readonly: State flag of block

Grasshopper.GUI.GH_SourceCodeBlock.Grow(System.Int32)
Grow this block to include the given line index.

Grasshopper.GUI.GH_SourceCodeBlock.Start
Inclusive start line index of block.

Grasshopper.GUI.GH_SourceCodeBlock.End
Inclusive end line index of block.

Grasshopper.GUI.GH_SourceCodeBlock.LineCount
Number of lines contained in this block.

Grasshopper.GUI.GH_SourceCodeBlock.Readonly
Gets the Readonly flag for this block.