Grasshopper.GUI.Canvas.TagArtists.IGH_TagArtist
Defines the interface for TagArtist objects. TagArtists can be used
to paint additional stuff onto a GH_Canvas.

Grasshopper.GUI.Canvas.TagArtists.IGH_TagArtist.ID
Gets the ID of this Tag Artist object.

Grasshopper.GUI.Canvas.TagArtists.IGH_TagArtist.Paint(Grasshopper.GUI.Canvas.GH_Canvas,Grasshopper.GUI.Canvas.GH_CanvasChannel)
This method is called whenever a Canvas channel is painted
canvas: Canvas that is currently painting.
channel: Channel that is currently being painted.