Grasshopper.EtoExtensions.RunWithMessageLoop``1(System.Threading.Tasks.Task{``0})
DO NOT USE, THIS WILL CAUSE DEADLOCKS!!!! This is for compatibility purposes only.
Runs the task until completion, pumping the message loop while waiting for completion or fault.
Return type
task: Task to wait for
Returns: