Grasshopper.Plugin.GH_ResourceGate
This class provides access to specific resources of the Grasshopper assembly.

Grasshopper.Plugin.GH_ResourceGate.WhiteIcon
Returns a 24x24 square white icon.

Grasshopper.Plugin.GH_ResourceGate.BlackIcon
Returns a 24x24 hexagonal black icon.

Grasshopper.Plugin.GH_ResourceGate.OK_40x40
Returns a 40x40 round green icon

Grasshopper.Plugin.GH_ResourceGate.OK_24x24
Returns a 24x24 round green icon

Grasshopper.Plugin.GH_ResourceGate.OK_16x16
Returns a 16x16 round green icon

Grasshopper.Plugin.GH_ResourceGate.OK_12x12
Returns a 12x12 round green icon

Grasshopper.Plugin.GH_ResourceGate.Warning_40x40
Returns a 40x40 round yellow icon

Grasshopper.Plugin.GH_ResourceGate.Warning_24x24
Returns a 24x24 round yellow icon

Grasshopper.Plugin.GH_ResourceGate.Warning_16x16
Returns a 16x16 round yellow icon

Grasshopper.Plugin.GH_ResourceGate.Warning_12x12
Returns a 12x12 round yellow icon

Grasshopper.Plugin.GH_ResourceGate.Error_40x40
Returns a 40x40 round red icon

Grasshopper.Plugin.GH_ResourceGate.Error_24x24
Returns a 24x24 round red icon

Grasshopper.Plugin.GH_ResourceGate.Error_16x16
Returns a 16x16 round red icon

Grasshopper.Plugin.GH_ResourceGate.Error_12x12
Returns a 12x12 round red icon

Grasshopper.Plugin.GH_ResourceGate.Info_40x40
Returns a 40x40 round blue icon

Grasshopper.Plugin.GH_ResourceGate.Info_24x24
Returns a 24x24 round blue icon

Grasshopper.Plugin.GH_ResourceGate.Info_16x16
Returns a 16x16 round blue icon

Grasshopper.Plugin.GH_ResourceGate.Info_12x12
Returns a 12x12 round blue icon