Grasshopper.GUI.Script.GH_ScriptEditorButton
Inherit from this class if you want to add custom buttons to a GH_ScriptEditor toolbar.

Grasshopper.GUI.Script.GH_ScriptEditorButton.Bounds
Gets or sets the bounds of this button.
Bounds are set and read by the script window layour mechanism.

Grasshopper.GUI.Script.GH_ScriptEditorButton.Icon
Gets the 24x24 image icon for this button.
This property is called on every redraw so make it spiffy.

Grasshopper.GUI.Script.GH_ScriptEditorButton.PopulateTooltip(System.Object,Grasshopper.GUI.GH_TooltipDisplayEventArgs)
Populate the tooltip.

Grasshopper.GUI.Script.GH_ScriptEditorButton.FormHandleCreated(Grasshopper.GUI.Script.GH_ScriptEditor)
Called once, when the script editor is created.
window:

Grasshopper.GUI.Script.GH_ScriptEditorButton.FormHandleDestroyed(Grasshopper.GUI.Script.GH_ScriptEditor)
Called once, when the script editor is destroyed.

Grasshopper.GUI.Script.GH_ScriptEditorButton.HighlightOnHover
Gets whether this button should be highlighted when the mouse moves over it.

Grasshopper.GUI.Script.GH_ScriptEditorButton.Highlight
Gets whether this button should have a highlight drawn regardless of mouse hover state.

Grasshopper.GUI.Script.GH_ScriptEditorButton.RespondToMouseDown(Grasshopper.GUI.Script.GH_ScriptEditor,System.Windows.Forms.MouseEventArgs)
Respond to a mouse down event.
window: Script editor maintaining this button.
e: Mouse event arguments.