Grasshopper.Kernel.Types.Complex
Complex number type in Grasshopper. Do not confuse with GH_Complex which is the
IGH_Goo implementation of ComplexNumber.

Grasshopper.Kernel.Types.Complex.Real
Gets or sets the real component of the Complex number.

Grasshopper.Kernel.Types.Complex.Imaginary
Gets or sets the imaginary component of the Complex number.

Grasshopper.Kernel.Types.Complex.IsValid
Gets the validity of this number.

Grasshopper.Kernel.Types.Complex.IsZero
Gets whether or not this complex number equals {0.0; 0.0}

Grasshopper.Kernel.Types.Complex.IsReal
Gets whether this complex number only has a real component.

Grasshopper.Kernel.Types.Complex.IsRealNonNegative
Gets whether this complex number only has a positive real component.

Grasshopper.Kernel.Types.Complex.Argument
Gets or sets the complex argument.