Grasshopper.My.Resources.Res_Overlay
A strongly-typed resource class, for looking up localized strings, etc.

Grasshopper.My.Resources.Res_Overlay.ResourceManager
Returns the cached ResourceManager instance used by this class.

Grasshopper.My.Resources.Res_Overlay.Culture
Overrides the current thread's CurrentUICulture property for all
resource lookups using this strongly typed resource class.

Grasshopper.My.Resources.Res_Overlay.Extra_Black_24x7
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_Overlay.Grid_White_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_Overlay.New_Black_18x7
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_Overlay.NonCompliantOverlay_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_Overlay.Obsolete_Overlay_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_Overlay.Plus_Black_7x7
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_Overlay.Plus_White_7x7
Looks up a localized resource of type System.Drawing.Bitmap.