Grasshopper.Kernel.IGH_ContextualParameter
Base interface for contextual parameters.
This makes accessing non-strongly-typed functionality easier.

Grasshopper.Kernel.IGH_ContextualParameter.Prompt
Gets the prompt to be displayed while asking the user to enter data.
The prompt string may contain '{0}' fields which will be populated with
the amount of values picked so far.

Grasshopper.Kernel.IGH_ContextualParameter.AtLeast
Minimum number of inputs to request

Grasshopper.Kernel.IGH_ContextualParameter.AtMost
Maximum number of inputs to request.

Grasshopper.Kernel.IGH_ContextualParameter.Immediate
Gets whether this parameter triggers immediate updates from inside
its getter. Immediacy is important for a smooth experience,
but it maybe disabled if the expected recalculation time becomes
excessive.

Grasshopper.Kernel.IGH_ContextualParameter.ContextualData
Iterate over all specified contextual values.

Grasshopper.Kernel.IGH_ContextualParameter.AssignContextualData(System.Collections.IEnumerable)
Assign a collection of values as contextual data.
data: Data to assign. Should be of expected type.

Grasshopper.Kernel.IGH_ContextualParameter.AutoAssignContextualData(Grasshopper.Kernel.GH_ParameterContext)
Use the in-build getter UI to assign data to the parameter.