Grasshopper.Kernel.Types.GH_DetailView
Represents a Rhino model detail view. Wraps the functionality of the Rhino.Geometry.DetailView type.

Grasshopper.Kernel.Types.GH_DetailView.#ctor
Default constructor, creates an invalid detail view.

Grasshopper.Kernel.Types.GH_DetailView.#ctor(Rhino.Geometry.DetailView)
Create a duplicate of an existing detail view.
detailView: DetailView to duplicate

Grasshopper.Kernel.Types.GH_DetailView.#ctor(System.Guid)
Create a new referenced detail view that references a Rhino detail view with the specified ID.
ref_guid: ID of detail view object to reference.

Grasshopper.Kernel.Types.GH_DetailView.#ctor(Grasshopper.Kernel.Types.GH_DetailView)
Create a duplicate of another GH_DetailView. This constructor also copies reference data.
other: Detail View to duplicate

Grasshopper.Kernel.Types.GH_DetailView.DuplicateGeometry
Create a duplicate of this hatch.

Grasshopper.Kernel.Types.GH_DetailView.DuplicateDetailView
Create a duplicate of this hatch.

Grasshopper.Kernel.Types.GH_DetailView.IsValid
Gets the validity of this detail view. If the detail view is referenced but cannot be loaded, the detail view is not valid.

Grasshopper.Kernel.Types.GH_DetailView.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Kernel.Types.GH_DetailView.ToString
Format the detail view using default grasshopper formatting logic.

Grasshopper.Kernel.Types.GH_DetailView.ClearCaches
Clears all volatile caches for this instance. The boundingbox is cleared, and if the detail view is referenced,
the local instance of the detail view is erased.

Grasshopper.Kernel.Types.GH_DetailView.IsGeometryLoaded
Gets the load state of this detail view object. The detail view is considered to be loaded when the local detail view instance is not null.

Grasshopper.Kernel.Types.GH_DetailView.LoadGeometry(Rhino.RhinoDoc)
If the detail view is referenced and not yet loaded, attempts to load the detail view.
Returns: True if the detail view is loaded (or if it was already loaded), False on failure.