Grasshopper.Kernel.Types.GH_PointUtil.#ctor
This class cannot be constructed.

Grasshopper.Kernel.Types.GH_PointUtil.FitPlaneThroughPoints(System.Collections.Generic.IEnumerable{Grasshopper.Kernel.Types.GH_Point})
Fit a least-squares plane through a collection of points.
pts: Points to fit, may contain nulls.
Returns: Best fit plane or null if insufficient points were supplied.

Grasshopper.Kernel.Types.GH_PointUtil.PullPointsToPlane(System.Collections.Generic.IEnumerable{Grasshopper.Kernel.Types.GH_Point},Rhino.Geometry.Plane,System.Boolean)
Pull a list of points onto the plane. The result will be points in 3D world coordinates
which are coincident with the given plane.
pts: Points to pull.
plane: Plane to pull onto.
include_nulls: If True, nulls in the pts list are maintained.

Grasshopper.Kernel.Types.GH_PointUtil.ProjectPointsToPlane(System.Collections.Generic.IEnumerable{Grasshopper.Kernel.Types.GH_Point},Rhino.Geometry.Plane,System.Boolean)
Project a list of points onto the plane. The result will be points in plane-uv coordinates.
pts: Points to project.
plane: Plane to project onto.
include_nulls: If True, nulls in the pts list are maintained.

Grasshopper.Kernel.Types.GH_PointUtil.RemapPointsToPlane(System.Collections.Generic.IEnumerable{Grasshopper.Kernel.Types.GH_Point},Rhino.Geometry.Plane,System.Boolean)
Remap a list of points onto the plane. This operation equals a ChangeBasisXForm for each point.
pts: Points to remap.
plane: Plane to remap with.
include_nulls: If True, nulls in the pts list are maintained.