Grasshopper.GUI.Script.GH_CustomReference
Represents a custom (user) assembly reference.

Grasshopper.GUI.Script.GH_CustomReference.Path
Gets or sets the reference path.

Grasshopper.GUI.Script.GH_CustomReference.Assembly
Gets or sets the reference Assembly.