Grasshopper.Kernel.GH_ExternalFile
Represents information about external files to be loaded.

Grasshopper.Kernel.GH_ExternalFile.#ctor(System.String)
Create a new instance of the file info class
path:

Grasshopper.Kernel.GH_ExternalFile.FilePath
Gets the file path.

Grasshopper.Kernel.GH_ExternalFile.FileName
Gets the file name (without the extension).

Grasshopper.Kernel.GH_ExternalFile.FileType
Gets the file type as indicated by the extension.

Grasshopper.Kernel.GH_ExternalFile.FileHash
Gets the file hash.

Grasshopper.Kernel.GH_ExternalFile.FileSize
Gets the file size (in bytes).

Grasshopper.Kernel.GH_ExternalFile.IsIdenticalTo(Grasshopper.Kernel.GH_ExternalFile)
Compares two files for content. If the size and the hash or the other file are equal to this one, the files are considered identical.