Grasshopper.Kernel.GH_MarkovOutcome
Represents a single Markov chain outcome.

Grasshopper.Kernel.GH_MarkovOutcome.Id
Gets the ID of the object inferred by this outcome.

Grasshopper.Kernel.GH_MarkovOutcome.Valence
Gets or sets the valence of this outcome.

Grasshopper.Kernel.GH_MarkovOutcome.IsInsignificant
Gets a value indicating whether or not this outcome is insignificant.

Grasshopper.Kernel.GH_MarkovOutcome.IncreaseValence
Increase the valence of this outcome by 1.

Grasshopper.Kernel.GH_MarkovOutcome.DecreaseValence
Decrease the valence of this outcome by 1.