Grasshopper.Kernel.Types.GH_Number
Represents a double-precision floating point number. GH_Number re-implements the framework System.Double type.

Grasshopper.Kernel.Types.GH_Number.#ctor
Blank constructor

Grasshopper.Kernel.Types.GH_Number.IsValid
Gets the validity of this instance. If the number is NaN, then it is considered invalid

Grasshopper.Kernel.Types.GH_Number.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Kernel.Types.GH_Number.QC_Type


Grasshopper.Kernel.Types.GH_Number.QC_Hash


Grasshopper.Kernel.Types.GH_Number.QC_Distance(Grasshopper.Kernel.Types.IGH_QuickCast)


Grasshopper.Kernel.Types.GH_Number.QC_Bool


Grasshopper.Kernel.Types.GH_Number.QC_Complex


Grasshopper.Kernel.Types.GH_Number.QC_Matrix


Grasshopper.Kernel.Types.GH_Number.QC_Int


Grasshopper.Kernel.Types.GH_Number.QC_Num


Grasshopper.Kernel.Types.GH_Number.QC_Text


Grasshopper.Kernel.Types.GH_Number.QC_Pt


Grasshopper.Kernel.Types.GH_Number.QC_Vec


Grasshopper.Kernel.Types.GH_Number.QC_Col


Grasshopper.Kernel.Types.GH_Number.QC_Interval


Grasshopper.Kernel.Types.GH_Number.QC_CompareTo(Grasshopper.Kernel.Types.IGH_QuickCast)
