Grasshopper.GUI.Canvas.GH_Orientation
Enumerates possible alignments.

Grasshopper.GUI.Canvas.GH_Orientation.horizontal_center
Text is drawn horizontally, centered in the middle of the context.

Grasshopper.GUI.Canvas.GH_Orientation.horizontal_near
Text is drawn horizontally, aligned near to the context edge.

Grasshopper.GUI.Canvas.GH_Orientation.horizontal_far
Text is drawn horizontally, aligned far from the context edge.

Grasshopper.GUI.Canvas.GH_Orientation.vertical_center
Text is drawn vertically, centered in the middle of the context.

Grasshopper.GUI.Canvas.GH_Orientation.vertical_near
Text is drawn vertically, aligned near to the context edge.

Grasshopper.GUI.Canvas.GH_Orientation.vertical_far
Text is drawn vertically, aligned far from the context edge.