Grasshopper.Kernel.Geometry.Circle2
Represents a circle, defined by origin and radius

Grasshopper.Kernel.Geometry.Circle2.#ctor
Blank constructor

Grasshopper.Kernel.Geometry.Circle2.#ctor(Grasshopper.Kernel.Geometry.Node2,System.Double)
Create a circle from origin and radius
origin: Origin point of circle
radius: Radius of circle (>0.0 for valid circle)

Grasshopper.Kernel.Geometry.Circle2.#ctor(Grasshopper.Kernel.Geometry.Circle2)
Duplicate another circle.
other: Circle to mimic

Grasshopper.Kernel.Geometry.Circle2.#ctor(Grasshopper.Kernel.Geometry.Node2,Grasshopper.Kernel.Geometry.Node2,Grasshopper.Kernel.Geometry.Node2)
Create a circle through 3 points.
A: First point
B: Second point
C: Third point

Grasshopper.Kernel.Geometry.Circle2.Circle3Pt(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double@,System.Double@,System.Double@)
Fit a circle through three 2d points.
ax: X of first point
ay: Y of first point
bx: X of second point
by: Y of second point
cx: X of third point
cy: Y of third point
ox: X of origin
oy: Y of origin
r2: Radius squared
Returns: True if circle is valid, False if points are coincident or colinear.

Grasshopper.Kernel.Geometry.Circle2.Duplicate
Create an exact duplicate of this circle.

Grasshopper.Kernel.Geometry.Circle2.PointAt(System.Double)
Get the point ON the circle at parameter t
t: Parameter to evaluate at: (0.0, t, 2pi)