Grasshopper.GUI.Stacks.GH_Stack
Represents a manager for animating asynchronous box movements.
This is a useful feature for GUIs that want to mimic physical behaviour or
continuous UI changes.
Remarks: This class is ABSOLUTELY NOT Thread-safe.

Grasshopper.GUI.Stacks.GH_Stack.m_thread_owner
Represents the UI portion of this stack.

Grasshopper.GUI.Stacks.GH_Stack.m_thread_update
Represents the delegate to be called when the internal timer fires.

Grasshopper.GUI.Stacks.GH_Stack.m_thread_complete
Represents the delegate to be called when the layout has completed.

Grasshopper.GUI.Stacks.GH_Stack.m_interpolation
Interpolation mode for Stack Animations.

Grasshopper.GUI.Stacks.GH_Stack.m_duration
Duration of individual stack animations in milliseconds.

Grasshopper.GUI.Stacks.GH_Stack.m_interval
Framerate interval (in milliseconds) for update events

Grasshopper.GUI.Stacks.GH_Stack.m_stack_0
Contains the dimensions of all boxes at t=0

Grasshopper.GUI.Stacks.GH_Stack.m_stack_1
Contains the dimensions of all boxes at t=1

Grasshopper.GUI.Stacks.GH_Stack.m_motion
Contains motion logic for all stack elements.

Grasshopper.GUI.Stacks.GH_Stack.Destroy
Call this function when you are certain you will no longer need the stack.
It will disable any current update events and clear animation instances.

Grasshopper.GUI.Stacks.GH_Stack.Count
Gets the number of items in the stack.

Grasshopper.GUI.Stacks.GH_Stack.InMotion
Gets a value that indicates whether or not any element in this stack is currently in motion.
Returns: True if the stack is still (partly) in motion.

Grasshopper.GUI.Stacks.GH_Stack.InMotion(System.Int32)
Gets a value that indicates whether or not the element at the given index is currently in motion.
index: Index of element.
Returns: True if the element hasn't yet reached its final location.

Grasshopper.GUI.Stacks.GH_Stack.UpdateInterval
Gets or sets the interval (in milliseconds) for update events.
The number of milliseconds between update intervals.
Throws System.Data.InvalidConstraintException: Thrown when the interval is set to less than 5 milliseconds.

Grasshopper.GUI.Stacks.GH_Stack.Duration
Gets or sets the duration (in milliseconds) of individual frame animations.
This change is only applied to new animations. Existing animations will keep
the duration set at construction.

Grasshopper.GUI.Stacks.GH_Stack.Interpolation
Gets or sets the interpolation mode for stack animations.
Cubic results in a more natural motion.
Although you can change the interpolation during animation,
it might result in a discontinuous motion. You should set the desired
interpolation algorithm during or directly after construction of this stack.

Grasshopper.GUI.Stacks.GH_Stack.AddElement(System.Drawing.Rectangle)
Add a new static element to the stack.
rec: Dimensions of new element.

Grasshopper.GUI.Stacks.GH_Stack.AddElement(System.Drawing.Rectangle,System.Drawing.Rectangle)
Add a new animated element to the stack.
rec_0: Initial dimensions of element.
rec_1: Final dimensions of element.

Grasshopper.GUI.Stacks.GH_Stack.AddElement(System.Drawing.Rectangle,System.Drawing.Rectangle,System.Int32)
Add a new animated element to the stack.
rec_0: Initial dimensions of element.
rec_1: Final dimensions of element.
duration_override: Duration of animation in milliseconds.

Grasshopper.GUI.Stacks.GH_Stack.InsertElement(System.Int32,System.Drawing.Rectangle)
Add a new static element to the stack.
index: Insertion index.
rec: Dimensions of new element.

Grasshopper.GUI.Stacks.GH_Stack.InsertElement(System.Int32,System.Drawing.Rectangle,System.Drawing.Rectangle)
Add a new animated element to the stack.
index: Insertion index.
rec_0: Initial dimensions of element.
rec_1: Final dimensions of element.

Grasshopper.GUI.Stacks.GH_Stack.InsertElement(System.Int32,System.Drawing.Rectangle,System.Drawing.Rectangle,System.Int32)
Add a new animated element to the stack.
index: Insertion index.
rec_0: Initial dimensions of element.
rec_1: Final dimensions of element.
duration_override: Duration of animation in milliseconds.

Grasshopper.GUI.Stacks.GH_Stack.RemoveElement(System.Int32)
Remove the stack element at the specified index.
index: Index of element to remove.

Grasshopper.GUI.Stacks.GH_Stack.Clear
Remove all boxes, timestamps and animators.

Grasshopper.GUI.Stacks.GH_Stack.Element_Initial(System.Int32)
Gets the starting dimensions of the stack element at the given index.
index: Index of stack element.
Throws System.IndexOutOfRangeException: Thrown if index does not represent a valid index in the stack.

Grasshopper.GUI.Stacks.GH_Stack.Element_Final(System.Int32)
Gets or sets the target dimenions of the stack element at the given index.
If you overwrite the existing value with a different value, a new animation
will be initiated for this stack element. If you wish to retrieve the current
(based on system time) stack element dimensions, you should use the Intermediate
readonly property.
index: Index of stack element.
Throws System.IndexOutOfRangeException: Thrown if index does not represent a valid index in the stack.

Grasshopper.GUI.Stacks.GH_Stack.Element_Intermediate(System.Int32)
Gets the intermediate dimensions for the specified physical stack element as
determined by the current system time.
index: Index of stack element.

Grasshopper.GUI.Stacks.GH_Stack.SetNewTarget(System.Int32,System.Drawing.Rectangle)
Set new target dimenions for the given object.
index: Index of element to set.
element: New dimenions.

Grasshopper.GUI.Stacks.GH_Stack.SetNewTarget(System.Int32,System.Drawing.Rectangle,System.Boolean)
Set new target dimenions for the given object.
index: Index of element to set.
element: New dimensions.
bAnimate: True if the change should animated.

Grasshopper.GUI.Stacks.GH_Stack.ResizeContainer(System.Drawing.Rectangle,System.Boolean,System.Boolean)
Call this function to override the width or height of all elements without
interfering with the animation.
region: New region.
fit_horizontal: If True, all the elements will be fit to the region horizontally.
fit_vertical: If True, all the elements will be fit to the region vertically.

Grasshopper.GUI.Stacks.GH_Stack.CleanMotionList
Sets all completed animators in the m_motion list to null.