Grasshopper.GUI.GH_DragInfo
Contains data used for UI drag operations.

Grasshopper.GUI.GH_DragInfo.#ctor(System.Drawing.Point,System.Drawing.Rectangle)
Create a new DragInfo instance.
drag_point: Start point of drag op.
initial_shape: Initial shape associated with drag op.

Grasshopper.GUI.GH_DragInfo.Region
Gets or sets the drag limits. If the region is Rectangle.Empty then the region is ignored.
For valid results the Region should be larger than the dimensions of the drag box.

Grasshopper.GUI.GH_DragInfo.Constraint
Gets or sets the directional constraint for the drag operation.

Grasshopper.GUI.GH_DragInfo.Box_Start
Gets the dimensions of the drag box prior to dragging.

Grasshopper.GUI.GH_DragInfo.Box_Drag
Gets the dimensions of the box as a result of the dragging op.

Grasshopper.GUI.GH_DragInfo.Point_Start
Gets the cursor location at the start of the drag.

Grasshopper.GUI.GH_DragInfo.Point_Drag
Gets the cursor location at the current moment.

Grasshopper.GUI.GH_DragInfo.Drag(System.Drawing.Point)
Call this method to adjust the drag data. Results will be automatically constrained and limited.
new_point: New location of cursor.