Grasshopper.Kernel.Special.GH_JumpObject.NextJump
Attempts to find the next jump object.
Returns: The next jump object or null if no next jump is defined.

Grasshopper.Kernel.Special.GH_JumpObject.PrevJump
Attempts to find the previous jump object.
Returns: The previous jump object or null if no previous jump is defined.