Grasshopper.GUI.GH_RibbonLayoutEditor


Grasshopper.GUI.GH_RibbonLayoutEditor.RibbonLayout
Gets or sets the ribbon layout in this control.
Setting the layout erases the undo/redo stack.

Grasshopper.GUI.GH_RibbonLayoutEditor.VisibleTab
Gets or sets the first selected tab in the layout.

Grasshopper.GUI.GH_RibbonLayoutEditor.SelectedItems
Gets a collection of all selected items in the current layout.

Grasshopper.GUI.GH_RibbonLayoutEditor.TabAt(System.Drawing.Point)
Find the index of the tab best described by the point.
Index can be one higher than the highest tab index.

Grasshopper.GUI.GH_RibbonLayoutEditor.PanelAt(System.Drawing.Point)
Find the index of the panel best described by the point.
Index can be one higher than the highest panel index.