Grasshopper.GUI.Base.GH_TextBoxInputBase.Bounds
Gets or sets the Bounds of this control.

Grasshopper.GUI.Base.GH_TextBoxInputBase.Font
Gets or sets the Font to use in this control.

Grasshopper.GUI.Base.GH_TextBoxInputBase.IsTextInput
Gets whether the text input box is currently on screen.

Grasshopper.GUI.Base.GH_TextBoxInputBase.HideTextInputBox
Hides the text-input override form (if it is displayed).

Grasshopper.GUI.Base.GH_TextBoxInputBase.ShowTextInputBox(System.Windows.Forms.Control,System.String,System.Boolean)
Display a floating text-box on top of the owner control.
owner: Control that owns this slider. The coordinates of the Bounds
rectangle must be specified in owner coordinates.

Grasshopper.GUI.Base.GH_TextBoxInputBase.ShowTextInputBox(System.Windows.Forms.Control,System.String,System.Boolean,System.Boolean)
Display a floating text-box on top of the owner control.
owner: Control that owns this slider. The coordinates of the Bounds
rectangle must be specified in owner coordinates.
limitToBoundary: If True, the pop up input box will be 'clipped' to the owner boundary.
At least some part of the slider must be visible for this to work.

Grasshopper.GUI.Base.GH_TextBoxInputBase.ShowTextInputBox(System.Windows.Forms.Control,System.String,System.Boolean,System.Boolean,System.Drawing.Drawing2D.Matrix)
Display a floating text-box on top of the owner control.
owner: Control that owns this slider. The coordinates of the Bounds
rectangle must be specified in owner coordinates.
limitToBoundary: If True, the pop up input box will be 'clipped' to the owner boundary.
At least some part of the slider must be visible for this to work.
transform: Transformation matrix to apply to pop up UI.