Grasshopper.Kernel.Geometry.Rectangle2
Represents a single, two-dimensional, orthogonal rectangle.

Grasshopper.Kernel.Geometry.Rectangle2.MakeIncreasing
Ensure the limits are all increasing.

Grasshopper.Kernel.Geometry.Rectangle2.PointAt(System.Double,System.Double)
Get a point in rectangle space.
x: Normalised parameter long rectangle x direction.
y: Normalised parameter long rectangle y direction.

Grasshopper.Kernel.Geometry.Rectangle2.Grow(Grasshopper.Kernel.Geometry.Node2)
Grow the rectangle to include a point. Rectangle must be increasing for this to work properly.
pt: Point to include in rectangle.

Grasshopper.Kernel.Geometry.Rectangle2.Grow(System.Double,System.Double)
Grow the rectangle to include a point. Rectangle must be increasing for this to work properly.
x: X-coordinate of point to include.
y: Y-coordinate of point to include.

Grasshopper.Kernel.Geometry.Rectangle2.Includes(Grasshopper.Kernel.Geometry.Node2)
Solve containment for a point and this rectangle.

Grasshopper.Kernel.Geometry.Rectangle2.Includes(System.Double,System.Double)
Solve containment for a point and this rectangle.

Grasshopper.Kernel.Geometry.Rectangle2.Intersect(Grasshopper.Kernel.Geometry.Line2)
Solve intersection between a semi-infinite line and the rectangle.
line: Semi-infinite line to intersect with.
Returns: The point on the semi-infinite line where the intersection occured.