Grasshopper.Kernel.Data.GH_GraftMode
Enumerates all predefined grafting modes.

Grasshopper.Kernel.Data.GH_GraftMode.None
Don't include null items or empty lists.

Grasshopper.Kernel.Data.GH_GraftMode.GraftNullItems
Null items are included in the grafted tree.

Grasshopper.Kernel.Data.GH_GraftMode.GraftEmptyLists
Empty lists are included in the grafted tree.

Grasshopper.Kernel.Data.GH_GraftMode.GraftAll
Null items and empty lists are both included in the grafted tree.