Grasshopper.Kernel.GH_AssemblyFolderInfo
Represents a folder from which GHA files are loaded.

Grasshopper.Kernel.GH_AssemblyFolderInfo.Folder
The actual full path to the folder.

Grasshopper.Kernel.GH_AssemblyFolderInfo.Type
Identifies the type of assembly folder.

Grasshopper.Kernel.GH_AssemblyFolderInfo.SearchOption
Gets the search option to use when looking for GHA files in this folder.