Grasshopper.Kernel.IGH_PreviewObject
All IGH_DocumentObjects that wish to participate in Viewport redraws must implement this interface.

Grasshopper.Kernel.IGH_PreviewObject.Hidden
Gets or sets a value indicating whether or not this object is currently drawing preview flags.

Grasshopper.Kernel.IGH_PreviewObject.IsPreviewCapable
Gets a value indicating whether or not this object (in its current state) can
draw geometric previews at all.

Grasshopper.Kernel.IGH_PreviewObject.ClippingBox
Gets the clipping box for this object. The clipping box
is typically the union of the boundingboxes of all the
geometry that is drawn by this object.
Returns: The clipping box for this object.

Grasshopper.Kernel.IGH_PreviewObject.DrawViewportWires(Grasshopper.Kernel.IGH_PreviewArgs)
Implement this function to draw all wire and point geometry previews.
args: Draw operation arguments.

Grasshopper.Kernel.IGH_PreviewObject.DrawViewportMeshes(Grasshopper.Kernel.IGH_PreviewArgs)
Implement this function to draw all shaded meshes.
If the viewport does not support shading, this function will not be called.
args: Draw operation arguments.