Grasshopper.Kernel.Special.GH_Panel.Alignment
Enumerates all possible alignments of panel content.

Grasshopper.Kernel.Special.GH_Panel.Alignment.Default
Default:
Left when panel contains inherited data.
Left when panel contains a list of User strings.
Center when panel contains a single bit of User text.

Grasshopper.Kernel.Special.GH_Panel.Alignment.Left
Items are aligned along the left edge of the container.

Grasshopper.Kernel.Special.GH_Panel.Alignment.Center
Items are centered in the container.

Grasshopper.Kernel.Special.GH_Panel.Alignment.Right
Items are aligned along the right edge of the container.