Grasshopper.Kernel.IGH_StateTag
A StateTag is a visual feedback mechanism that reflects a certain local setting of an Object.

Grasshopper.Kernel.IGH_StateTag.Icon
Gets the 16 by 16 pixel icon associated with this state tag.

Grasshopper.Kernel.IGH_StateTag.Name
Gets the name field of this state tag.

Grasshopper.Kernel.IGH_StateTag.Description
Gets the description of this state tag.

Grasshopper.Kernel.IGH_StateTag.StateDescription
Gets or sets the state description of this tag.
The state description appears in the Tooltip info field.

Grasshopper.Kernel.IGH_StateTag.Stage
Gets or sets the Stage rectangle for this state tag.
Stages are assigned during Attribute Layout operations by
owner objects.

Grasshopper.Kernel.IGH_StateTag.Render(System.Drawing.Graphics)
Render this tag into a graphics surface.
graphics: Graphics object to draw to.