Grasshopper.Kernel.GH_WireTopology
Represents the topological data for a single connector wire.

Grasshopper.Kernel.GH_WireTopology.#ctor
Blank constructor.

Grasshopper.Kernel.GH_WireTopology.#ctor(System.Guid,System.Guid)
Index-less constructor.
source_id: Instance ID of source parameter.
target_id: Instance ID of target parameter.

Grasshopper.Kernel.GH_WireTopology.#ctor(Grasshopper.Kernel.IGH_Param,Grasshopper.Kernel.IGH_Param)
Utility constructor, takes two parameters and figures out the index all by itself.
source: Source parameter.
target: Target parameter.
Throws System.InvalidOperationException: Thrown if the source is not an actual source of the target.

Grasshopper.Kernel.GH_WireTopology.#ctor(Grasshopper.Kernel.IGH_Param,System.Int32)
Utility constructor, figures out the source all by itself.
target: Target parameter.
index: Index of source to extract.

Grasshopper.Kernel.GH_WireTopology.#ctor(System.Guid,System.Guid,System.Int32)
Default constructor.
source_id: Instance ID of source parameter.
target_id: Instance ID of target parameter.
source_index: Index of source parameter in target Sources list.

Grasshopper.Kernel.GH_WireTopology.SourceParameterID
Gets the instance ID of the source parameter.

Grasshopper.Kernel.GH_WireTopology.TargetParameterID
Gets the instance ID of the target parameter.

Grasshopper.Kernel.GH_WireTopology.SourceIndex
Gets the index of the source parameter in the Sources list of the target parameter.

Grasshopper.Kernel.GH_WireTopology.ValidIndex
Gets a value indicating whether or not the source index is a valid number.

Grasshopper.Kernel.GH_WireTopology.EnsureConnection(Grasshopper.Kernel.GH_Document)
Creates the topological connector wire if it doesn't already exist.
doc: Document which contains the source and parameter indices.

Grasshopper.Kernel.GH_WireTopology.DestroyConnection(Grasshopper.Kernel.GH_Document)
Destroys the topological connector wire if it exists.
doc: Document which contains the source and parameter indices.