Grasshopper.Kernel.GH_DocContextEventArgs
These arguments are passed along with SettingsChanged events on GH_Document.

Grasshopper.Kernel.GH_DocContextEventArgs.Document
Gets the document that raised the event.

Grasshopper.Kernel.GH_DocContextEventArgs.Context
Gets the value of the document context flag at the time the event was raised,
it may have been changed in between by other event handlers.