Grasshopper.Documentation.GH_Link
Represents a link to another location in the Help or some external address.

Grasshopper.Documentation.GH_Link.Text
Gets the list text.

Grasshopper.Documentation.GH_Link.Target
Gets the link type.

Grasshopper.Documentation.GH_Link.Destination
Gets the link target.

Grasshopper.Documentation.GH_Link.Tooltip
Gets the link tooltip text.

Grasshopper.Documentation.GH_Link.LinkId
Gets the link ID. The link ID is only used for shared links.

Grasshopper.Documentation.GH_Link.IsSharedLink
Gets whether this link is a shared link. A shared link should not have text
but it should have a non-empty LinkId.