Grasshopper.Kernel.Types.GH_Boolean
Represents a boolean value. GH_Boolean re-implements the framework System.Boolean type.

Grasshopper.Kernel.Types.GH_Boolean.#ctor
Blank constructor

Grasshopper.Kernel.Types.GH_Boolean.IsValid
Gets the validity of this instance. Booleans are always valid.

Grasshopper.Kernel.Types.GH_Boolean.QC_Type


Grasshopper.Kernel.Types.GH_Boolean.QC_Hash


Grasshopper.Kernel.Types.GH_Boolean.QC_Distance(Grasshopper.Kernel.Types.IGH_QuickCast)


Grasshopper.Kernel.Types.GH_Boolean.QC_Bool


Grasshopper.Kernel.Types.GH_Boolean.QC_Complex


Grasshopper.Kernel.Types.GH_Boolean.QC_Int


Grasshopper.Kernel.Types.GH_Boolean.QC_Num


Grasshopper.Kernel.Types.GH_Boolean.QC_Text


Grasshopper.Kernel.Types.GH_Boolean.QC_Pt


Grasshopper.Kernel.Types.GH_Boolean.QC_Vec


Grasshopper.Kernel.Types.GH_Boolean.QC_Col


Grasshopper.Kernel.Types.GH_Boolean.QC_Interval


Grasshopper.Kernel.Types.GH_Boolean.QC_Matrix


Grasshopper.Kernel.Types.GH_Boolean.QC_CompareTo(Grasshopper.Kernel.Types.IGH_QuickCast)
