Grasshopper.GUI.IGH_ToolstripItemKeyHandler
Implement this interface if your control can be embedded in a context menu
and it needs to respond to Enter and Escape presses from said menu.

Grasshopper.GUI.IGH_ToolstripItemKeyHandler.RespondToEnter
Handles an Enter keydown event.

Grasshopper.GUI.IGH_ToolstripItemKeyHandler.RespondToEscape
Handles an Escape keydown event.