Grasshopper.GUI.Theme.GH_PaletteSettings.NormalStandard
Gets or sets the palette style for unselected Normal palettes.

Grasshopper.GUI.Theme.GH_PaletteSettings.NormalSelected
Gets or sets the palette style for selected Normal palettes.

Grasshopper.GUI.Theme.GH_PaletteSettings.HiddenStandard
Gets or sets the palette style for unselected Hidden palettes.

Grasshopper.GUI.Theme.GH_PaletteSettings.HiddenSelected
Gets or sets the palette style for selected Hidden palettes.

Grasshopper.GUI.Theme.GH_PaletteSettings.LockedStandard
Gets or sets the palette style for unselected Locked palettes.

Grasshopper.GUI.Theme.GH_PaletteSettings.LockedSelected
Gets or sets the palette style for selected Locked palettes.

Grasshopper.GUI.Theme.GH_PaletteSettings.WarningStandard
Gets or sets the palette style for unselected Warning palettes.

Grasshopper.GUI.Theme.GH_PaletteSettings.WarningSelected
Gets or sets the palette style for selected Warning palettes.

Grasshopper.GUI.Theme.GH_PaletteSettings.ErrorStandard
Gets or sets the palette style for unselected Error palettes.

Grasshopper.GUI.Theme.GH_PaletteSettings.ErrorSelected
Gets or sets the palette style for selected Error palettes.