Grasshopper.Kernel.IGH_DebugDescription
Implement this interface to participate in Debug Logging.

Grasshopper.Kernel.IGH_DebugDescription.AppendToDebugLog(Grasshopper.Kernel.GH_DebugDescriptionWriter)
Write important debugging data to a debug writer object.
writer: Object to write to.