Grasshopper.GUI.GH_Slider
Provides a standard Grasshopper slider as a winforms control.

Grasshopper.GUI.GH_Slider.ControlEdgeColour
Gets or sets the EdgeColor for this slider control.

Grasshopper.GUI.GH_Slider.ControlShadowColour
Gets or sets the Shadow colour for this control.

Grasshopper.GUI.GH_Slider.GripTopColour
Gets or sets the fill colour for the top edge of the slider grip.

Grasshopper.GUI.GH_Slider.GripBottomColour
Gets or sets the fill colour for the bottom edge of the slider grip.

Grasshopper.GUI.GH_Slider.GripEdgeColour
Gets or sets the edge colour for the slider grip.

Grasshopper.GUI.GH_Slider.TextColour
Gets or sets the fill colour for the slider text.

Grasshopper.GUI.GH_Slider.RailFullColour
Gets or sets the fill colour for the full portion of the rail.

Grasshopper.GUI.GH_Slider.RailEmptyColour
Gets or sets the fill colour for the empty portion of the rail.

Grasshopper.GUI.GH_Slider.RailDarkColour
Gets or sets the edge colour for the dark parts of the rail.

Grasshopper.GUI.GH_Slider.RailBrightColour
Gets or sets the edge colour for the bright parts of the rail.

Grasshopper.GUI.GH_Slider.FormatMask
Gets or sets the string format mask to use for the display.
Should contain at least one "{0}" element.

Grasshopper.GUI.GH_Slider.RailDisplay
Gets or sets how the slider rail (or track) is drawn.

Grasshopper.GUI.GH_Slider.GripDisplay
Gets or sets how the slider grip (or thumb) is drawn.

Grasshopper.GUI.GH_Slider.TickDisplay
Gets or sets how the slider ticks are drawn.

Grasshopper.GUI.GH_Slider.DrawControlBorder
Gets or sets whether the border of the slider should be drawn.

Grasshopper.GUI.GH_Slider.DrawControlShadows
Gets or sets whether the drop shadows of the slider should be drawn.

Grasshopper.GUI.GH_Slider.TickCount
Gets or sets the number of ticks.

Grasshopper.GUI.GH_Slider.TickFrequency
Gets or sets the frequency of large ticks vs small ticks.

Grasshopper.GUI.GH_Slider.ShadowSize
Gets or sets the size of the border shadow along all edges of the box.

Grasshopper.GUI.GH_Slider.InternalSlider
Gets the internal slider.

Grasshopper.GUI.GH_Slider.Type
Gets or sets the numeric type of this slider.

Grasshopper.GUI.GH_Slider.DecimalPlaces
Gets or sets the number of decimal places allowed for Floating Point Sliders.

Grasshopper.GUI.GH_Slider.Minimum
Gets or sets the lower numeric limit for the slider range.

Grasshopper.GUI.GH_Slider.Maximum
Gets or sets the upper numeric limit for the slider range.

Grasshopper.GUI.GH_Slider.Value
Gets or sets the numeric value for the slider range.

Grasshopper.GUI.GH_Slider.ValueChanged
Raised whenever the value of the slider is changed via GUI interaction.
sender: Slider control raising the event.
e: Event arguments.