Grasshopper.Kernel.Data.IGH_Structure
Base interface for all GH_Structure types.

Grasshopper.Kernel.Data.IGH_Structure.IsEmpty
Gets the Empty state of the structure. If the structure is Empty when it contains no paths and no branches.

Grasshopper.Kernel.Data.IGH_Structure.PathCount
Gets the number of paths defined in this structure.

Grasshopper.Kernel.Data.IGH_Structure.DataCount
Gets the total number of data items stored in all paths.

Grasshopper.Kernel.Data.IGH_Structure.Paths
Gets a list of all the paths in this structure.

Grasshopper.Kernel.Data.IGH_Structure.StructureProxy
Gets a proxy list of all the data-arrays in this structure

Grasshopper.Kernel.Data.IGH_Structure.TopologyDescription
Gets a description of the topology of the structure.
Useful for debugging purposes.

Grasshopper.Kernel.Data.IGH_Structure.PathExists(Grasshopper.Kernel.Data.GH_Path)
Returns True if the specified path is already defined inside the structure.
path: The data path to search for

Grasshopper.Kernel.Data.IGH_Structure.PathIndex(Grasshopper.Kernel.Data.GH_Path,System.Int32@,System.Int32@)
Find the indices that delineate the given path domain.
path: Path to search for (it need not exist in the structure).
idx0: The index of the path itself or the first smaller path if the path is not defined.
idx1: The index of the path itself of the first larger path if the path is not defined.

Grasshopper.Kernel.Data.IGH_Structure.LongestPathIndex
Finds the path in this structure with the most dimensions.
In case of multiple equally long longest paths, the last one
will be returned.
Returns: The index of the longest path or -1 if there are no paths.

Grasshopper.Kernel.Data.IGH_Structure.ShortestPathIndex
Finds the path in this structure with the least dimensions.
In case of multiple equally long longest paths, the first one
will be returned.
Returns: The index of the shortest path or -1 if there are no paths.

Grasshopper.Kernel.Data.IGH_Structure.RemovePath(Grasshopper.Kernel.Data.GH_Path)
Removes a path and all associated data from the structure.
If the path doesn't exist, nothing will happen.
path: Path the remove.

Grasshopper.Kernel.Data.IGH_Structure.ReplacePath(Grasshopper.Kernel.Data.GH_Path,Grasshopper.Kernel.Data.GH_Path)
Replace an existing path with a different one.
If the operation is successfull, then the 'find' path
will be deleted. If the 'replace' path is already defined,
the items in 'find' will be appended to the existing path.
find: The path to search for.
replace: The new path.

Grasshopper.Kernel.Data.IGH_Structure.ExpandPath(Grasshopper.Kernel.Data.GH_Path,System.Int32,Grasshopper.Kernel.Data.GH_ExpandMode)
Expand a path in this structure by appending an element.
path: Path to expand, if the path doesn't exist, nothing will happen.
element: Element to append to the path.
mode: Expansion mode.

Grasshopper.Kernel.Data.IGH_Structure.Path(System.Int32)
Gets the data path at the specified index.
index: Index of path to retrieve.
Throws System.IndexOutOfRangeException: Thrown if the index does not represent a valid path.

Grasshopper.Kernel.Data.IGH_Structure.Branch(Grasshopper.Kernel.Data.GH_Path)
Gets a limited access pointer to the data list associated with a certain path.
path: Path of data to retrieve.

Grasshopper.Kernel.Data.IGH_Structure.Branch(System.Int32)
Gets a limited access pointer to the data list at the specified index.
index: Index of data to retrieve.

Grasshopper.Kernel.Data.IGH_Structure.AllData(System.Boolean)
Gets an enumerator for all the data items in this structure.
skipNulls: If True, null items will be skipped.

Grasshopper.Kernel.Data.IGH_Structure.Clear
Clears the entire structure.

Grasshopper.Kernel.Data.IGH_Structure.ClearData
Removes all data from all paths without affecting the structure topology.

Grasshopper.Kernel.Data.IGH_Structure.TrimExcess
Trims the excess allocated memory in all branches

Grasshopper.Kernel.Data.IGH_Structure.EnsureCapacity(System.Int32)
Ensures that all branches have a certain capacity
capacity: Capacity per branch.

Grasshopper.Kernel.Data.IGH_Structure.Graft(System.Boolean)
Grafts all paths by reallocating all data into child paths.
clearSingleNulls: If true, nulls will not be grafted.

Grasshopper.Kernel.Data.IGH_Structure.Graft(Grasshopper.Kernel.Data.GH_Path,System.Boolean)
Grafts a specific path by reallocating all data into child paths.
If a grafted path coincides with an existing path,
the data item in question will be appended to the existing path.
path: Path of data to graft.
clearSingleNulls: If true, nulls will not be grafted.

Grasshopper.Kernel.Data.IGH_Structure.Graft(Grasshopper.Kernel.Data.GH_GraftMode)
Grafts all paths by reallocating all data into child paths.
mode: Graft mode.

Grasshopper.Kernel.Data.IGH_Structure.Graft(Grasshopper.Kernel.Data.GH_GraftMode,Grasshopper.Kernel.Data.GH_Path)
Grafts a specific path by reallocating all data into child paths.
If a grafted path coincides with an existing path,
the data item in question will be appended to the existing path.
mode: Graft mode.
path: Path to graft

Grasshopper.Kernel.Data.IGH_Structure.Flatten(Grasshopper.Kernel.Data.GH_Path)
Flattens the entire structure into a single path.
path: The path of the flattened data. If null, the path will be {0}

Grasshopper.Kernel.Data.IGH_Structure.Simplify(Grasshopper.Kernel.Data.GH_SimplificationMode)
Simplify the data structure by removing path indices shared by all branches.
mode: Simplification algorithm to use.

Grasshopper.Kernel.Data.IGH_Structure.DataDescription(System.Boolean,System.Boolean)
Gets a description of the data contained in this structure.
includeIndices: If true, every data item will be prefixed by its index.
includePaths: If true, every branch of data will be preceded by the path.
Returns: A string describing the data.