Grasshopper.Kernel.Types.GH_Integer
Represents a 32-bit signed integer. GH_Integer re-implements the framework System.Int32 type.

Grasshopper.Kernel.Types.GH_Integer.#ctor
Blank constructor

Grasshopper.Kernel.Types.GH_Integer.IsValid
Gets the validity of this instance. Integers are always valid.

Grasshopper.Kernel.Types.GH_Integer.QC_Type


Grasshopper.Kernel.Types.GH_Integer.QC_Hash


Grasshopper.Kernel.Types.GH_Integer.QC_Distance(Grasshopper.Kernel.Types.IGH_QuickCast)


Grasshopper.Kernel.Types.GH_Integer.QC_Bool


Grasshopper.Kernel.Types.GH_Integer.QC_Complex


Grasshopper.Kernel.Types.GH_Integer.QC_Matrix


Grasshopper.Kernel.Types.GH_Integer.QC_Int


Grasshopper.Kernel.Types.GH_Integer.QC_Num


Grasshopper.Kernel.Types.GH_Integer.QC_Text


Grasshopper.Kernel.Types.GH_Integer.QC_Pt


Grasshopper.Kernel.Types.GH_Integer.QC_Vec


Grasshopper.Kernel.Types.GH_Integer.QC_Col


Grasshopper.Kernel.Types.GH_Integer.QC_Interval


Grasshopper.Kernel.Types.GH_Integer.QC_CompareTo(Grasshopper.Kernel.Types.IGH_QuickCast)
