Grasshopper.Kernel.Data.GH_RuleOperator
Enumerate the possible ways rules can be strung together.

Grasshopper.Kernel.Data.GH_RuleOperator.Conjunction
Represents an and/also operator.

Grasshopper.Kernel.Data.GH_RuleOperator.Disjunction
Represents an or/else operator.