Grasshopper.GUI.Canvas.TagArtists.GH_TagArtist
Provides a basic implementation of the IGH_TagArtist interface.

Grasshopper.GUI.Canvas.TagArtists.GH_TagArtist.ID
Gets the ID of this TagArtist object.

Grasshopper.GUI.Canvas.TagArtists.GH_TagArtist.Paint(Grasshopper.GUI.Canvas.GH_Canvas,Grasshopper.GUI.Canvas.GH_CanvasChannel)
This method is called whenever a Canvas channel is painted
canvas: Canvas that is currently painting.
channel: Channel that is currently being painted.