Grasshopper.Kernel.Caching.GH_ComponentCache
Keep this class private to Grasshopper (don't make public)

Grasshopper.Kernel.Caching.GH_ComponentCache.CacheKeyForInput(System.Collections.Generic.List{Grasshopper.Kernel.IGH_Param})
Compute a key used for caching based off of an input list
inputParams:
Returns: