Grasshopper.GUI.GH_DigitScroller
Provides the standard Grasshopper Digit scroller as a winforms Control.

Grasshopper.GUI.GH_DigitScroller.MinimumValue
Gets or sets the lower bound of the scroll value.

Grasshopper.GUI.GH_DigitScroller.MaximumValue
Gets or sets the upper bound of the scroll value.

Grasshopper.GUI.GH_DigitScroller.Value
Gets or sets the value of this scroller.

Grasshopper.GUI.GH_DigitScroller.Epsilon
Gets the smallest possible change with the current settings.

Grasshopper.GUI.GH_DigitScroller.Digits
Gets or sets the number of digits displayed in the scroller.

Grasshopper.GUI.GH_DigitScroller.Radix
Gets or sets the radix point index.

Grasshopper.GUI.GH_DigitScroller.DecimalPlaces
Gets or sets the number of decimal places.

Grasshopper.GUI.GH_DigitScroller.Amplify
Gets or sets whether vertical mouse movement ought to be amplified.

Grasshopper.GUI.GH_DigitScroller.AllowTextInput
Gets or sets whether the control accepts text input override.

Grasshopper.GUI.GH_DigitScroller.AllowRadixDrag
Gets or sets whether the radix symbol can be dragged.

Grasshopper.GUI.GH_DigitScroller.Prefix
Gets or sets the prefix text

Grasshopper.GUI.GH_DigitScroller.Suffix
Gets or sets the prefix text

Grasshopper.GUI.GH_DigitScroller.DigitAlign
Gets or sets the digit align mode

Grasshopper.GUI.GH_DigitScroller.DigitScroller
Gets the internal scroller object.

Grasshopper.GUI.GH_DigitScroller.Presets
Gets the internal object that maintains numeric presets.