Grasshopper.GUI.Base.SliderSnapRange
Represents a snap range on a slider.

Grasshopper.GUI.Base.SliderSnapRange.DistanceTo(System.Decimal)
Compute the distance from a value to this snap range.

Grasshopper.GUI.Base.SliderSnapRange.SnapValue(System.Decimal)
Gets the snapped value of another value.