Grasshopper.My.Resources.Res_CultureFlags
A strongly-typed resource class, for looking up localized strings, etc.

Grasshopper.My.Resources.Res_CultureFlags.ResourceManager
Returns the cached ResourceManager instance used by this class.

Grasshopper.My.Resources.Res_CultureFlags.Culture
Overrides the current thread's CurrentUICulture property for all
resource lookups using this strongly typed resource class.

Grasshopper.My.Resources.Res_CultureFlags.Afganistan_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Albanian_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Algeria_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Alsace_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Argentina_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Armenia_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Australia_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Austria_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Azerbaijan_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Bahrain_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Bangladesh_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Bashkir_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Basque_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Belarus_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Belgium_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Belize_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Bolivia_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Bosnia_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Brazil_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Breton_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Brunei_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Bulgaria_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Cambodia_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Canada_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Catalonia_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Chile_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.China_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Colombia_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Corsica_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.costaRica_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Croatia_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Czech_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Denmark_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.DominicanRepublic_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Ecuador_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Egypt_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.ElSalvador_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Estonia_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Ethiopia_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.FaroeIslands_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Finland_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Finsk_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.France_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Fryslan_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Galicean_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Georgia_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Germany_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Greece_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Greenland_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Guatemala_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Honduras_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.HongKong_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Hungary_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Iceland_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Igbo_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.India_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Indonesia_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Inuktitut_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Iran_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Iraq_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Ireland_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.IrishGaelic_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Israel_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Italy_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Jamaica_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Japan_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Jordan_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Kazakhstan_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Kenya_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Korea_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Kuwait_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Kyrgyzstan_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Latvia_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Lebanon_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Libya_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Lichtenstein_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Lithuania_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Luxembourg_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Macao_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Macedonia_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Malaysia_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Maldives_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Malta_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Maori_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Mapudungun_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Marocco_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Mexico_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Monaco_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Mongolia_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.MonteNegro_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Nepal_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Netherlands_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.NewZealand_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Nicaragua_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Nigeria_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Norway_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Oman_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Pakistan_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Panama_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Paraguay_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Peru_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Philippines_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Poland_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Portugal_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.PuertoRico_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Qatar_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Romania_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Russia_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Rwanda_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Sami_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.SaudiArabia_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Scotland_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Senegal_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Serbia_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Sesotho_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Setswana_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Singapore_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Slovakia_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Slovenia_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Sorbia_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.SouthAfrica_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Spain_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.SriLanka_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Sweden_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Switzerland_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Syria_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Taiwan_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Tajikistan_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Tamazight_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Tatar_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Thailand_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Tibet_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Trinidad_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Tunisia_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Turkey_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Turkmenistan_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.UK_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Ukraine_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.UnitedArabEmirates_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Uruguay_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.USA_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Uyghur_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Uzbekistan_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Venezuela_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Vietnam_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Wallon_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Welsh_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Yemen_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CultureFlags.Zimbabwe_20x20
Looks up a localized resource of type System.Drawing.Bitmap.