Grasshopper.GUI.GH_CursorServer
Class used to cache and set cursors.

Grasshopper.GUI.GH_CursorServer.m_cursors
Contains all cached cursors

Grasshopper.GUI.GH_CursorServer.#ctor
Constructor. All cursors will be cached.

Grasshopper.GUI.GH_CursorServer.ReferenceCursors(System.String)
Reference all the cursor files in a given directory.
folder: Directory to parse.
Returns: The number of cursors referenced. Use the AttachCursor() method
to assign a referenced cursor to a control.

Grasshopper.GUI.GH_CursorServer.Count
Gets the number of cached cursors.

Grasshopper.GUI.GH_CursorServer.IsCursor(System.String)
Test for the existence of a cursor.
name: Cursor name to test for.
Returns: True if the cursor is cached.

Grasshopper.GUI.GH_CursorServer.Cursor(System.String)
Gets a cursor from the cache.
name: Name of cursor to retrieve.
Returns: The cursor that is associated with the given name or null if not cursor could be matched.

Grasshopper.GUI.GH_CursorServer.AttachCursor(System.Windows.Forms.Control,System.String)
Attach a cursor to a control.
control: Control to assign cursor to.
name: Name of cursor to assign. This is the filename of the
original cursor file minus the extension.
Returns: True if cursor was assigned, or false if no matching cursor could be found.

Grasshopper.GUI.GH_CursorServer.ResetCursor(System.Windows.Forms.Control)
Reset the cursor of the given control to default.
control: Control to reset.
Returns: True if control was successfully reset, false if iControl is a null reference.