Grasshopper.Kernel.GH_Param`1
Base implementation of IGH_Param. Derive from this class rather than implementing IGH_Param from scratch.
If your parameter can store persistent data, derive from GH_PersistentParam(Of T) instead.
Data type for this parameter.

Grasshopper.Kernel.GH_Param`1.Sources
Gets a list of source parameters. Do not modify this list,
if you wish to add or remove sources, use dedicated functions
like AddSource() and RemoveSource() instead.
Returns: The sources for this parameter.

Grasshopper.Kernel.GH_Param`1.SourceCount
Gets the number of sources for this parameter.

Grasshopper.Kernel.GH_Param`1.Recipients
Gets a list of all the recipients of this parameter.
I.e. a recipient has this parameter as one of the sources.
The Recipient list is maintained by the parameter,
do not modify it yourself.

Grasshopper.Kernel.GH_Param`1.AddSource(Grasshopper.Kernel.IGH_Param)
Append a new Source parameter to the end of the Sources list.
Sources provide this parameter with data at runtime.
source: Source to append.

Grasshopper.Kernel.GH_Param`1.AddSource(Grasshopper.Kernel.IGH_Param,System.Int32)
Insert a new Source parameter into the Sources list.
Sources provide this parameter with data at runtime.
source: Source to append.
index: Insertion index of source.

Grasshopper.Kernel.GH_Param`1.RemoveSource(Grasshopper.Kernel.IGH_Param)
Remove the specified source from this parameter.
source: Source to remove.

Grasshopper.Kernel.GH_Param`1.RemoveSource(System.Guid)
Remove the specified source from this parameter.
source_id: InstanceID of source to remove.

Grasshopper.Kernel.GH_Param`1.RemoveAllSources
Remove all sources from this parameter.

Grasshopper.Kernel.GH_Param`1.ReplaceSource(Grasshopper.Kernel.IGH_Param,Grasshopper.Kernel.IGH_Param)
Replace an existing source with a new one. If the old_source
does not exist in this parameter, nothing happens.
old_source: Source to replace.
new_source: Source to replace with.

Grasshopper.Kernel.GH_Param`1.ReplaceSource(System.Guid,Grasshopper.Kernel.IGH_Param)
Replace an existing source with a new one. If the old_source
does not exist in this parameter, nothing happens.
old_source_id: Source to replace.
new_source: Source to replace with.

Grasshopper.Kernel.GH_Param`1.HasProxySources
Gets a value indicating whether or not this parameter maintains proxy sources.
Proxy sources are used during file IO, when actual sources might not be available yet.
Once an IO operation has been completed there should be no more proxy sources.
Returns: True if the parameter has at least one proxy source, false if not.

Grasshopper.Kernel.GH_Param`1.ProxySourceCount
Gets the number of proxy sources for this parameter.
Proxy sources are used during file IO, when actual sources might not be available yet.
Once an IO operation has been completed there should be no more proxy sources.
Returns: The number of proxy sources associated with this parameter.

Grasshopper.Kernel.GH_Param`1.RelinkProxySources(Grasshopper.Kernel.GH_Document)
Attempt to replace all proxy sources with real sources.
Proxy sources are used during file IO, when actual sources might not be available yet.
Once an IO operation has been completed there should be no more proxy sources.
document: The document from which to harvest the real source parameters.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Param`1.CreateProxySources
Convert all proper source parameters into proxy sources.

Grasshopper.Kernel.GH_Param`1.ClearProxySources
Remove all proxy sources without attempting to relink them.

Grasshopper.Kernel.GH_Param`1.Type
Gets the Framework Type descriptor for the stored Data.

Grasshopper.Kernel.GH_Param`1.Kind
Gets the parameter kind. The kind is evaluated lazily and cached.

Grasshopper.Kernel.GH_Param`1.Access
Gets or sets the Access level for this parameter.

Grasshopper.Kernel.GH_Param`1.Optional
Gets or sets whether or not this parameter is considered optional by the owner component.
Empty, non-optional parameters prevent the component from being solved.

Grasshopper.Kernel.GH_Param`1.StateTags
Gets all the StateTags that are associated with this parameter.
A state tag is a visual feedback icon that represents specific internal settings.

Grasshopper.Kernel.GH_Param`1.WireDisplay
Gets or sets the wire display style for this parameter.
Wire display only affects the wires connected to the parameter input.

Grasshopper.Kernel.GH_Param`1.DataMapping
Gets or sets the data mapping of this Parameter.

Grasshopper.Kernel.GH_Param`1.Reverse
Gets or sets the data reverse modifier of this parameter.

Grasshopper.Kernel.GH_Param`1.Simplify
Gets or sets the simplify modifier for this parameter.

Grasshopper.Kernel.GH_Param`1.InstanceDescription
Gets the description of this instance. The default description is about the amount and source of the local values.

Grasshopper.Kernel.GH_Param`1.VolatileDataDescription
This method is called to populate the Tooltip data description field.

Grasshopper.Kernel.GH_Param`1.DataType
Type is either Void if there are no sources or Remote. Derived classes should expand on this.

Grasshopper.Kernel.GH_Param`1.RemoveEffects
Remove all post-process effects. Note to implementors,
you must call the base method if you override this function.

Grasshopper.Kernel.GH_Param`1.m_data
Contains the runtime data for this parameter, also known as "Volatile" data.

Grasshopper.Kernel.GH_Param`1.static_type
Caches the Type description of T.

Grasshopper.Kernel.GH_Param`1.AddVolatileData(Grasshopper.Kernel.Data.GH_Path,System.Int32,System.Object)
Inserts an item of volatile data into the data structure.
path: The branch path of the data. If the path doesn't exist yet, it will be created.
index: The item index of the data. If the path doesn't contain the index yet,
it will be enlarged to encompass the index.
data: The data to store.
Returns: True on success, False on failure. If the data cannot be converted, the topology will remain unmolested.

Grasshopper.Kernel.GH_Param`1.InstantiateT
Attempts to instantiate a new instance of T.
Returns: This function should return a newly constructed instance of T.
Remarks:
If T is an abstract class or if T has no default (empty) constructor, this function will ASSERT.
In order to avoid a Try...Catch block performance impact,
override this function and call the type constructor for T directly.

Grasshopper.Kernel.GH_Param`1.PreferredCast(System.Object)
Implement this function if you're certain that you'll be confronted with very common casts.
For example, GH_Point has a preferred cast from Rhino.Geometry.Point3d and GH_Number
has a preferred cast from System.Double.
data: Data to convert. Data is never null.
Returns: An instance of T or null if you did not handle the cast.

Grasshopper.Kernel.GH_Param`1.Cast_Object(System.Object)
Attempts to convert the Object reference into an instance of T.
This method will perform a direct cast if possible or it will call Casting functions on T or Data if they exist.
Data will not be duplicated unless a type conversion is required.
Data: Data to convert.
Returns: The cast value or Nothing on failure.

Grasshopper.Kernel.GH_Param`1.ExpireSolutionTopLevel(System.Boolean)
Invoke the Expiresolution(bool) method on the toplevel object.
recompute: If true, a new computation will start right away.

Grasshopper.Kernel.GH_Param`1.PostProcessData
Apply data post-processes (simplify, reverse, graft, flatten etc. as well as overridden processes).

Grasshopper.Kernel.GH_Param`1.RegisterRemoteIDsUtil(Grasshopper.Kernel.GH_GuidTable)
Utility function which treats all data in the Volatile cache as IGH_GeometricGoo
and registers all referenced objects. Call this function from within RegisterRemoteIDs()
if you are absolutely sure that all the items in volatiledata implement IGH_GeometricGoo.

Grasshopper.Kernel.GH_Param`1.ConversionCallback(System.Object,`0)
This method is called whenever a successful conversion takes
place from some source data into local target data.
Override it if you wish to keep tabs on conversions.
source: Source data (never null).
target: Target data (never null).

Grasshopper.Kernel.GH_Param`1.CollectVolatileData_FromSources
This method collects volatile data from all the source parameters.

Grasshopper.Kernel.GH_Param`1.CollectVolatileData_Custom
If a parameter has no sources, the CollectVolatileData_Custom() method is called.
The basic implementation does nothing, but you can override this method to provide
special data instantiation logic.

Grasshopper.Kernel.GH_Param`1.OnVolatileDataCollected
Once volatile data has been collected this method will be calles. The basic
implementation does nothing, but you can add code here to post-process or
analyze the volatile data.

Grasshopper.Kernel.GH_Param`1.IsPrincipal
Gets whether this parameter is a principal parameter.
Principal parameters are maintained by components and are not part of the IGH_Param interface.

Grasshopper.Kernel.GH_Param`1.SetPrincipal(System.Boolean,System.Boolean,System.Boolean)
Set the principal parameter state.

Grasshopper.Kernel.GH_Param`1.Format(`0)
Returns "Null" if the data is a null reference, otherwise calls ToString() on the Data instance.

Grasshopper.Kernel.GH_Param`1.TypeName
Calls TypeName() on the first instance of T it can find.
This is either an item in the volatile list, or a newly constructed instance.
Remarks: Override this for improved performance, but this function is only likely to be called from the GUI.

Grasshopper.Kernel.GH_Param`1.AppendAdditionalMenuItems(System.Windows.Forms.ToolStripDropDown)
Override this function if you want to add specific items to the object context menu
Default items already included in the menu toolstrip are:
1. Name
2. Preview
3. Warnings
4. Errors

Grasshopper.Kernel.GH_Param`1.ExpireOwner
Utility method for expiring the owner component (if it exists).

Grasshopper.Kernel.GH_Param`1.Preview_ComputeClippingBox
This function can be used to iterate over all items in the Volatile data tree
and collect the union clipping box of all non-null items that implement
Preview.IGH_PreviewData. This function requires a lot of TypeOf and DirectCasting,
so if you're worried about performance you should consider doing this yourself.
Returns: The clipping box for all valid items.

Grasshopper.Kernel.GH_Param`1.Preview_DrawWires(Grasshopper.Kernel.IGH_PreviewArgs)
This function can be used to iterate over all items in the Volatile data tree
and call DrawViewportWires on each item that implements Preview.IGH_PreviewData.
This function requires a lot of TypeOf and DirectCasting,
so if you're worried about performance you should consider doing this yourself.

Grasshopper.Kernel.GH_Param`1.Preview_DrawMeshes(Grasshopper.Kernel.IGH_PreviewArgs)
This function can be used to iterate over all items in the Volatile data tree
and call DrawViewportWires on each item that implements Preview.IGH_PreviewData.
This function requires a lot of TypeOf and DirectCasting,
so if you're worried about performance you should consider doing this yourself.

Grasshopper.Kernel.GH_Param`1.Render_AppendGeometry(Grasshopper.Kernel.GH_RenderArgs)
This function has been emptied because it is Obsolete.