Grasshopper.Kernel.IGH_ZuiAction
Represents a single action which is only visible on screen above a certain zoom level.

Grasshopper.Kernel.IGH_ZuiAction.Name
Gets the display name for this action. Keep it short and sweet.

Grasshopper.Kernel.IGH_ZuiAction.Perform
This method will be called when the action needs to be performed.