Grasshopper.Kernel.Expressions.GH_ExpressionSyntaxWriter.RewriteAll(System.String)
Apply all syntax rulesets to the expression.

Grasshopper.Kernel.Expressions.GH_ExpressionSyntaxWriter.RewriteForGraphicInterface(System.String)
Rewrite the expression so that tags are replaced by the complex characters that make up
the esoteric operators, functions and constants. The expression should become more readable

Grasshopper.Kernel.Expressions.GH_ExpressionSyntaxWriter.RewriteForGraphicInterface(Grasshopper.Kernel.Expressions.GH_CodeString)
Rewrite the expression so that tags are replaced by the complex characters that make up
the esoteric operators, functions and constants. The expression should become more readable for humans.

Grasshopper.Kernel.Expressions.GH_ExpressionSyntaxWriter.RewriteForEvaluator(System.String)
Rewrite the expression so that all temporary keywords and symbols are replaced by evaluator-specific chars.
The expression will become less readable, do not let the user see the result of this function.
You need to rewrite the expression with this function if you intend to feed it into the Evaluator.

Grasshopper.Kernel.Expressions.GH_ExpressionSyntaxWriter.RewriteForEvaluator(Grasshopper.Kernel.Expressions.GH_CodeString)
Rewrite the expression so that all temporary keywords and symbols are replaced by evaluator-specific chars.
The expression will become less readable, do not let the user see the result of this function.
You need to rewrite the expression with this function if you intend to feed it into the Evaluator.