Grasshopper.Kernel.GH_DocObjectEventArgs
These arguments are passed along with ObjectsAdded and ObjectsRemoved events on GH_Document.

Grasshopper.Kernel.GH_DocObjectEventArgs.Document
Gets the document that raised the event.

Grasshopper.Kernel.GH_DocObjectEventArgs.ObjectCount
Gets the number of objects in this event.

Grasshopper.Kernel.GH_DocObjectEventArgs.Object(System.Int32)
Gets the object to which this event pertains.

Grasshopper.Kernel.GH_DocObjectEventArgs.Objects
Gets a readonly list of the objects to which this event pertains.

Grasshopper.Kernel.GH_DocObjectEventArgs.Attributes
Gets all the attributes that are associated with all objects in the event.