Grasshopper.Kernel.Types.IGH_GooProxy
Base interface for all type proxies.

Grasshopper.Kernel.Types.IGH_GooProxy.ProxyOwner
Gets the piece of Grasshopper data that spawned this proxy.

Grasshopper.Kernel.Types.IGH_GooProxy.Valid
Gets a value indicating whether this proxy represents valid data.

Grasshopper.Kernel.Types.IGH_GooProxy.UserString
Gets or sets the user-defined string that describes this proxy.
This only really makes sense if the Proxy is Parsable.
Returns: The UserString value or the value of FormatInstance() if UserString has not been assigned.

Grasshopper.Kernel.Types.IGH_GooProxy.IsParsable
Gets a value indicating whether or not the type can be instantiated from a String.

Grasshopper.Kernel.Types.IGH_GooProxy.FormatInstance
Returns a String description of the current value.
Remarks: If the implementation IsParsable(), then this representation will be in parsable format.

Grasshopper.Kernel.Types.IGH_GooProxy.FromString(System.String)
If IsParsable(), then attempts to convert the string to a generic type value
in: The String to parse.
Returns: True on success, false on failure. This method should not throw exceptions.

Grasshopper.Kernel.Types.IGH_GooProxy.MutateString(System.String)
Munge a string to remove obvious errors on account of the user.

Grasshopper.Kernel.Types.IGH_GooProxy.Construct
This method will be called when a new instance of this type is constructed.
It allows implementers to supply a customized UI to be shown during construction.
This method should never throw exceptions.