Grasshopper.Kernel.Components.GH_CustomPreviewComponent


Grasshopper.Kernel.Components.GH_CustomPreviewComponent.DisplayItems
Iterate over all the custom display items in this component.
Returns:

Grasshopper.Kernel.Components.GH_CustomPreviewComponent.IncludeInRender
Gets or sets whether the custom geometry inside this component ought to be included in a render pipeline.

Grasshopper.Kernel.Components.GH_CustomPreviewComponent.BeforeSolveInstance
Override this method if you want to be called
before the first call to SolveInstance.

Grasshopper.Kernel.Components.GH_CustomPreviewComponent.ViewportFilter
Gets or sets a string filter (supporting wildcards) that limits whether geometry is drawn in a specific viewport.