Grasshopper.Kernel.Data.GH_IndexRule
Base implementation of all pre-defined index rules.

Grasshopper.Kernel.Data.GH_IndexRule.RuleType
Gets the type of this rule.

Grasshopper.Kernel.Data.GH_IndexRule.Evaluate(System.Int32)
Evaluate whether a certain index passes or violates this rule.
index: Index to evaluate.
Returns: Evaluation result.