Grasshopper.Kernel.GH_GuidConflictSolution
Contains a list of all possible Assembly GUID conflict solutions

Grasshopper.Kernel.GH_GuidConflictSolution.Unset
Indicates there is no solution picked yet

Grasshopper.Kernel.GH_GuidConflictSolution.Replace
Replace the loaded proxy with the conflicting proxy

Grasshopper.Kernel.GH_GuidConflictSolution.ReplaceAll
Replace all loaded proxies with all conflicting proxies in the current assembly

Grasshopper.Kernel.GH_GuidConflictSolution.Skip
Skip the conflicting proxy

Grasshopper.Kernel.GH_GuidConflictSolution.SkipAll
Skip all conflicting proxies in the current assembly