Grasshopper.GUI.GH_UpgradeComponentControl
Control used to display a collection of IGH_UpgradeObjects.

Grasshopper.GUI.GH_UpgradeComponentControl.Document
Gets or sets the document that needs to be upgraded.

Grasshopper.GUI.GH_UpgradeComponentControl.Upgraders
Gets a list of all selected upgraders.