Grasshopper.GUI.Canvas.GH_Capsule
Class used to draw standard Grasshopper interface boxes.

Grasshopper.GUI.Canvas.GH_Capsule.DefaultHighlight
The default size (in pixel units) of the highlight bar.

Grasshopper.GUI.Canvas.GH_Capsule.DefaultRadius
The default radius (in pixel units) of the rounded corners.

Grasshopper.GUI.Canvas.GH_Capsule.m_radius0
Upper left.

Grasshopper.GUI.Canvas.GH_Capsule.m_radius1
Upper right.

Grasshopper.GUI.Canvas.GH_Capsule.m_radius2
Lower right.

Grasshopper.GUI.Canvas.GH_Capsule.m_radius3
Lower left.

Grasshopper.GUI.Canvas.GH_Capsule.OutlineShape
Gets the graphics path that describes the outer edge of the capsule.

Grasshopper.GUI.Canvas.GH_Capsule.HighlightShape
Gets the graphics path that describes the highlight bar shape of the capsule.

Grasshopper.GUI.Canvas.GH_Capsule.#ctor
You are not allowed to construct a new GH_Capsule.

Grasshopper.GUI.Canvas.GH_Capsule.CreateCapsule(System.Drawing.Rectangle,Grasshopper.GUI.Canvas.GH_Palette)
Create a new blank capsule with default radius and highlight dimensions.
box: Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
palette: Colour palette to apply.
Returns: A new instance of GH_Capsule. Caller is responsible for disposing of the object.

Grasshopper.GUI.Canvas.GH_Capsule.CreateCapsule(System.Drawing.Rectangle,Grasshopper.GUI.Canvas.GH_Palette,System.Int32,System.Int32)
Create a new blank capsule.
box: Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
palette: Colour palette to apply.
radius: Radius of rounded corners. A radius of zero or lower disables corner fillets.
highlight: Height of the highlight bar. A value of zero or lower disables the highlight.
Returns: A new instance of GH_Capsule. Caller is responsible for disposing of the object.

Grasshopper.GUI.Canvas.GH_Capsule.CreateCapsule(System.Drawing.Rectangle,Grasshopper.GUI.Canvas.GH_Palette,System.Int32[],System.Int32)
Create a new blank capsule.
box: Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
palette: Colour palette to apply.
radii: Radii of rounded corners. This array must contain at least 4 integers.
Radii are defined clockwise, starting at the upper left corner.
highlight: Height of the highlight bar. A value of zero or lower disables the highlight.
Returns: A new instance of GH_Capsule. Caller is responsible for disposing of the object.

Grasshopper.GUI.Canvas.GH_Capsule.CreateCapsule(System.Drawing.RectangleF,Grasshopper.GUI.Canvas.GH_Palette)
Create a new blank capsule with default radius and highlight dimensions.
box: Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
palette: Colour palette to apply.
Returns: A new instance of GH_Capsule. Caller is responsible for disposing of the object.

Grasshopper.GUI.Canvas.GH_Capsule.CreateCapsule(System.Drawing.RectangleF,Grasshopper.GUI.Canvas.GH_Palette,System.Int32,System.Int32)
Create a new blank capsule.
box: Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
palette: Colour palette to apply.
radius: Radius of rounded corners. A radius of zero or lower disables corner fillets.
highlight: Height of the highlight bar. A value of zero or lower disables the highlight.
Returns: A new instance of GH_Capsule. Caller is responsible for disposing of the object.

Grasshopper.GUI.Canvas.GH_Capsule.CreateCapsule(System.Drawing.RectangleF,Grasshopper.GUI.Canvas.GH_Palette,System.Int32[],System.Int32)
Create a new blank capsule.
box: Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
palette: Colour palette to apply.
radii: Radii of rounded corners. This array must contain at least 4 integers.
Radii are defined clockwise, starting at the upper left corner.
highlight: Height of the highlight bar. A value of zero or lower disables the highlight.
Returns: A new instance of GH_Capsule. Caller is responsible for disposing of the object.

Grasshopper.GUI.Canvas.GH_Capsule.CreateTextCapsule(System.Drawing.Rectangle,System.Drawing.Rectangle,Grasshopper.GUI.Canvas.GH_Palette,System.String)
Create a new capsule with content text.
box: Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
textbox: Box into which the text will be drawn.
palette: Colour palette to apply.
text: Text to display inside the capsule.
Returns: A new instance of GH_Capsule. Caller is responsible for disposing of the object.

Grasshopper.GUI.Canvas.GH_Capsule.CreateTextCapsule(System.Drawing.Rectangle,System.Drawing.Rectangle,Grasshopper.GUI.Canvas.GH_Palette,System.String,System.Int32,System.Int32)
Create a new capsule with content text.
box: Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
textbox: Box into which the text will be drawn.
palette: Colour palette to apply.
text: Text to display inside the capsule.
radius: Radius of rounded corners. A radius of zero or lower disables corner fillets.
highlight: Height of the highlight bar. A value of zero or lower disables the highlight.
Returns: A new instance of GH_Capsule. Caller is responsible for disposing of the object.

Grasshopper.GUI.Canvas.GH_Capsule.CreateTextCapsule(System.Drawing.Rectangle,System.Drawing.Rectangle,Grasshopper.GUI.Canvas.GH_Palette,System.String,System.Int32[],System.Int32)
Create a new capsule with content text.
box: Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
textbox: Box into which the text will be drawn.
palette: Colour palette to apply.
text: Text to display inside the capsule.
radii: Radii of rounded corners. This array must contain at least 4 integers.
Radii are defined clockwise, starting at the upper left corner.
highlight: Height of the highlight bar. A value of zero or lower disables the highlight.
Returns: A new instance of GH_Capsule. Caller is responsible for disposing of the object.

Grasshopper.GUI.Canvas.GH_Capsule.CreateTextCapsule(System.Drawing.Rectangle,System.Drawing.Rectangle,Grasshopper.GUI.Canvas.GH_Palette,System.String,System.Drawing.Font)
Create a new capsule with content text.
box: Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
textbox: Box into which the text will be drawn.
palette: Colour palette to apply.
text: Text to display inside the capsule.
font: Font to draw text with.
Returns: A new instance of GH_Capsule. Caller is responsible for disposing of the object.

Grasshopper.GUI.Canvas.GH_Capsule.CreateTextCapsule(System.Drawing.Rectangle,System.Drawing.Rectangle,Grasshopper.GUI.Canvas.GH_Palette,System.String,System.Drawing.Font,System.Int32,System.Int32)
Create a new capsule with content text.
box: Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
textbox: Box into which the text will be drawn.
palette: Colour palette to apply.
text: Text to display inside the capsule.
font: Font to draw text with.
radius: Radius of rounded corners. A radius of zero or lower disables corner fillets.
highlight: Height of the highlight bar. A value of zero or lower disables the highlight.
Returns: A new instance of GH_Capsule. Caller is responsible for disposing of the object.

Grasshopper.GUI.Canvas.GH_Capsule.CreateTextCapsule(System.Drawing.Rectangle,System.Drawing.Rectangle,Grasshopper.GUI.Canvas.GH_Palette,System.String,System.Drawing.Font,System.Int32[],System.Int32)
Create a new capsule with content text.
box: Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
textbox: Box into which the text will be drawn.
palette: Colour palette to apply.
text: Text to display inside the capsule.
font: Font to draw text with.
radii: Radii of rounded corners. This array must contain at least 4 integers.
Radii are defined clockwise, starting at the upper left corner.
highlight: Height of the highlight bar. A value of zero or lower disables the highlight.
Returns: A new instance of GH_Capsule. Caller is responsible for disposing of the object.

Grasshopper.GUI.Canvas.GH_Capsule.CreateTextCapsule(System.Drawing.Rectangle,System.Drawing.Rectangle,Grasshopper.GUI.Canvas.GH_Palette,System.String,System.Drawing.Font,Grasshopper.GUI.Canvas.GH_Orientation)
Create a new capsule with content text.
box: Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
textbox: Box into which the text will be drawn.
palette: Colour palette to apply.
text: Text to display inside the capsule.
font: Font to draw text with.
orientation: Orientation of text within box.
Returns: A new instance of GH_Capsule. Caller is responsible for disposing of the object.

Grasshopper.GUI.Canvas.GH_Capsule.CreateTextCapsule(System.Drawing.Rectangle,System.Drawing.Rectangle,Grasshopper.GUI.Canvas.GH_Palette,System.String,System.Drawing.Font,Grasshopper.GUI.Canvas.GH_Orientation,System.Int32,System.Int32)
Create a new capsule with content text.
box: Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
textbox: Box into which the text will be drawn.
palette: Colour palette to apply.
text: Text to display inside the capsule.
font: Font to draw text with.
orientation: Orientation of text within box.
radius: Radius of rounded corners. A radius of zero or lower disables corner fillets.
highlight: Height of the highlight bar. A value of zero or lower disables the highlight.
Returns: A new instance of GH_Capsule. Caller is responsible for disposing of the object.

Grasshopper.GUI.Canvas.GH_Capsule.CreateTextCapsule(System.Drawing.Rectangle,System.Drawing.Rectangle,Grasshopper.GUI.Canvas.GH_Palette,System.String,System.Drawing.Font,Grasshopper.GUI.Canvas.GH_Orientation,System.Int32[],System.Int32)
Create a new capsule with content text.
box: Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
textbox: Box into which the text will be drawn.
palette: Colour palette to apply.
text: Text to display inside the capsule.
font: Font to draw text with.
orientation: Orientation of text within box.
radii: Radii of rounded corners. This array must contain at least 4 integers.
Radii are defined clockwise, starting at the upper left corner.
highlight: Height of the highlight bar. A value of zero or lower disables the highlight.
Returns: A new instance of GH_Capsule. Caller is responsible for disposing of the object.

Grasshopper.GUI.Canvas.GH_Capsule.CreateTextCapsule(System.Drawing.RectangleF,System.Drawing.RectangleF,Grasshopper.GUI.Canvas.GH_Palette,System.String)
Create a new capsule with content text.
box: Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
textbox: Box into which the text will be drawn.
palette: Colour palette to apply.
text: Text to display inside the capsule.
Returns: A new instance of GH_Capsule. Caller is responsible for disposing of the object.

Grasshopper.GUI.Canvas.GH_Capsule.CreateTextCapsule(System.Drawing.RectangleF,System.Drawing.RectangleF,Grasshopper.GUI.Canvas.GH_Palette,System.String,System.Int32,System.Int32)
Create a new capsule with content text.
box: Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
textbox: Box into which the text will be drawn.
palette: Colour palette to apply.
text: Text to display inside the capsule.
radius: Radius of rounded corners. A radius of zero or lower disables corner fillets.
highlight: Height of the highlight bar. A value of zero or lower disables the highlight.
Returns: A new instance of GH_Capsule. Caller is responsible for disposing of the object.

Grasshopper.GUI.Canvas.GH_Capsule.CreateTextCapsule(System.Drawing.RectangleF,System.Drawing.RectangleF,Grasshopper.GUI.Canvas.GH_Palette,System.String,System.Int32[],System.Int32)
Create a new capsule with content text.
box: Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
textbox: Box into which the text will be drawn.
palette: Colour palette to apply.
text: Text to display inside the capsule.
radii: Radii of rounded corners. This array must contain at least 4 integers.
Radii are defined clockwise, starting at the upper left corner.
highlight: Height of the highlight bar. A value of zero or lower disables the highlight.
Returns: A new instance of GH_Capsule. Caller is responsible for disposing of the object.

Grasshopper.GUI.Canvas.GH_Capsule.CreateTextCapsule(System.Drawing.RectangleF,System.Drawing.RectangleF,Grasshopper.GUI.Canvas.GH_Palette,System.String,System.Drawing.Font)
Create a new capsule with content text.
box: Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
textbox: Box into which the text will be drawn.
palette: Colour palette to apply.
text: Text to display inside the capsule.
font: Font to draw text with.
Returns: A new instance of GH_Capsule. Caller is responsible for disposing of the object.

Grasshopper.GUI.Canvas.GH_Capsule.CreateTextCapsule(System.Drawing.RectangleF,System.Drawing.RectangleF,Grasshopper.GUI.Canvas.GH_Palette,System.String,System.Drawing.Font,System.Int32,System.Int32)
Create a new capsule with content text.
box: Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
textbox: Box into which the text will be drawn.
palette: Colour palette to apply.
text: Text to display inside the capsule.
font: Font to draw text with.
radius: Radius of rounded corners. A radius of zero or lower disables corner fillets.
highlight: Height of the highlight bar. A value of zero or lower disables the highlight.
Returns: A new instance of GH_Capsule. Caller is responsible for disposing of the object.

Grasshopper.GUI.Canvas.GH_Capsule.CreateTextCapsule(System.Drawing.RectangleF,System.Drawing.RectangleF,Grasshopper.GUI.Canvas.GH_Palette,System.String,System.Drawing.Font,System.Int32[],System.Int32)
Create a new capsule with content text.
box: Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
textbox: Box into which the text will be drawn.
palette: Colour palette to apply.
text: Text to display inside the capsule.
font: Font to draw text with.
radii: Radii of rounded corners. This array must contain at least 4 integers.
Radii are defined clockwise, starting at the upper left corner.
highlight: Height of the highlight bar. A value of zero or lower disables the highlight.
Returns: A new instance of GH_Capsule. Caller is responsible for disposing of the object.

Grasshopper.GUI.Canvas.GH_Capsule.CreateTextCapsule(System.Drawing.RectangleF,System.Drawing.RectangleF,Grasshopper.GUI.Canvas.GH_Palette,System.String,System.Drawing.Font,Grasshopper.GUI.Canvas.GH_Orientation)
Create a new capsule with content text.
box: Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
textbox: Box into which the text will be drawn.
palette: Colour palette to apply.
text: Text to display inside the capsule.
font: Font to draw text with.
orientation: Orientation of text within box.
Returns: A new instance of GH_Capsule. Caller is responsible for disposing of the object.

Grasshopper.GUI.Canvas.GH_Capsule.CreateTextCapsule(System.Drawing.RectangleF,System.Drawing.RectangleF,Grasshopper.GUI.Canvas.GH_Palette,System.String,System.Drawing.Font,Grasshopper.GUI.Canvas.GH_Orientation,System.Int32,System.Int32)
Create a new capsule with content text.
box: Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
textbox: Box into which the text will be drawn.
palette: Colour palette to apply.
text: Text to display inside the capsule.
font: Font to draw text with.
orientation: Orientation of text within box.
radius: Radius of rounded corners. A radius of zero or lower disables corner fillets.
highlight: Height of the highlight bar. A value of zero or lower disables the highlight.
Returns: A new instance of GH_Capsule. Caller is responsible for disposing of the object.

Grasshopper.GUI.Canvas.GH_Capsule.CreateTextCapsule(System.Drawing.RectangleF,System.Drawing.RectangleF,Grasshopper.GUI.Canvas.GH_Palette,System.String,System.Drawing.Font,Grasshopper.GUI.Canvas.GH_Orientation,System.Int32[],System.Int32)
Create a new capsule with content text.
box: Box for capsule dimensions. The box will be grown until it is at least 3 pixels wide and high.
textbox: Box into which the text will be drawn.
palette: Colour palette to apply.
text: Text to display inside the capsule.
font: Font to draw text with.
orientation: Orientation of text within box.
radii: Radii of rounded corners. This array must contain at least 4 integers.
Radii are defined clockwise, starting at the upper left corner.
highlight: Height of the highlight bar. A value of zero or lower disables the highlight.
Returns: A new instance of GH_Capsule. Caller is responsible for disposing of the object.

Grasshopper.GUI.Canvas.GH_Capsule.InputGrips
Gets the list of locally defined input grip locations.

Grasshopper.GUI.Canvas.GH_Capsule.OutputGrips
Gets the list of locally defined output grip locations.

Grasshopper.GUI.Canvas.GH_Capsule.AddInputGrip(System.Single)
Add an input grip to this UI Box. This is the recommended overload.
Y: Y coordinate of grip.

Grasshopper.GUI.Canvas.GH_Capsule.AddInputGrip(System.Single,System.Single)
Add an input grip to this UI Box.
X: X coordinate of grip.
Y: Y coordinate of grip.

Grasshopper.GUI.Canvas.GH_Capsule.AddInputGrip(System.Drawing.Point)
Add an input grip to this UI Box.
P: Coordinate of grip.

Grasshopper.GUI.Canvas.GH_Capsule.AddInputGrip(System.Drawing.PointF)
Add an input grip to this UI Box.
P: Coordinate of grip.

Grasshopper.GUI.Canvas.GH_Capsule.AddOutputGrip(System.Single)
Add an output grip to this UI Box. This is the recommended overload.
Y: Y coordinate of grip.

Grasshopper.GUI.Canvas.GH_Capsule.AddOutputGrip(System.Single,System.Single)
Add an output grip to this UI Box.
X: X coordinate of grip.
Y: Y coordinate of grip.

Grasshopper.GUI.Canvas.GH_Capsule.AddOutputGrip(System.Drawing.Point)
Add an output grip to this UI Box.
P: Coordinate of grip.

Grasshopper.GUI.Canvas.GH_Capsule.AddOutputGrip(System.Drawing.PointF)
Add an output grip to this UI Box.
P: Coordinate of grip.

Grasshopper.GUI.Canvas.GH_Capsule.Box
Gets the outline box for this Capsule.

Grasshopper.GUI.Canvas.GH_Capsule.Box_Content
Gets the content box for this Capsule. Text and icons are drawn inside this box.

Grasshopper.GUI.Canvas.GH_Capsule.Highlight
Gets the highlight size for this Capsule. Zero or negative means there is no highlight.

Grasshopper.GUI.Canvas.GH_Capsule.JaggedLeft
Gets whether the left edge of this capsule is jagged.

Grasshopper.GUI.Canvas.GH_Capsule.JaggedRight
Gets whether the right edge of this capsule is jagged.

Grasshopper.GUI.Canvas.GH_Capsule.SetJaggedEdges(System.Boolean,System.Boolean)
Assign left and right jagged edges.

Grasshopper.GUI.Canvas.GH_Capsule.Radius(System.Int32)
Gets the radius of the rounded corners of this Capsule.
index: Corner index.
0 = upper left
1 = upper right
2 = lower right
3 = lower left

Grasshopper.GUI.Canvas.GH_Capsule.MaxRadius
Gets the largest radius defined for this capsule.

Grasshopper.GUI.Canvas.GH_Capsule.Font
Gets or sets the Font to use for text rendering.

Grasshopper.GUI.Canvas.GH_Capsule.Text
Gets or sets the text to render in the content box.

Grasshopper.GUI.Canvas.GH_Capsule.TextOrientation
Gets or sets the orientation of the text within the content box.

Grasshopper.GUI.Canvas.GH_Capsule.Palette
Gets or sets the palette for this Capsule.

Grasshopper.GUI.Canvas.GH_Capsule.Contains(System.Drawing.PointF)
Test a point for capsule containment.
pt: Point to test.
Returns: True if the point is on the interior of the capsule.

Grasshopper.GUI.Canvas.GH_Capsule.RenderEngine
Gets the RenderEngine associated with this capsule.
You typically don't need to go this far, just use
one of the Render() overloads on GH_Capsule directly.
Remarks: Do not store pointers to the RenderEngine, always call this property anew.

Grasshopper.GUI.Canvas.GH_Capsule.Render(System.Drawing.Graphics,System.Boolean,System.Boolean,System.Boolean)
Render the capsule onto a graphics context.
G: Graphics object to draw with. Zoom factor is implied by the G.Transform property.
selected: If true, the capsule will be drawn with selected colours.
locked: If True, the capcule will be drawn in Locked style.
hidden: If True, the capsule will be drawn in Hidden style.

Grasshopper.GUI.Canvas.GH_Capsule.Render(System.Drawing.Graphics,System.Drawing.Color)
Have this capsule draw itself onto a Graphics surface with a custom colour override.
G: Graphics object to draw with. Zoom factor is implied by the G.Transform property.
colour: Base colour for the capsule. Other colours will be derived from the base colour.
If you want full control over every colour involved, then use the overload that allows you
to supply a custom Style instead.

Grasshopper.GUI.Canvas.GH_Capsule.Render(System.Drawing.Graphics,Grasshopper.GUI.Canvas.GH_PaletteStyle)
Have this capsule draw itself onto a Graphics surface with a custom Style override.
G: Graphics object to draw with. Zoom factor is implied by the G.Transform property.
style: Style to draw capsule with.

Grasshopper.GUI.Canvas.GH_Capsule.Render(System.Drawing.Graphics,System.Drawing.Image,System.Boolean,System.Boolean,System.Boolean)
Render the capsule onto a graphics context.
G: Graphics object to draw with. Zoom factor is implied by the G.Transform property.
icon: Icon to render in center of content/bounding box.
selected: If true, the capsule will be drawn with selected colours.
locked: If True, the capcule will be drawn in Locked style.
hidden: If True, the capsule will be drawn in Hidden style.

Grasshopper.GUI.Canvas.GH_Capsule.Render(System.Drawing.Graphics,System.Drawing.Image,System.Drawing.Color)
Have this capsule draw itself onto a Graphics surface with a custom colour override.
G: Graphics object to draw with. Zoom factor is implied by the G.Transform property.
icon: Icon to render in center of content/bounding box.
colour: Base colour for the capsule. Other colours will be derived from the base colour.
If you want full control over every colour involved, then use the overload that allows you
to supply a custom Style instead.

Grasshopper.GUI.Canvas.GH_Capsule.Render(System.Drawing.Graphics,System.Drawing.Image,Grasshopper.GUI.Canvas.GH_PaletteStyle)
Have this capsule draw itself onto a Graphics surface with a custom Style override.
G: Graphics object to draw with. Zoom factor is implied by the G.Transform property.
icon: Icon to render in center of content/bounding box.
style: Style to draw capsule with.