Grasshopper.Documentation.GH_GlossaryItem
Represents a single glossary entry in the Grasshopper help.

Grasshopper.Documentation.GH_GlossaryItem.ParseFile(System.String)
Parse a *.glossary file and return a glossary entry.
path: File to parse.
Returns: The glossary entry defined by the file. This function always returns a valid glossary or it throws an exception.

Grasshopper.Documentation.GH_GlossaryItem.Path
Gets the source file for this glossary entry.

Grasshopper.Documentation.GH_GlossaryItem.Word
Gets the word this glossary entry is about.

Grasshopper.Documentation.GH_GlossaryItem.Synonyms
Gets the synonyms for this glossary entry.

Grasshopper.Documentation.GH_GlossaryItem.Pronunciation
Gets the pronunciation guide to the word. This field is optional and may not be defined.

Grasshopper.Documentation.GH_GlossaryItem.Descriptions
Gets the description (definition) for this glossary entry.

Grasshopper.Documentation.GH_GlossaryItem.Author
Gets the author of this glossary entry.
This field is optional and may not be defined.

Grasshopper.Documentation.GH_GlossaryItem.Contact
Gets the contact information for the glossary entry author.
This field is optional and may not be defined.