Grasshopper.GUI.Canvas.GH_PopupSearchDialog


Grasshopper.GUI.Canvas.GH_PopupSearchDialog.BasePoint
The base point indicates where the popup is centered.
This is typically the location of the cursor at the time the popup was created.
The base point is located in the center of the search box.

Grasshopper.GUI.Canvas.GH_PopupSearchDialog.Canvas
Gets or sets the target canvas for this window.