Grasshopper.Kernel.Types.GH_Hatch
Represents an implementation of a Rhino hatch.

Grasshopper.Kernel.Types.GH_Hatch.#ctor
Default constructor, creates an invalid hatch.

Grasshopper.Kernel.Types.GH_Hatch.#ctor(Rhino.Geometry.Hatch)
Create a duplicate of an existing hatch.
hatch: Hatch to duplicate

Grasshopper.Kernel.Types.GH_Hatch.#ctor(Rhino.Geometry.Hatch,Grasshopper.Rhinoceros.Drafting.ModelHatchPattern)
Create a duplicate of an existing hatch.
hatch: Hatch to duplicate

Grasshopper.Kernel.Types.GH_Hatch.#ctor(System.Guid)
Create a new referenced hatch that references a Rhino hatch with the specified ID.
ref_guid: ID of hatch object to reference.

Grasshopper.Kernel.Types.GH_Hatch.#ctor(Grasshopper.Kernel.Types.GH_Hatch)
Create a duplicate of another GH_Hatch. This constructor also copies reference data.
other: Hatch to duplicate

Grasshopper.Kernel.Types.GH_Hatch.DuplicateGeometry
Create a duplicate of this hatch.

Grasshopper.Kernel.Types.GH_Hatch.DuplicateHatch
Create a duplicate of this hatch.

Grasshopper.Kernel.Types.GH_Hatch.IsValid
Gets the validity of this hatch. If the hatch is referenced but cannot be loaded, the hatch is not valid.

Grasshopper.Kernel.Types.GH_Hatch.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Kernel.Types.GH_Hatch.ToString
Format the hatch using default grasshopper formatting logic.

Grasshopper.Kernel.Types.GH_Hatch.ClearCaches
Clears all volatile caches for this instance. The boundingbox is cleared, and if the hatch is referenced,
the local instance of the hatch is erased.

Grasshopper.Kernel.Types.GH_Hatch.IsGeometryLoaded
Gets the load state of this hatch object. The hatch is considered to be loaded when the local hatch instance is not null.

Grasshopper.Kernel.Types.GH_Hatch.LoadGeometry(Rhino.RhinoDoc)
If the hatch is referenced and not yet loaded, attempts to load the hatch.
Returns: True if the hatch is loaded (or if it was already loaded), False on failure.

Grasshopper.Kernel.Types.GH_Hatch.CastFrom(System.Object)
Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_Hatch.CastTo``1(``0@)
Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.