Grasshopper.Kernel.GH_StateTag
Abstract implementation of the IGH_StateTag interface.
Derive from this class rather than implementing IGH_StateTag.

Grasshopper.Kernel.GH_StateTag.Stage
Gets or sets the stage rectangle for this tag.

Grasshopper.Kernel.GH_StateTag.StateDescription
Gets or sets the state description for this tag.

Grasshopper.Kernel.GH_StateTag.RenderTagBlankIcon(System.Drawing.Graphics)
Render a blank rectangle icon.
graphics: Graphics object to draw with.

Grasshopper.Kernel.GH_StateTag.RenderTagBlankIcon(System.Drawing.Graphics,Grasshopper.Kernel.GH_StateTag.DrawCallback)
Render a blank rectangle icon.
graphics: Graphics object to draw with.
drawCallBack: Callback (can be null) that will be called between background and foreground shapes.

Grasshopper.Kernel.GH_StateTag.RenderTagPolygonIcon(System.Drawing.Graphics,System.Drawing.PointF[])
Render a filled polygon with default shading.
graphics: Graphics object to draw with.
polygon: Polygon corners.

Grasshopper.Kernel.GH_StateTag.RenderFreeformIcon(System.Drawing.Graphics,System.Drawing.Drawing2D.GraphicsPath)
Render a filled path with default shading.
graphics: Graphics object to draw with.
path: Path to draw.