Grasshopper.Kernel.Types.GH_InstanceReference
Represents block instance reference. Wraps the functionality of the Rhino.Geometry.InstanceReferenceGeometry type.

Grasshopper.Kernel.Types.GH_InstanceReference.#ctor
Default constructor, creates an invalid instance reference.

Grasshopper.Kernel.Types.GH_InstanceReference.#ctor(Rhino.Geometry.Transform)
Create a duplicate of an existing instance reference.
xform: instance reference to duplicate

Grasshopper.Kernel.Types.GH_InstanceReference.#ctor(System.Guid)
Create a new reference to a Rhino instance reference with the specified ID.
ref_guid: ID of instance reference object to reference.

Grasshopper.Kernel.Types.GH_InstanceReference.#ctor(Rhino.Geometry.InstanceReferenceGeometry)
Create a new reference to a Rhino instance reference with the specified ID.
iref: instance reference object to reference.

Grasshopper.Kernel.Types.GH_InstanceReference.#ctor(Rhino.Geometry.InstanceReferenceGeometry,Grasshopper.Rhinoceros.Model.ModelInstanceDefinition)
Create a new reference to a Rhino instance reference with the specified ID.
iref: instance reference object to reference.
idef: instance definition object to reference.

Grasshopper.Kernel.Types.GH_InstanceReference.#ctor(Grasshopper.Kernel.Types.GH_InstanceReference)
Create a duplicate of another GH_InstanceReference. This constructor also copies reference data.
other: GH_InstanceReference to duplicate

Grasshopper.Kernel.Types.GH_InstanceReference.DuplicateGeometry
Create a duplicate of this GH_InstanceReference.

Grasshopper.Kernel.Types.GH_InstanceReference.DuplicateInstanceReference
Create a duplicate of this GH_InstanceReference.

Grasshopper.Kernel.Types.GH_InstanceReference.IsValid
Gets the validity of this instance reference. If the instance reference is referenced but cannot be loaded, the instance reference is not valid.

Grasshopper.Kernel.Types.GH_InstanceReference.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Kernel.Types.GH_InstanceReference.ToString
Format the instance reference using default grasshopper formatting logic.

Grasshopper.Kernel.Types.GH_InstanceReference.IsReferencedGeometry
Gets a value indicating whether or not this geometry is referenced.
Not all IGH_GeometricGoo implementations support referenced geometry.

Grasshopper.Kernel.Types.GH_InstanceReference.ClearCaches
Clears all volatile caches for this instance. The boundingbox is cleared, and if the instance reference is referenced,
the local instance of the instance reference is erased.

Grasshopper.Kernel.Types.GH_InstanceReference.IsGeometryLoaded
Gets the load state of this instance reference object. The instance reference is considered to be loaded when the local instance is not null.

Grasshopper.Kernel.Types.GH_InstanceReference.LoadGeometry(Rhino.RhinoDoc)
If the instance reference is referenced and not yet loaded, attempts to load the instance reference.
Returns: True if the instance reference is loaded (or if it was already loaded), False on failure.

Grasshopper.Kernel.Types.GH_InstanceReference.CastFrom(System.Object)
Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_InstanceReference.CastTo``1(``0@)
Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.