Grasshopper.Kernel.Geometry.SpatialTrees.Validation3d`1
Delegate to be used during advanced customized searches.
Element type.
element: Potential hit.
globalIndex: Index of item in global list.
node: Node containing the element.
Returns: True if item can be included in the search, false if not.