Grasshopper.Kernel.Special.GH_ColourWheelState
Represents the 12 grips that are part of a colour wheel.

Grasshopper.Kernel.Special.GH_ColourWheelState.SetDefault(Grasshopper.Kernel.Special.GH_ColourWheelStyle)
Set all values to a fixed default.

Grasshopper.Kernel.Special.GH_ColourWheelState.GripAtPoint(System.Drawing.PointF)
Find the grip near a point. Whether or not a grip is considered depends on the Style of this wheel.
point: Location of point in wheel coordinates.
Returns: Grip closest to location or GH_ColourWheelGrip.NoGrip if no grip was near the point.

Grasshopper.Kernel.Special.GH_ColourWheelState.GripAtPoint(Rhino.Geometry.Point3d)
Find the grip near a point.
point: Location of point in wheel coordinates.
Returns: Grip closest to location or GH_ColourWheelGrip.NoGrip if no grip was near the point.

Grasshopper.Kernel.Special.GH_ColourWheelState.BeginGripDrag(System.Drawing.PointF)
Potentially start a new grip drag.
cursor: Location of cursor in wheel coordinates.
Returns: True if the cursor was near enough a grip to initiate a drag operation.

Grasshopper.Kernel.Special.GH_ColourWheelState.BeginGripDrag(Rhino.Geometry.Point3d)
Potentially start a new grip drag.
cursor: Location of cursor in wheel coordinates.
Returns: True if the cursor was near enough a grip to initiate a drag operation.

Grasshopper.Kernel.Special.GH_ColourWheelState.ContinueGripDrag(System.Drawing.PointF)
If BeginGrip(3)rag returned true, call this method on subsequent mousemoves.
cursor: Location of cursor in wheel coordinates.
Returns: True if the drag resulted in a change.

Grasshopper.Kernel.Special.GH_ColourWheelState.ContinueGripDrag(Rhino.Geometry.Point3d)
If BeginGrip(3)rag returned true, call this method on subsequent mousemoves.
cursor: Location of cursor in wheel coordinates.
Returns: True if the drag resulted in a change.

Grasshopper.Kernel.Special.GH_ColourWheelState.EndGripDrag
Terminate a grip drag, this usually happens on mouseup.

Grasshopper.Kernel.Special.GH_ColourWheelState.Dragging
Gets a value indicating whether a dragging operation is currently in progress.

Grasshopper.Kernel.Special.GH_ColourWheelState.Style
Gets or sets the style of the colour wheel.

Grasshopper.Kernel.Special.GH_ColourWheelState.Wheel
Gets or sets the wheel boundary.

Grasshopper.Kernel.Special.GH_ColourWheelState.SaturationRail
Gets the arc that describes the saturation rail.

Grasshopper.Kernel.Special.GH_ColourWheelState.LuminanceRail
Gets the arc that describes the luminance rail.

Grasshopper.Kernel.Special.GH_ColourWheelState.GetGrip(Grasshopper.Kernel.Special.GH_ColourWheelGrip)
Gets the location of a grip of the colour wheel.
Grips will be returned irrespective of style.
grip: Grip to get. Main grips will be on the wheel, range grips slightly on the inside.
Returns: Point on the colour wheel.

Grasshopper.Kernel.Special.GH_ColourWheelState.SetGrip(Grasshopper.Kernel.Special.GH_ColourWheelGrip,Rhino.Geometry.Point3d)
Set a single grip to a new location.
grip: Byval grip to set.
position: New grip position.
Returns: True if the grips were changed.

Grasshopper.Kernel.Special.GH_ColourWheelState.UnifyRanges
Set the rages to the average of all current ranges.

Grasshopper.Kernel.Special.GH_ColourWheelState.RepairAngles
Make sure the main grip angles are within the 0~2Pi range.

Grasshopper.Kernel.Special.GH_ColourWheelState.RenderWheel(System.Drawing.Graphics,System.Double,System.Boolean)
Render the wheel to a graphics surface.
graphics: Graphics object to draw with.
alpha: Apha multiplyer for certain wheel elements. 0 = no draw, 1 = normal draw.
selected: If true, the spectrum disk wil be drawn with a selected overlay.

Grasshopper.Kernel.Special.GH_ColourWheelState.CreatePalette(System.Int32,System.Int32)
Generate a colour palette based on the current state.
seed: Random seed for palette.
count: Number of colours to include in the palette.
Returns: Colour palette (unordered)