Grasshopper.Kernel.Types.GH_WrapperType`1
Defines basic implementation for a wrapper data type.

Grasshopper.Kernel.Types.GH_WrapperType`1.#ctor
Create a blank instance of this wrapper.

Grasshopper.Kernel.Types.GH_WrapperType`1.#ctor(`0)
Create a new instance of this wrapper with a specific value.
data: Value to assign.

Grasshopper.Kernel.Types.GH_WrapperType`1.Value
Gets or sets the item inside this type.