Grasshopper.GUI.Canvas.GH_CanvasChannel
Enumerates all the drawing channels that are handled inside the Grasshopper canvas.

Grasshopper.GUI.Canvas.GH_CanvasChannel.First
First channel. At present, the first channel equals the Groups channel.

Grasshopper.GUI.Canvas.GH_CanvasChannel.Groups
Channel for Group outlines and name tags.

Grasshopper.GUI.Canvas.GH_CanvasChannel.Wires
Channel for connecting wires.

Grasshopper.GUI.Canvas.GH_CanvasChannel.Objects
Channels for Document Objects (components, parameters, special objects)

Grasshopper.GUI.Canvas.GH_CanvasChannel.Overlay
Channel for drawing overlay geometry.

Grasshopper.GUI.Canvas.GH_CanvasChannel.Last
Last channel. At present, the last channel equals the Overlay channel.