Grasshopper.Kernel.GH_PersistentGeometryParam`1
Derives from GH_PersistentParam(Of T), but adds some useful functions for
dealing with geometric data types.
Data type of this parameter.

Grasshopper.Kernel.GH_PersistentGeometryParam`1._expireDespiteSources
This field can be set so force Remote ID registration despite having sources.

Grasshopper.Kernel.GH_PersistentGeometryParam`1.RegisterRemoteIdsDespiteSources
Call this method if you wish to register remote ids in the volatile
data despite having one or more sources. You should only need to do this if
you converted non-referenced data into volatile referenced data.

Grasshopper.Kernel.GH_PersistentGeometryParam`1.OnVolatileDataCollected
This override removes all instances that fail to load their geometry.