Grasshopper.Kernel.Parameters.Param_Integer


Grasshopper.Kernel.Parameters.Param_Integer.AddNamedValue(System.String,System.Int32)
Add a named integer value to this parameter.
Note: Named valued are not (de)serialized.
name: Name of value.
value: Value.

Grasshopper.Kernel.Parameters.Param_Integer.ClearNamedValues
Destroy all named values.
Remarks:

Grasshopper.Kernel.Parameters.Param_Integer.HasNamedValues
Gets whether named values have been defined for this parameter.