Grasshopper.Kernel.GH_FileSystemEventServer
Provides a easy-to-use way to keep tabs on files.

Grasshopper.Kernel.GH_FileSystemEventServer.AllPaths
Gets a list of all the paths currently under surveillance.

Grasshopper.Kernel.GH_FileSystemEventServer.Destroy
Destroys all objects needed. Once this method is called you can
never again use the GH_FileSystemEventServer inside this appdomain.

Grasshopper.Kernel.GH_FileSystemEventServer.AddWatcher(System.Object,System.String,Grasshopper.Kernel.GH_FileSystemEventServer.FileEvent)
Add a new file watcher instance.
owner: The object that owns this watcher.
path: The path of the file to watch.
callback: Callback delegate used during file changes.

Grasshopper.Kernel.GH_FileSystemEventServer.RemoveWatcher(System.Object)
Remove all watchers that are linked to a specific object.

Grasshopper.Kernel.GH_FileSystemEventServer.RemoveWatcher(System.Object,System.String)
Remove all watchers that are linked to a specific object and a specific file path.