Grasshopper.Kernel.Types.GH_Mesh
Represents a 3D polygonal mesh composed of quads and tris. GH_MEsh wraps the functionality of the OpenNURBS OnMesh class.

Grasshopper.Kernel.Types.GH_Mesh.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.