Grasshopper.Kernel.Types.GH_QuickCastType
Enumerates the QuickCast data types.

Grasshopper.Kernel.Types.GH_QuickCastType.bool
System.Boolean

Grasshopper.Kernel.Types.GH_QuickCastType.int
System.Int32

Grasshopper.Kernel.Types.GH_QuickCastType.num
System.Double

Grasshopper.Kernel.Types.GH_QuickCastType.text
System.String

Grasshopper.Kernel.Types.GH_QuickCastType.col
System.Drawing.Color.

Grasshopper.Kernel.Types.GH_QuickCastType.pt
Rhino.Geometry.Point3d

Grasshopper.Kernel.Types.GH_QuickCastType.vec
Rhino.Geometry.Vector3d

Grasshopper.Kernel.Types.GH_QuickCastType.complex
Grasshopper.Kernel.Types.Complex

Grasshopper.Kernel.Types.GH_QuickCastType.interval
Grasshopper.Kernel.Types.Interval

Grasshopper.Kernel.Types.GH_QuickCastType.matrix
Rhino.Geometry.Matrix