Grasshopper.Kernel.GH_ProcessStep
Enumerates all possible solution states in which the document can be.

Grasshopper.Kernel.GH_ProcessStep.PreProcess
The document is ready for a new solution

Grasshopper.Kernel.GH_ProcessStep.Process
The document is currently calculating a new solution, no changes are allowed during this phase

Grasshopper.Kernel.GH_ProcessStep.PostProcess
The document has completed a solution, and nothing has changed since.

Grasshopper.Kernel.GH_ProcessStep.Aborted
The last solution has been aborted before it reached completion.