Grasshopper.CentralSettings
Represents a collection of program wide settings and events for when those settings change.
This should probably be the bottleneck for all program wide settings, but stuff is still littered about for now.

Grasshopper.CentralSettings.#ctor
This class only provides shared methods and cannot be constructed.

Grasshopper.CentralSettings.InvalidBakeAsk
Gets or sets whether a warning ought to be displayed prior to
baking invalid geometry. By default this is always TRUE when
Grasshopper starts.

Grasshopper.CentralSettings.InvalidBakeAllow
Gets or sets the default choice for baking invalid objects.

Grasshopper.CentralSettings.UserOkayWithBakingInvalidObject(System.String)
Show the warning for baking invalid objects, or return the default choice
if the warning is disabled.
Returns: True if object ought to be baked, false if not.

Grasshopper.CentralSettings.AuthorName
Gets or sets the default author name to be used for all data generated by this Grasshopper installation.

Grasshopper.CentralSettings.AuthorCompany
Gets or sets the default author company to be used for all data generated by this Grasshopper installation.

Grasshopper.CentralSettings.AuthorCopyright
Gets or sets the default author copyright to be used for all data generated by this Grasshopper installation.

Grasshopper.CentralSettings.AuthorCopyrightFormatted
Gets the authorCopyright message formatted to match the current date.

Grasshopper.CentralSettings.AuthorAddress
Gets or sets the default author address to be used for all data generated by this Grasshopper installation.

Grasshopper.CentralSettings.AuthorWebsite
Gets or sets the default author website to be used for all data generated by this Grasshopper installation.

Grasshopper.CentralSettings.AuthorEMail
Gets or sets the default author e-mail to be used for all data generated by this Grasshopper installation.

Grasshopper.CentralSettings.AuthorPhone
Gets or sets the default author phone to be used for all data generated by this Grasshopper installation.

Grasshopper.CentralSettings.AuthorDetails
Gets a new GH_AuthorDetails instance populated with the current settings.
Changing this instance does not affect the settings.

Grasshopper.CentralSettings.FormatENotationUpperLimit
Gets or sets at what power of ten decimal formatting of numbers switches to E notation for large numbers.

Grasshopper.CentralSettings.FormatENotationLowerLimit
Gets or sets at what power of ten decimal formatting of numbers switches to E notation for small numbers.

Grasshopper.CentralSettings.FormatENotationUpperThreshold
Gets at what actual threshold numeric formatting switches from decimal to E-Notation.

Grasshopper.CentralSettings.FormatENotationLowerThreshold
Gets at what actual threshold numeric formatting switches from decimal to E-Notation.

Grasshopper.CentralSettings.FormatENotationDigits
Gets or sets how many digits ought to be used for scientific notation formatted numbers.

Grasshopper.CentralSettings.FormatDecimalDigits
Gets or sets how many digits ought to be used for decimal formatted numbers.

Grasshopper.CentralSettings.FormatMultiplesOfOne
Gets or sets whether floating point numbers close to whole integers should be special cased.

Grasshopper.CentralSettings.FormatMultiplesOfPi
Gets or sets whether multiples of 0.5*Pi ought to be special cased.

Grasshopper.CentralSettings.RibbonVisible
Gets or sets a value indicating whether components marked with DropDown exposure
are drawn on the main toolbar anyway.

Grasshopper.CentralSettings.RibbonShowObscure
Gets or sets a value indicating whether components marked with DropDown exposure
are drawn on the main toolbar anyway.

Grasshopper.CentralSettings.RibbonSeparators
Gets or sets whether there are separators between different exposures on the component Ribbon.

Grasshopper.CentralSettings.RibbonDrawTabIcons
Gets or sets whether tab icons are drawn for the ribbon.

Grasshopper.CentralSettings.TemplateFile
Gets or sets the template file path. Use String.Empty or Nothing to disable the template file.

Grasshopper.CentralSettings.IsTemplateFile
Gets whether a template file has been defined and whether that file ectually exists.

Grasshopper.CentralSettings.ShowTutorials
Gets or sets whether the tutorial browser is shown on Grasshopper load.

Grasshopper.CentralSettings.CanvasToolbar
Gets or sets whether or not the canvas toolbar will be visible. This is a global setting.

Grasshopper.CentralSettings.CanvasFancyWires
Gets or sets whether or not fancy wires will be drawn. This is a global setting.

Grasshopper.CentralSettings.CanvasObjectIcons
Gets or sets the global default for icon display.

Grasshopper.CentralSettings.CanvasRadialMenu
Gets or sets the global default for whether the canvas should use Radial or olds-kool menus.

Grasshopper.CentralSettings.CanvasFullNames
Gets or sets the global default for verbose UI. When CanvasFullNames=True,
parameter nicknames are set to their actual (long) names upon addition.

Grasshopper.CentralSettings.CanvasObsoleteTags
Gets or sets the global default for obsolete tags.

Grasshopper.CentralSettings.CanvasZuiZoomLevel
Gets or sets the global Zui zoom threshold.

Grasshopper.CentralSettings.CanvasSpaceIsRadialMenu
Gets or sets whether the space bar triggers the radial menu (pre Rhino 6.3 behaviour)
or the Create menu (post Rhino 6.3 behaviour).

Grasshopper.CentralSettings.CanvasMaxSearchResults
Gets or sets the maximum number of search results for populating the Create menu.

Grasshopper.CentralSettings.CanvasSpaceSearchRadialMessage
Gets or sets the number of times the space-is-now-search-and-not-radial message has been shown.

Grasshopper.CentralSettings.CapsuleHighlight
Gets or sets the global setting for drawing highlight bars on capsules.

Grasshopper.CentralSettings.CapsuleShine
Gets or sets the global setting for drawing shiny edges on capsules.

Grasshopper.CentralSettings.TooltipWiggleRadius
Gets or sets the wiggle radius (in pixels) which the mouse is allowed to move
before the tooltip is nuked.

Grasshopper.CentralSettings.PreviewMeshEdges
Gets or sets the Mesh Wire display flag.

Grasshopper.CentralSettings.PreviewPlaneRadius
Gets or sets the global Plane radius.

Grasshopper.CentralSettings.PreviewPointStyle
Gets or sets the point style for Grasshopper preview points.

Grasshopper.CentralSettings.PreviewPointRadius
Gets the default radius of the point objects given the current style.

Grasshopper.CentralSettings.PreviewBumpZBuffer
Gets or sets whether the Document preview bumps the Z-Buffer.
Setting this value automatically causes a redraw of the Rhino viewports.

Grasshopper.CentralSettings.PreviewGumballs
Gets or sets whether the gumballs will be visible for selected preview geometry.

Grasshopper.CentralSettings.PreviewSelectionThickening
Gets or sets the amount of thickening to apply to selected wires.

Grasshopper.CentralSettings.ComponentCascadeMenus
Gets or sets whether Grasshopper document solutions are wrapped in undo records.

Grasshopper.CentralSettings.PanelDefaultFontFamily
Gets or sets the font family name of the default font for panels.

Grasshopper.CentralSettings.PanelDefaultFontSize
Gets or sets the font family name of the default font for panels.

Grasshopper.CentralSettings.CreateSolutionUndoRecord
Gets or sets whether Grasshopper document solutions are wrapped in undo records.

Grasshopper.CentralSettings.PruderyLevel
Gets or sets the Grasshopper UI prudery level.

Grasshopper.CentralSettings.IsLoadProtected(System.String)
Gets whether a certain plugin is load protected.
pluginName: The name of the plugin file (without the extension).
Returns: True if the plugin is load protected, false if not.

Grasshopper.CentralSettings.SetLoadProtected(System.String,System.Boolean)
Sets whether a certain plugin is load protected.
pluginName: The name of the plugin file (without the extension).
loadProtect: Load protection flag for this plugin.

Grasshopper.CentralSettings.ReadLoadProtection
Ensures that the LoadProtection data exists.

Grasshopper.CentralSettings.WriteLoadProtection
Write the load protection data to the settings.

Grasshopper.CentralSettings.TryDownloadMissingPlugins
Gets or sets whether the 'Unrecognized Objects' dialog pops up
on file load.

Grasshopper.CentralSettings.TrackPluginLoading
Gets or sets whether plugins are tracked during loading
in order to detect plugins causing fatal crashes during load.

Grasshopper.CentralSettings.GetLoadMechanism(System.String)
Gets what load mechanism has been specified for a certain plugin.
pluginName: The name of the plugin file (without the extension).
Returns: The user-defined load mechanism.

Grasshopper.CentralSettings.SetLoadMechanism(System.String,Grasshopper.Kernel.GH_LoadingDemand)
Sets the user defined load mechanism for a certain plugin.
pluginName: The name of the plugin file (without the extension).
mechanism: Load mechanism for this plugin.

Grasshopper.CentralSettings.ReadLoadMechanism
Ensures that the LoadMechanism data exists.

Grasshopper.CentralSettings.WriteLoadMechanism
Write the LoadMechanism data to the settings.

Grasshopper.CentralSettings.AuthorNameChanged
Raised whenever the AuthorName field is changed.

Grasshopper.CentralSettings.AuthorCompanyChanged
Raised whenever the AuthorCompany field is changed.

Grasshopper.CentralSettings.AuthorCopyrightChanged
Raised whenever the AuthorCopyright field is changed.

Grasshopper.CentralSettings.AuthorAddressChanged
Raised whenever the AuthorAddress field is changed.

Grasshopper.CentralSettings.AuthorWebsiteChanged
Raised whenever the AuthorWebsite field is changed.

Grasshopper.CentralSettings.AuthorEMailChanged
Raised whenever the AuthorEMail field is changed.

Grasshopper.CentralSettings.AuthorPhoneChanged
Raised whenever the AuthorPhone field is changed.

Grasshopper.CentralSettings.FormattingChanged
Raised whenever a formatting setting is changed.

Grasshopper.CentralSettings.RibbonVisibleChanged
Raised whenever the RibbonVisible setting changes.

Grasshopper.CentralSettings.RibbonAllIconsChanged
Raised whenever the RibbonAllIcons setting changes.

Grasshopper.CentralSettings.RibbonSeparatorsChanged
Raised whenever the RibbonSeparators setting changes.

Grasshopper.CentralSettings.RibbonDrawTabIconsChanged
Raised whenever the RibbonDrawTabIcons setting changes.

Grasshopper.CentralSettings.UiScaleChanged
Raised whenever the UiScale setting changes.

Grasshopper.CentralSettings.TemplateFileChanged
Raised whenever the TemplateFile property is changed.

Grasshopper.CentralSettings.CanvasToolbarChanged
Raised whenever the CanvasToolbar setting changes.

Grasshopper.CentralSettings.CanvasFancyWiresChanged
Raised whenever the CanvasFancyWires setting changes.

Grasshopper.CentralSettings.CanvasObjectIconsChanged
Raised whenever the CanvasObjectIcons setting changes.

Grasshopper.CentralSettings.CanvasRadialMenuChanged
Raised whenever the CanvasRadialMenu setting changes.

Grasshopper.CentralSettings.CanvasFullNamesChanged
Raised whenever the CanvasFullNames setting changes.

Grasshopper.CentralSettings.CanvasObsoleteTagsChanged
Raised whenever the CanvasObsoleteTags setting changes.

Grasshopper.CentralSettings.CanvasZuiZoomLevelChanged
Raised whenever the CanvasZuiZoomLevel setting changes.

Grasshopper.CentralSettings.TooltipWiggleRadiusChanged
Raised whenever the TooltipWiggleRadius setting changes.

Grasshopper.CentralSettings.PreviewMeshEdgesChanged
Raised whenever the PreviewMeshEdges setting changes.

Grasshopper.CentralSettings.PreviewPlaneRadiusChanged
Raised whenever the PreviewPlaneRadius setting changes.

Grasshopper.CentralSettings.PreviewPointStyleChanged
Raised whenever the PreviewPointStyle setting changes.

Grasshopper.CentralSettings.PreviewBumpZBufferChanged
Raised whenever the PreviewBumpZBuffer setting changes.

Grasshopper.CentralSettings.PreviewGumballsChanged
Raised whenever the PreviewGumballs setting changes.

Grasshopper.CentralSettings.ComponentCascadeMenusChanged
Raised whenever the ComponentCascadeMenus setting changes.

Grasshopper.CentralSettings.PanelDefaultFontChanged
Raised whenever the PanelDefaultFontFamily or PanelDefaultFontSize settings change.

Grasshopper.CentralSettings.CreateSolutionUndoRecordChanged
Raised whenever the CreateSolutionUndoRecord setting changes.

Grasshopper.CentralSettings.PruderyLevelChanged
Raised whenever the PruderyLevel setting changes.

Grasshopper.CentralSettings.LoadProtectionChanged
Raised whenever the load protection of a certain plugin changes.
pluginName: The name of the plugin file (without the extension).

Grasshopper.CentralSettings.LoadMechanismChanged
Raised whenever the load mechanism of a certain plugin changes.
pluginName: The name of the plugin file (without the extension).