Grasshopper.GUI.HTML.GH_CssStyleSheet
Represents an entire CSS style sheet specification.

Grasshopper.GUI.HTML.GH_CssStyleSheet.#ctor
Create a new CSS style sheet.

Grasshopper.GUI.HTML.GH_CssStyleSheet.Styles
Gets a list of all the CSS styles defined locally.

Grasshopper.GUI.HTML.GH_CssStyleSheet.Links
Gets a list of all the CSS style sheet links.

Grasshopper.GUI.HTML.GH_CssStyleSheet.IsStyleDefined(Grasshopper.GUI.HTML.GH_CssStyle)
Test to see whether a style has already been defined.
style: Style to test.
Returns: True if the style has already been defined.

Grasshopper.GUI.HTML.GH_CssStyleSheet.AddStyle(Grasshopper.GUI.HTML.GH_CssStyle[])
Add a new style to this sheet. If the style is already defined, it will not be added again.
styles: Styles to add.

Grasshopper.GUI.HTML.GH_CssStyleSheet.FormatCss(System.Int32)
Format the entire style-sheet as CSS 2.0 compliant text.
indent: Indentation depth of css sheet.