Grasshopper.Kernel.Parameters.Param_FilePath


Grasshopper.Kernel.Parameters.Param_FilePath.FileFilter
Gets or sets the file filter to use during 'Set One' and 'Set Multiple' operations.

Grasshopper.Kernel.Parameters.Param_FilePath.ExpireOnFileEvent
Gets or sets whether this parameter expires when a file that is local changes.