Grasshopper.GUI.Canvas.GH_Viewport
Provides functionality for panning and zooming in a GH_Canvas environment.

Grasshopper.GUI.Canvas.GH_Viewport.Width
Gets or sets the width of the viewport.
Typically this is tied to the dimensions of the canvas.
Width is not allowed to go below 5 pixels.

Grasshopper.GUI.Canvas.GH_Viewport.Height
Gets or sets the height of the viewport.
Typically this is tied to the dimensions of the canvas.
Height is not allowed to go below 5 pixels.

Grasshopper.GUI.Canvas.GH_Viewport.Size
Gets or sets the size of the viewport. The size is typically tied to the dimensions of the Canvas.

Grasshopper.GUI.Canvas.GH_Viewport.Diagonal
Gets the length of the diagonal of the viewport in canvas coordinates.

Grasshopper.GUI.Canvas.GH_Viewport.Tx
Gets or sets the x-component of the target pixel. The target represents where the canvas origin is drawn.

Grasshopper.GUI.Canvas.GH_Viewport.Ty
Gets or sets the y-component of the target pixel. The target represents where the canvas origin is drawn.

Grasshopper.GUI.Canvas.GH_Viewport.Target
Gets or sets the location of the target pixel. The target represents where the canvas origin is drawn.

Grasshopper.GUI.Canvas.GH_Viewport.TargetRatio
Gets or sets the target ratio with respect to the viewport dimensions.
This is a useful tool to prevent weird view changes during a canvas resize.

Grasshopper.GUI.Canvas.GH_Viewport.ScreenPort
Gets the dimensions of the viewport in control coordinates.

Grasshopper.GUI.Canvas.GH_Viewport.ControlMidPoint
Gets the point in the exact center of the viewport in control coordinates.

Grasshopper.GUI.Canvas.GH_Viewport.MidPoint
Gets or sets the canvas coordinate that is directly underneath the center of the viewport.

Grasshopper.GUI.Canvas.GH_Viewport.Zoom
Gets or sets the Zoom factor of the viewport. Please assign only sensible values.

Grasshopper.GUI.Canvas.GH_Viewport.ZoomInverse
Gets the inverse of the zoom.

Grasshopper.GUI.Canvas.GH_Viewport.Zoom(System.Boolean)
Sets the zoom of the viewport with a view anchor.
adjustTarget: If true, the target will be adjusted so that the center point remains the same.

Grasshopper.GUI.Canvas.GH_Viewport.Focus(System.Drawing.Point)
Look at a specific point.
pt: Point to focus on.

Grasshopper.GUI.Canvas.GH_Viewport.Focus(System.Drawing.PointF)
Look at a specific point.
pt: Point to focus on.

Grasshopper.GUI.Canvas.GH_Viewport.Focus(Grasshopper.Kernel.IGH_Attributes)
Look at a specific object.
attribute: Object attribute to focus on.

Grasshopper.GUI.Canvas.GH_Viewport.Focus(System.Collections.Generic.List{Grasshopper.Kernel.IGH_Attributes})
Look at a set of specific objects.
attributes: Object attributes to focus on.

Grasshopper.GUI.Canvas.GH_Viewport.XFormMatrix(Grasshopper.GUI.Canvas.GH_Viewport.GH_DisplayMatrix)
Gets the display transformation cached by this viewport.
Projection: Transformation type to retrieve.

Grasshopper.GUI.Canvas.GH_Viewport.ApplyProjection(System.Drawing.Graphics)
Apply the current display transformation to a Graphics object.

Grasshopper.GUI.Canvas.GH_Viewport.ComputeProjection
Forces a recomputation of all cached data.

Grasshopper.GUI.Canvas.GH_Viewport.VisibleRegion
Gets the rectangle in canvas coordinates that is visible in the control.

Grasshopper.GUI.Canvas.GH_Viewport.ProjectX(System.Single)
Project a value along constant X from canvas coordinates into control coordinates.
x: The constant X value in canvas coordinates.
Returns: The associated X value in control pixel coordinates.

Grasshopper.GUI.Canvas.GH_Viewport.ProjectY(System.Single)
Project a value along constant Y from canvas coordinates into control coordinates.
y: The constant Y value in canvas coordinates.
Returns: The associated Y value in control pixel coordinates.

Grasshopper.GUI.Canvas.GH_Viewport.UnprojectX(System.Single)
Project a value along constant X from control coordinates into canvas coordinates.
x: The constant X value in control coordinates.
Returns: The associated X value in canvas coordinates.

Grasshopper.GUI.Canvas.GH_Viewport.UnprojectY(System.Single)
Project a value along constant Y from control coordinates into canvas coordinates.
y: The constant Y value in control coordinates.
Returns: The associated Y value in canvas coordinates.

Grasshopper.GUI.Canvas.GH_Viewport.ProjectPoint(System.Drawing.PointF)
Project a point from canvas coordinates into control coordinates.
pt: The point in canvas coordinates.
Returns: The associated point in control pixel coordinates.

Grasshopper.GUI.Canvas.GH_Viewport.UnprojectPoint(System.Drawing.PointF)
Project a point from control coordinates into canvas coordinates.
pt: The point in control coordinates.
Returns: The associated point in canvas coordinates.

Grasshopper.GUI.Canvas.GH_Viewport.ProjectRectangle(System.Drawing.RectangleF)
Project a rectangle from canvas coordinates into control coordinates.
rec: The rectangle in canvas coordinates.
Returns: The associated rectangle in control pixel coordinates.

Grasshopper.GUI.Canvas.GH_Viewport.UnprojectRectangle(System.Drawing.RectangleF)
Project a rectangle from control coordinates into canvas coordinates.
rec: The rectangle in control coordinates.
Returns: The associated rectangle in canvas coordinates.

Grasshopper.GUI.Canvas.GH_Viewport.Project(System.Drawing.PointF@)
Transform a point from canvas into control coordinate space.
pt: Point to transform.

Grasshopper.GUI.Canvas.GH_Viewport.Unproject(System.Drawing.PointF@)
Transform a point from control into canvas coordinate space.
pt: Point to transform.

Grasshopper.GUI.Canvas.GH_Viewport.IsVisible(System.Drawing.PointF@,System.Single)
Test visibility of a point.
pt: Point in canvas coordinates.
margin: Fuzzy area around point to test.
Returns: True if the point is visible in the control upon projection.

Grasshopper.GUI.Canvas.GH_Viewport.IsVisible(System.Drawing.RectangleF@,System.Single)
Test visibility of a rectangle.
rec: Rectangle in canvas coordinates.
margin: Fuzzy area around rectangle to test.
Returns: True if the rectangle is visible in the control upon projection.

Grasshopper.GUI.Canvas.GH_Viewport.DollyZoom(Grasshopper.GUI.GH_CanvasMouseEvent)
Advanced interface function for mouse 'dolly' zooming.
e: Event arguments.
Returns: True if a change to the viewport was made, otherwise false.

Grasshopper.GUI.Canvas.GH_Viewport.LimitUnit(System.Single,System.Single,System.Single)
Utility function for calculating pixel dimensions in a zoom-aware environment.
The desired value is put through the zoom projection and if the resulting
size (as displayed on the screen) exceeds the visual limits it is clipped.
This function can be used for example to make sure that a certain penwidth
never exceeds visual limits (i.e. it doesn't get too thin or too thick on the screen).
guide_value: Initial value.
no_less_than: Minimum allowed visible size on screen.
no_more_than: Maximum allowed visible size on screen.

Grasshopper.GUI.Canvas.GH_Viewport.SolveUnit(System.Single,System.Single,System.Single)
Utility function for calculating graphics dimensions in a zoom-aware environment.
This function can be used for example to compute the linewidth of a pen which always
needs to appear as 3 pixels thick on the screen regardless of zoom values.
desired: Desired value in pixel units.
no_less_than: Minimum allowed size in graphics coordinates.
no_more_than: Maximum allowed size in graphics coordinates.