Grasshopper.GUI.Gradient.GH_Gradient
Represents a colour gradient defined by a succession of grips.

Grasshopper.GUI.Gradient.GH_Gradient.#ctor(Grasshopper.GUI.Gradient.GH_Gradient)
Create a duplicate of another gradient.
other: Gradient to duplicate.

Grasshopper.GUI.Gradient.GH_Gradient.#ctor(System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Drawing.Color})
Create a new gradient from grips and colours.
parameters: Grip locations.
colours: Colours for each grip.

Grasshopper.GUI.Gradient.GH_Gradient.OnGradientChanged
Raise the GradientChanged event.

Grasshopper.GUI.Gradient.GH_Gradient.OnGradientChangedIntermediate
Raise the GradientChanged event.

Grasshopper.GUI.Gradient.GH_Gradient.OnSelectionChanged
Raise the SelectionChanged event.

Grasshopper.GUI.Gradient.GH_Gradient.GripCount
Gets the number of grips in this gradient.

Grasshopper.GUI.Gradient.GH_Gradient.Grip(System.Int32)
Gets or sets the grip at the given index.
index: Index of grip to retrieve.
Returns: The grip at the given index.

Grasshopper.GUI.Gradient.GH_Gradient.FirstGrip
Gets the first grip in this gradient.

Grasshopper.GUI.Gradient.GH_Gradient.LastGrip
Gets the last grip in this gradient.

Grasshopper.GUI.Gradient.GH_Gradient.Locked
Gets or sets whether this gradient is locked.
A locked gradient cannot be modified by the user.

Grasshopper.GUI.Gradient.GH_Gradient.Linear
Gets or sets whether the colours are interpolated linearly between grips.

Grasshopper.GUI.Gradient.GH_Gradient.SelectedGrip
Gets or sets the selected grip.

Grasshopper.GUI.Gradient.GH_Gradient.AddGrip(System.Double)
Add a new grip to the gradient. The colour of the grip will be picked
so that there is no difference to the gradient, though this is not actually
possible when the interpolation mode is not linear.
t: Grip parameter.

Grasshopper.GUI.Gradient.GH_Gradient.AddGrip(System.Double,System.Drawing.Color)
Add a new single-colour grip.
t: Parameter for grip.
c: Colour of grip.

Grasshopper.GUI.Gradient.GH_Gradient.AddGrip(System.Double,System.Drawing.Color,System.Drawing.Color)
Add a new bi-colour grip.
t: Parameter for grip.
c0: Left colour of grip.
c1: Right colour of grip.

Grasshopper.GUI.Gradient.GH_Gradient.AddGrip(Grasshopper.GUI.Gradient.GH_Grip)
Add a new grip to the gradient.
This method does not raise the GradientChanged event, so you need to do that yourself
by calling OnGradientChanged().
grip: Grip to add.

Grasshopper.GUI.Gradient.GH_Gradient.RemoveGrip(System.Int32)
Remove the grip at the specified index.
index: Index of grip to remove.

Grasshopper.GUI.Gradient.GH_Gradient.RemoveGrip(Grasshopper.GUI.Gradient.GH_Grip)
Remove the specified grip.
grip: Grip to remove.

Grasshopper.GUI.Gradient.GH_Gradient.NormalizeGrips
Normalize all grips.
This will scale all grip parameters so that the full gradient extend equals 0~1.

Grasshopper.GUI.Gradient.GH_Gradient.NewGripRegion(System.Drawing.RectangleF)
Gets the new Grip region rectangle based on a gradient destination rectangle.
destination: Gradient destination rectangle.

Grasshopper.GUI.Gradient.GH_Gradient.DeleteGripRegion(System.Drawing.RectangleF)
Gets the Delete Grip region rectangle based on a gradient destination rectangle.
destination: Gradient destination rectangle.

Grasshopper.GUI.Gradient.GH_Gradient.MouseDown(System.Drawing.RectangleF,System.Drawing.PointF)
Begin grip drag operation.
dest: Destination rectangle of the gradient.
pt: Mouse position in destination coordinates.
Returns: True if a grip drag was started, false otherwise.

Grasshopper.GUI.Gradient.GH_Gradient.MouseMove(System.Drawing.RectangleF,System.Drawing.PointF)
Continue grip dragging operation.
dest: Destination rectangle of gradient.
pt: Mouse position in destination coordinates.
Returns: True if a grip position was changed, false otherwise. Redraws are only required on TRUE.

Grasshopper.GUI.Gradient.GH_Gradient.MouseUp(System.Drawing.RectangleF,System.Drawing.PointF,System.Boolean)
Terminate grip drag.
dest: Destination rectangle of gradient
pt: Mouse location in destination coordinates

Grasshopper.GUI.Gradient.GH_Gradient.MouseDragAbort
Abort grip drag.

Grasshopper.GUI.Gradient.GH_Gradient.NearestGrip(System.Drawing.RectangleF,System.Drawing.PointF,System.Double)
Find the nearest grip in screen coordinates.
dest: Retangle that contains the entire gradient.
pt: Point to search from.
maxRadius: Maximum distance between point and grip.
Returns: The grip closest to the point.

Grasshopper.GUI.Gradient.GH_Gradient.NearestGrip(System.Double)
Find the nearest grip to a parameter.
t: Parameter to search from.
Returns: The grip nearest to the parameter.

Grasshopper.GUI.Gradient.GH_Gradient.NearestGrip(System.Double,Grasshopper.GUI.Gradient.GH_GripSide)
Find the nearest grip to a parameter.
t: Parameter to search from.
side: Side to search.
Returns: The grip nearest to the parameter.

Grasshopper.GUI.Gradient.GH_Gradient.ColourAt(System.Double)
Evaluate the colour at a specific parameter.
t: Parameter to evaluate.
Returns: The colour at the given parameter.