Grasshopper.GUI.GH_RotationalFrame
Represents a single frame in a rotational tuning history.
Remarks:

Grasshopper.GUI.GH_RotationalFrame.Pivot
Gets or sets the pivot of the event.

Grasshopper.GUI.GH_RotationalFrame.Point
Gets or sets the location of the rotation event.

Grasshopper.GUI.GH_RotationalFrame.Angle
Gets or sets the local angle of the rotation event.

Grasshopper.GUI.GH_RotationalFrame.Time
Gets or sets the time when the event was recorded.