Grasshopper.Kernel.GH_ActiveObject
Basic implementation of IGH_ActiveObject interface.
Derive from this class rather than implementing IGH_ActiveObject to make your life easier.

Grasshopper.Kernel.GH_ActiveObject.ExpireSolution(System.Boolean)
Informs the document that owns this object that the solution has expired.
The current object will be set to BLANK as a result. This method is recursive,
it will also expire any and all objects which depend on this object.
If you want a less destructive expiration, consider using ClearData().
If this object is already Blank, you should consider not expiring it.
recompute: If True, the document will be instructed to solve the new state.

Grasshopper.Kernel.GH_ActiveObject.ExpireDownStreamObjects
This function is called whenever the solution for this object expires.
Override this function if objects depend on you.

Grasshopper.Kernel.GH_ActiveObject.IsDataProvider
Returns a boolean indicating whether or not the current object can seed data.

Grasshopper.Kernel.GH_ActiveObject.DependsOn(Grasshopper.Kernel.IGH_ActiveObject)
Returns a boolean indicating whether or not the current object somehow inherits from the PotenialSource object
PotentialSource:
Returns:

Grasshopper.Kernel.GH_ActiveObject.SDKCompliancy(System.Int32,System.Int32)
Test whether this object is compliant with a given Rhino version.
exeVersion: Rhino major release (4, 5, ...).
exeServiceRelease: Rhino minor (service) release.
Returns: True if this object is compliant with the given Rhino release.

Grasshopper.Kernel.GH_ActiveObject.Phase
Gets or sets the solution phase this object is currenly in.

Grasshopper.Kernel.GH_ActiveObject.ClearData
This function is called whenever the object needs to
clear all solution data. Override this function if you need to perform custom clensing.

Grasshopper.Kernel.GH_ActiveObject.CollectData
This function is called whenever the object is required to collect
all data. Either from Persistent records, from source params or whatever.

Grasshopper.Kernel.GH_ActiveObject.ComputeData
This function is called whenever the object is required to generate new data.

Grasshopper.Kernel.GH_ActiveObject.RegisterRemoteIDs(Grasshopper.Kernel.GH_GuidTable)
Override this function if you want object changes in the Rhino document to trigger a new solution.
id_list: The object ID database Grasshopper is responsive to.

Grasshopper.Kernel.GH_ActiveObject.Locked
Gets or sets the enabled flag of this object. Disabled objects are ignored during solutions.

Grasshopper.Kernel.GH_ActiveObject.ClearRuntimeMessages
Destroy all warning and error lists

Grasshopper.Kernel.GH_ActiveObject.AddRuntimeMessage(Grasshopper.Kernel.GH_RuntimeMessageLevel,System.String)
Add a new message to this object. Valid message type flags are Warning and Error.
If the Message string is empty or zero-length no message is added.
level: Type of message. Only Warnings and Errors are recorded.
text: Content of message.

Grasshopper.Kernel.GH_ActiveObject.RuntimeMessages(Grasshopper.Kernel.GH_RuntimeMessageLevel)
Gets the list of cached runtime messages that were recorded during solver-time processes.
level: Runtime message type to retrieve.
Returns: A list of runtime message strings.

Grasshopper.Kernel.GH_ActiveObject.RuntimeMessageLevel
Returns the worst case flag for the current object
If the object contains at least 1 error, the result is Error.
If the object contains at least 1 warning, the result is Warning.
If the object contains at least 1 message, the result is Remark.
If the object contains no errors, no warnings and no messages, the result is Blank.

Grasshopper.Kernel.GH_ActiveObject.ProcessorTime
Gets the most recent processor time profiler value.

Grasshopper.Kernel.GH_ActiveObject.MutableNickName
Gets or sets a value that enables Nick name changes through the menu.
The default is TRUE.

Grasshopper.Kernel.GH_ActiveObject.IconCapableUI
By default the NickName menu item supports the Icon Mode override toggle.
If your UI is not capable of displaying icons, then override this property
and return False.

Grasshopper.Kernel.GH_ActiveObject.AppendMenuItems(System.Windows.Forms.ToolStripDropDown)
This function is called when a context menu is about to be displayed.
Override it to set custom items. GH_ActiveObject will already populate
the menu with default items, if you merely wish to insert object-specific
menu item, consider overriding AppendAdditionalMenuItems instead.
menu: Menu object to populate.
Returns: If true, the menu will be displayed, if false the menu will be supressed.

Grasshopper.Kernel.GH_ActiveObject.AppendAdditionalMenuItems(System.Windows.Forms.ToolStripDropDown)
Override this function if you want to add additional items to the object context menu.
Default items already included in the menu toolstrip are:
1. Name
2. Preview
3. Warnings
4. Errors
5. [additional items will be inserted here]
6. Help

Grasshopper.Kernel.GH_ActiveObject.Menu_AppendRuntimeMessages(System.Windows.Forms.ToolStripDropDown)
Append the default warnings and errors menu items.

Grasshopper.Kernel.GH_ActiveObject.Menu_AppendWarningsAndErrors(System.Windows.Forms.ToolStripDropDown)
This method is obsolete and has been replaced with Menu_AppendRuntimeMessages().
menu:

Grasshopper.Kernel.GH_ActiveObject.Menu_AppendEnableItem(System.Windows.Forms.ToolStripDropDown)
Append the default Enable/Disable menu item.

Grasshopper.Kernel.GH_ActiveObject.Menu_AppendPreviewItem(System.Windows.Forms.ToolStripDropDown)
Append the default Show/Hide preview menu item.

Grasshopper.Kernel.GH_ActiveObject.Menu_AppendBakeItem(System.Windows.Forms.ToolStripDropDown)
Append the default Bake menu item.