Grasshopper.Kernel.Components.GH_ReadFileComponent


Grasshopper.Kernel.Components.GH_ReadFileComponent.ParserCode
Gets or sets the local parser code.

Grasshopper.Kernel.Components.GH_ReadFileComponent.Parser
Gets or sets the local parser instance.