Grasshopper.My.Resources.Res_SignalIcons
A strongly-typed resource class, for looking up localized strings, etc.

Grasshopper.My.Resources.Res_SignalIcons.ResourceManager
Returns the cached ResourceManager instance used by this class.

Grasshopper.My.Resources.Res_SignalIcons.Culture
Overrides the current thread's CurrentUICulture property for all
resource lookups using this strongly typed resource class.

Grasshopper.My.Resources.Res_SignalIcons.Error_12x12
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_SignalIcons.Error_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_SignalIcons.Error_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_SignalIcons.Error_40x40
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_SignalIcons.Info_12x12
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_SignalIcons.Info_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_SignalIcons.Info_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_SignalIcons.Info_40x40
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_SignalIcons.No_Message_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_SignalIcons.OK_12x12
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_SignalIcons.OK_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_SignalIcons.OK_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_SignalIcons.OK_40x40
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_SignalIcons.Warning_12x12
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_SignalIcons.Warning_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_SignalIcons.Warning_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_SignalIcons.Warning_40x40
Looks up a localized resource of type System.Drawing.Bitmap.