Grasshopper.GUI.Gradient.GH_Gradient.DragMode.None
No grip dragging.

Grasshopper.GUI.Gradient.GH_Gradient.DragMode.Drag
Dragging an existing grip along the gradient.

Grasshopper.GUI.Gradient.GH_Gradient.DragMode.Delete
Dragging a grip into the delete areas.