Grasshopper.GUI.Base.GH_ColourCube
Maintains a collection of graphical shapes and coordinates that specify
important features of the Colour Space Cube graphics.

Grasshopper.GUI.Base.GH_ColourCube.#ctor(System.Drawing.Rectangle,Grasshopper.GUI.Base.GH_ColourSpace,Rhino.Geometry.Point4d)
Create a new instance of this class.
box: Rectangle containing entire colour cube. Should be square.

Grasshopper.GUI.Base.GH_ColourCube.C0
Gets the first point in the corner point list.

Grasshopper.GUI.Base.GH_ColourCube.C1
Gets the second point in the corner point list.

Grasshopper.GUI.Base.GH_ColourCube.C2
Gets the third point in the corner point list.

Grasshopper.GUI.Base.GH_ColourCube.C3
Gets the fourth point in the corner point list.

Grasshopper.GUI.Base.GH_ColourCube.C4
Gets the fifth point in the corner point list.

Grasshopper.GUI.Base.GH_ColourCube.C5
Gets the sixth point in the corner point list.

Grasshopper.GUI.Base.GH_ColourCube.C6
Gets the seventh point in the corner point list.

Grasshopper.GUI.Base.GH_ColourCube.C7
Gets the eighth point in the corner point list.

Grasshopper.GUI.Base.GH_ColourCube.BottomFace
Gets a graphics path describing the bottom face of the cube.
Caller is responsible for disposing of this path instance.

Grasshopper.GUI.Base.GH_ColourCube.LeftFace
Gets a graphics path describing the left face of the cube.
Caller is responsible for disposing of this path instance.

Grasshopper.GUI.Base.GH_ColourCube.BackFace
Gets a graphics path describing the back face of the cube.
Caller is responsible for disposing of this path instance.

Grasshopper.GUI.Base.GH_ColourCube.Silhouette
Gets a graphics path describing the silhouette of the cube.
Caller is responsible for disposing of this path instance.

Grasshopper.GUI.Base.GH_ColourCube.Slice
Gets the rectangle that describes the cutting slide through the current colour space.

Grasshopper.GUI.Base.GH_ColourCube.Pivot
Gets the point that describes the center of the pivot on the slice.

Grasshopper.GUI.Base.GH_ColourCube.Grip
Gets the rectangle that describes the slice grip.

Grasshopper.GUI.Base.GH_ColourCube.S0
Gets the first point in the shadow point list.
This point is coincident with C0.

Grasshopper.GUI.Base.GH_ColourCube.S1
Gets the second point in the shadow point list.
This is the corner of the drop-shadow on the bottom face.

Grasshopper.GUI.Base.GH_ColourCube.S2
Gets the third point in the shadow point list.
This point is the kink of the drop-shadow on the edge connecting C2 and C3.

Grasshopper.GUI.Base.GH_ColourCube.S3
Gets the fourth point in the shadow point list.
This point is coincident with C7.

Grasshopper.GUI.Base.GH_ColourCube.S4
Gets the fifth point in the shadow point list.
This point is coincident with C4.

Grasshopper.GUI.Base.GH_ColourCube.Shadow
Gets a graphics path describing the outline of the drop shadow.
Caller is responsible for disposing of this path instance.

Grasshopper.GUI.Base.GH_ColourCube.ShadowEdge0
0 = C0, 1 = C0/C1, 2 = C3/C2, 3 = C3, 4 = C3/C7, 5 = C0/C4.

Grasshopper.GUI.Base.GH_ColourCube.ShadowEdge1
0 = C3, 1 = C3/c0, 2 = C2/C1, 3 = C2, 4 = C2/C6, 5 = C3/C7.

Grasshopper.GUI.Base.GH_ColourCube.ShadowEdge2
0 = C3, 1 = C3/C2, 2 = C7/C6, 3 = C7, 4 = C7/C4, 5 = C3/C0.

Grasshopper.GUI.Base.GH_ColourCube.ColorAtSlice(System.Drawing.PointF)
Get the color at a position on the slice.
pt: Point on slice (will be projected into slice limits)
Returns: Point4d structure representing the colour in the current space.

Grasshopper.GUI.Base.GH_ColourCube.ColorAtRail(System.Drawing.PointF)
Get the color at a position along the depth rail.
pt: Point along rail (will be projected into rail limits)
Returns: Point4d structure representing the colour in the current space.

Grasshopper.GUI.Base.GH_ColourCube.RenderAll(System.Drawing.Graphics)
Call all render methods in the correct order.
G: Graphics object to draw with.

Grasshopper.GUI.Base.GH_ColourCube.RenderBackFaces(System.Drawing.Graphics)
Render the fills of the backfaces.
G: Graphics object to draw with

Grasshopper.GUI.Base.GH_ColourCube.RenderBackEdges(System.Drawing.Graphics)
Render the edges of the back face creases.
G: Graphics object to draw with

Grasshopper.GUI.Base.GH_ColourCube.RenderForeEdges(System.Drawing.Graphics)
Render the edges of the fore face creases.
G: Graphics object to draw with

Grasshopper.GUI.Base.GH_ColourCube.RenderSilhouetteEdges(System.Drawing.Graphics)
Render the edges of the cube silhouettes.
G: Graphics object to draw with

Grasshopper.GUI.Base.GH_ColourCube.RenderDropShadow(System.Drawing.Graphics)
Render the drop shadow of the cube.
G: Graphics object to draw with

Grasshopper.GUI.Base.GH_ColourCube.RenderEdgeShadows(System.Drawing.Graphics)
Render the edge shadows of the cube due to GI.
G: Graphics object to draw with

Grasshopper.GUI.Base.GH_ColourCube.RenderSlice(System.Drawing.Graphics)
Render the square slice with colour gradients.
G: Graphics object to draw with.

Grasshopper.GUI.Base.GH_ColourCube.RenderPivot(System.Drawing.Graphics)
Render the colour pivot on the current slice.
G: Graphics object to draw with.

Grasshopper.GUI.Base.GH_ColourCube.RenderGrip(System.Drawing.Graphics)
Render the slice grip.
G: Graphics object to draw with.

Grasshopper.GUI.Base.GH_ColourCube.RenderSliceEdgeShadows(System.Drawing.Graphics)
Render the edge shadows of the slice due to GI.
G: Graphics object to draw with.

Grasshopper.GUI.Base.GH_ColourCube.RenderSliceDropShadow(System.Drawing.Graphics)
Render the drop shadow onto the slice.
G: Graphics object to draw with.

Grasshopper.GUI.Base.GH_ColourCube.RenderSliceSilhouetteEdges(System.Drawing.Graphics)
Render the silhouette edges of the slice.
G: Graphics object to draw with.

Grasshopper.GUI.Base.GH_ColourCube.Color0
Gets the color in the lower left corner of the slice.

Grasshopper.GUI.Base.GH_ColourCube.Color1
Gets the color in the lower right corner of the slice.

Grasshopper.GUI.Base.GH_ColourCube.Color2
Gets the color in the upper right corner of the slice.

Grasshopper.GUI.Base.GH_ColourCube.Color3
Gets the color in the upper left corner of the slice.

Grasshopper.GUI.Base.GH_ColourCube.Blend(System.Drawing.Color,System.Drawing.Color,System.Double)
Inteprolate between two colours.
A: First colour.
B: Second colour.
t: Interpolation parameter.
Returns: Interpolated colour.

Grasshopper.GUI.Base.GH_ColourCube.Average(System.Drawing.Color,System.Drawing.Color)
Compute the average of two colours.
A: First colour for average.
B: Second colour for average.
Returns: The average of A and B.

Grasshopper.GUI.Base.GH_ColourCube.Average(System.Drawing.Color,System.Drawing.Color,System.Drawing.Color,System.Drawing.Color)
Compute the average of four colours.
A: First colour for average.
B: Second colour for average.
C: Third colour for average.
D: Fourth colour for average.
Returns: The average of A, B, C and D.