Grasshopper.GUI.GH_TextRenderingConstants
Contains app wide text-rendering constants. When you are drawing your own texts
use these constants instead of TextRenderingHint::****

Grasshopper.GUI.GH_TextRenderingConstants.GH_CrispText
Gets the Grasshopper default text rendering hint for crisply drawn strings.
By default this hint is TextRenderingHint.ClearTypeGridFit, but it can be changed
in the settings.

Grasshopper.GUI.GH_TextRenderingConstants.GH_SmoothText
Gets the Grasshopper default text rendering hint for smoothly drawn strings.
By default this hint is TextRenderingHint.AntiAlias, but it can be changed
in the settings.

Grasshopper.GUI.GH_TextRenderingConstants.CenterCenter
Gets the String format for Center Center alignment.
Do not dispose or modify this StringFormat instance.

Grasshopper.GUI.GH_TextRenderingConstants.NearCenter
Gets the String format for Near (horizontal) Center (vertical) alignment.
Do not dispose or modify this StringFormat instance.

Grasshopper.GUI.GH_TextRenderingConstants.FarCenter
Gets the String format for Far (horizontal) Center (vertical) alignment.
Do not dispose or modify this StringFormat instance.

Grasshopper.GUI.GH_TextRenderingConstants.StringFormat(System.Drawing.StringAlignment,System.Drawing.StringAlignment)
Get a precooked StringFormat instance. Do not modify or dispose instances returned by this method.
The format uses NoWrap flags and EllipsisCharacter trimming.
horizontalAlignment: Alignment
verticalAlignment: Line alignment
Returns: