Grasshopper.Versioning
Static class that provides information regarding the Grasshopper versioning.

Grasshopper.Versioning.#ctor
This class only provids static (Shared in VB) methods and cannot be constructed.

Grasshopper.Versioning.Version
Gets the version of the current build of Grasshopper.

Grasshopper.Versioning.VersionString
Gets the version of the current build of Grasshopper.

Grasshopper.Versioning.BuildDate
Gets the build date string. This is the visible release iteration tag.
Typically the BuildDate is just the date (MMMM-dd, yyyy), but it may carry a prefix or suffix for special builds.

Grasshopper.Versioning.SyncVersionHistoryData
Attempts to download the version history information.
The downloaded data (if the download works) will eventually be stored at:
Grasshopper.Folders.VersionHistoryFile

Grasshopper.Versioning.VersionHistoryData
Gets the currently most up-to-date version history data.
Returns: The latest version history or null if no such record exists.