Grasshopper.Kernel.IGH_ValueProxy.ProxyType
Gets the System.Type description of the template type

Grasshopper.Kernel.IGH_ValueProxy.ProxyName
Gets a human-friendly name description of the template type

Grasshopper.Kernel.IGH_ValueProxy.ProxyValue
Gets an instance of the local template type object

Grasshopper.Kernel.IGH_ValueProxy.UserString
Gets or sets the user-defined string that describes this proxy
This only really makes sense if the Proxy is Parsable.
Returns: If the proxy contains no user-string, the ToString result is returned instead

Grasshopper.Kernel.IGH_ValueProxy.IsParsable
Gets a value indicating whether or not the type can be instantiated from a String

Grasshopper.Kernel.IGH_ValueProxy.IsValid
Gets a value indicating whether or not the current value is valid

Grasshopper.Kernel.IGH_ValueProxy.ToString
Returns a String description of the current value.
Remarks: If the implementation IsParsable(), then this representation must be in parsable format.

Grasshopper.Kernel.IGH_ValueProxy.FromString(System.String)
If IsParsable(), then attempts to convert the string to a generic type value
in: The String to parse
Returns: True on success, false on failure. This method should not throw exceptions.

Grasshopper.Kernel.IGH_ValueProxy.MutateString(System.String)
Munge a string to remove obvious errors on account of the user.
in:
Returns:

Grasshopper.Kernel.IGH_ValueProxy.Duplicate
Create an exact duplicate of the type.
Remarks: Implementors: Do not maintain references to class instances. Copy EVERYTHING.