Grasshopper.Kernel.GH_UserObject
Represents a custom user object. A User Object is an existing IGH_DocumentObject with
overridden icon, instance description and exposure.

Grasshopper.Kernel.GH_UserObject.#ctor
Empty constructor

Grasshopper.Kernel.GH_UserObject.#ctor(System.String)
Create a new user object from an existing *.ghuser file.
source_file: File that contains the User Object definition.

Grasshopper.Kernel.GH_UserObject.Path
Gets or sets the file path this User Object is loaded from or saved to.

Grasshopper.Kernel.GH_UserObject.Guid
Gets or sets the Guid of this User Object.
The Guid is created anew during construction and is
not stored in the User Object File.
You should never have to set this field.

Grasshopper.Kernel.GH_UserObject.BaseGuid
Gets or sets the ComponentID of the IGH_DocumentObject that
functions as the base class for this User Object.

Grasshopper.Kernel.GH_UserObject.Data
Gets or sets the serialized data. This data is used to deserialize a new instance
of the base class.

Grasshopper.Kernel.GH_UserObject.Icon
Gets or sets the icon associated with this User Object.
If the icon hasn't been overridden, then a Default icon is returned.

Grasshopper.Kernel.GH_UserObject.Exposure
Gets or sets the Exposure of this User Object.

Grasshopper.Kernel.GH_UserObject.Description
Gets or sets the Instance Description override for this User Object.

Grasshopper.Kernel.GH_UserObject.SetDataFromObject(Grasshopper.Kernel.IGH_DocumentObject)
Set the Data field content of ths UserObject from a Document object instance.
obj: Object to assign

Grasshopper.Kernel.GH_UserObject.CreateDefaultPath(System.Boolean)
Set the Path field for this user object to the default.
The default file name is derived from the Description.Name field.
This method also ensures the UserObject directory exists.
avoid_conflict: If true, a unique file path is assigned.

Grasshopper.Kernel.GH_UserObject.Clear
Destroy all data except the file path and the ID.

Grasshopper.Kernel.GH_UserObject.SaveToFile
Save the current User Object state to a file. Any existing file will be overwritten.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_UserObject.ReadFromFile
Force an update of the local data from the file.
The Path field must be set for this to work.
Throws System.InvalidOperationException: Thrown when the source file doesn't exist or is corrupted.

Grasshopper.Kernel.GH_UserObject.InstantiateObject
Instantiate a new IGH_DocumentObject from this User Object.
Returns: The IGH_DocumentObject instance defined inside the UserObject file or null on error.