Grasshopper.Kernel.Undo.GH_UndoAction
Base class implementation for undo actions.

Grasshopper.Kernel.Undo.GH_UndoAction.ExpiresDisplay
Override this property if you want the Rhino viewport display to refresh upon undo completion.

Grasshopper.Kernel.Undo.GH_UndoAction.ExpiresSolution
Override this property if you want the Grasshopper solution to refresh upon undo completion.