Grasshopper.Kernel.Types.GH_Centermark
Represents an implementation of a Rhino centermark.

Grasshopper.Kernel.Types.GH_Centermark.#ctor
Default constructor, creates an invalid centermark.

Grasshopper.Kernel.Types.GH_Centermark.#ctor(Rhino.Geometry.Centermark)
Create a duplicate of an existing centermark.
centermark: Centermark to duplicate

Grasshopper.Kernel.Types.GH_Centermark.#ctor(Rhino.Geometry.Centermark,Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle)
Create a duplicate of an existing centermark.
centermark: Centermark to duplicate
style: Annotation style to use

Grasshopper.Kernel.Types.GH_Centermark.#ctor(Grasshopper.Kernel.Types.GH_Centermark)
Create a duplicate of another GH_Centermark. This constructor also copies reference data.
other: GH_Centermark to duplicate

Grasshopper.Kernel.Types.GH_Centermark.#ctor(System.Guid)
Create a new referenced centermark that references a Rhino centermark with the specified ID.
ref_guid: ID of centermark object to reference.

Grasshopper.Kernel.Types.GH_Centermark.DuplicateAnnotation
Create a duplicate of this annotation.

Grasshopper.Kernel.Types.GH_Centermark.DuplicateCentermark
Create a duplicate of this centermark.

Grasshopper.Kernel.Types.GH_Centermark.ToString
Format the centermark using default grasshopper formatting logic.

Grasshopper.Kernel.Types.GH_Centermark.CastFrom(System.Object)
Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_Centermark.CastTo``1(``0@)
Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.