Grasshopper.GUI.HTML.GH_CssConstants
Provides default Grasshopper CSS styles.

Grasshopper.GUI.HTML.GH_CssConstants.ColourBackground
Gets or sets the page background colour.

Grasshopper.GUI.HTML.GH_CssConstants.ColourForeground
Gets or sets the page foreground colour.

Grasshopper.GUI.HTML.GH_CssConstants.ColourFakeFaint
Gets or sets the fake faint colour.

Grasshopper.GUI.HTML.GH_CssConstants.ColourChapterBackground
Gets or sets the background colour for Chapter blocks.

Grasshopper.GUI.HTML.GH_CssConstants.ColourSectionBackground
Gets or sets the background colour for Section blocks.

Grasshopper.GUI.HTML.GH_CssConstants.Default
Gets the default css background style.

Grasshopper.GUI.HTML.GH_CssConstants.Text
Defines default content text styling.

Grasshopper.GUI.HTML.GH_CssConstants.TextMonospace
Defines default content mono-spaced text styling.

Grasshopper.GUI.HTML.GH_CssConstants.TextFaint
Defines default faint content text styling.

Grasshopper.GUI.HTML.GH_CssConstants.TextFaintCheat
Defines default faint content text styling.

Grasshopper.GUI.HTML.GH_CssConstants.TextChapter
Defines default Chapter Header text styling.

Grasshopper.GUI.HTML.GH_CssConstants.TextSection
Defines default Section Header text styling.

Grasshopper.GUI.HTML.GH_CssConstants.TextParagraph
Defines default Paragraph Header text styling.

Grasshopper.GUI.HTML.GH_CssConstants.BlockContent
Defines default content block styling.

Grasshopper.GUI.HTML.GH_CssConstants.BlockChapter
Defines default Chapter Header block styling.

Grasshopper.GUI.HTML.GH_CssConstants.BlockSection
Defines default Section Header block styling.

Grasshopper.GUI.HTML.GH_CssConstants.BlockParagraph
Defines default Paragraph Header block styling.