Grasshopper.GUI.Base.GH_SliderAccuracy
Enumerates the possible numeric slider accuracies.

Grasshopper.GUI.Base.GH_SliderAccuracy.Float
Slider supports floating point accuracy.

Grasshopper.GUI.Base.GH_SliderAccuracy.Integer
Slider supports integer accuracy.

Grasshopper.GUI.Base.GH_SliderAccuracy.Even
Slider only supports even integers.

Grasshopper.GUI.Base.GH_SliderAccuracy.Odd
Slider only supports odd integers.