Grasshopper.GUI.Theme.GH_Theme.#ctor
Create a new default theme.

Grasshopper.GUI.Theme.GH_Theme.#ctor(Grasshopper.GUI.Theme.GH_Theme)
Make a duplicate of another theme.
other: Theme to copy.

Grasshopper.GUI.Theme.GH_Theme.BackGround
Gets the theme background settings.

Grasshopper.GUI.Theme.GH_Theme.Page
Gets the theme page and grid settings.

Grasshopper.GUI.Theme.GH_Theme.Wires
Gets the theme wire settings.

Grasshopper.GUI.Theme.GH_Theme.Objects
Gets the theme objects and ZUI settings.

Grasshopper.GUI.Theme.GH_Theme.Palettes
Gets the theme palette settings.

Grasshopper.GUI.Theme.GH_Theme.LoadTheme
Instantiate all palette and gui defaults.
This function reads the colour values out of grasshopper_gui.xml settings database if it exists.

Grasshopper.GUI.Theme.GH_Theme.SaveTheme
Store all palette and gui defaults.
This function writes the colour values out to grasshopper_gui.xml settings database.