Grasshopper.Kernel.IGH_PreviewMeshData
Implement this interface if your data deals with preview meshes.

Grasshopper.Kernel.IGH_PreviewMeshData.GetPreviewMeshes
Gets all the preview meshes associated with this data.
Returns: An array of meshes that represent the preview meshes of this data.

Grasshopper.Kernel.IGH_PreviewMeshData.DestroyPreviewMeshes
Erase all cached preview meshes.