Grasshopper.Kernel.GH_ObjectEventType
Represents common changes which can cause the ObjectChanged event to be raised.

Grasshopper.Kernel.GH_ObjectEventType.Unset
No type is specified.

Grasshopper.Kernel.GH_ObjectEventType.NickName
The NickName has been changed.

Grasshopper.Kernel.GH_ObjectEventType.NickNameAccepted
The nickname has been changed and the change was accepted. This event is only raised once per a NickName change process.

Grasshopper.Kernel.GH_ObjectEventType.Icon
The object icon has been changed.

Grasshopper.Kernel.GH_ObjectEventType.IconDisplayMode
The icon display mode of the object has been changed.

Grasshopper.Kernel.GH_ObjectEventType.Layout
The layout of the attributes has changed.
This usually happens when the pivot is moved, or when the object is resized,
but it can also be due to a change in the object structure.

Grasshopper.Kernel.GH_ObjectEventType.Sources
A source list of this object has been altered.

Grasshopper.Kernel.GH_ObjectEventType.Selected
The object selected state has been toggled.

Grasshopper.Kernel.GH_ObjectEventType.Enabled
The object enabled state has been toggled.

Grasshopper.Kernel.GH_ObjectEventType.Preview
The preview of this object has been toggled.

Grasshopper.Kernel.GH_ObjectEventType.PersistentData
The persistent data inside this object has been changed.

Grasshopper.Kernel.GH_ObjectEventType.DataMatching
The Data matching settings of this object have been changed.

Grasshopper.Kernel.GH_ObjectEventType.DataMapping
The Data mapping settings of this object have been changed.

Grasshopper.Kernel.GH_ObjectEventType.Options
Custom options of this object have been changed.

Grasshopper.Kernel.GH_ObjectEventType.Custom
A non-standard change occured. See the Custom property on the
GH_ObjectChangedEventArgs for further details.