Grasshopper.Documentation.GH_Text
Represents a single string.

Grasshopper.Documentation.GH_Text.Create(System.String)
Create a new instance of GH_Text.
text: Text to wrap.

Grasshopper.Documentation.GH_Text.Text
Gets the text string.