Grasshopper.Kernel.GH_Component
Inherit from this class if you wish to create a custom component.
Note that you must provide a public, empty constructor which
calls the base class constructor.

Grasshopper.Kernel.GH_Component.m_paramServer
Parameter server for this Component.

Grasshopper.Kernel.GH_Component.#ctor
Custom blank constructor for naughty components.

Grasshopper.Kernel.GH_Component.#ctor(System.String,System.String,System.String,System.String,System.String)
Constructor for this component. This function will call the PostConstructor which will initialize the parameters
name: The name of this component. Keep it short, single words are best.
nickname: The abbreviation of this component. Keep it short, 1~5 character words are best.
description: The description of this component. Be succinct but clear. You can supply whole sentences.
category: The category of this component. The category controls in which tab the component will end up.
subCategory: the SubCategory for this component. The SubCategory controls in which panel the component will end up.

Grasshopper.Kernel.GH_Component.PostConstructor
The PostConstructor is called from within each constructor.
DO NOT OVERRIDE THIS unless you know what you are doing.

Grasshopper.Kernel.GH_Component.InConstructor
Gets the constructor flag for this instance. If InConstructor = True,
it means the component is still registering parameters and the
layout is not yet complete.

Grasshopper.Kernel.GH_Component.CreateAttributes
Create new attributes.
Remarks: Typically you do not have to override this.

Grasshopper.Kernel.GH_Component.AssignInitCodeToInputParameter(System.Int32,System.String)
Utility function for parsing and assigning init codes. This only works for standard parameter types.
paramIndex: Index of input parameter to assign.
code: Code to parse and assign.
Returns: True if the code was assigned, false if otherwise.

Grasshopper.Kernel.GH_Component.Params
Gets the parameter manager object for this component.

Grasshopper.Kernel.GH_Component.RegisterInputParams(Grasshopper.Kernel.GH_Component.GH_InputParamManager)
Declare all your input parameters here.
pManager: Use the pManager to register new parameters. pManager is never null.

Grasshopper.Kernel.GH_Component.RegisterOutputParams(Grasshopper.Kernel.GH_Component.GH_OutputParamManager)
Declare all your output parameters here.
pManager: Use the pManager to register new parameters. pManager is never null.

Grasshopper.Kernel.GH_Component.IsolateObject
Sever the connections of all input and output parameters.

Grasshopper.Kernel.GH_Component.ClearRuntimeMessages
Clears all runtime messages in me and my parameters

Grasshopper.Kernel.GH_Component.RuntimeMessageLevel
Returns the worst case runtime warning level of me and all my parameters

Grasshopper.Kernel.GH_Component.RuntimeMessages(Grasshopper.Kernel.GH_RuntimeMessageLevel)
Gets the list of cached runtime messages that were recorded during solver-time processes.
For components, the set of runtime messages also includes input and output parameters.
level: Runtime message type to retrieve.
Returns: A list of runtime message strings.

Grasshopper.Kernel.GH_Component.IsDataProvider
Components are never Data providers. Only the output parameters can be considered to be providers.

Grasshopper.Kernel.GH_Component.DependsOn(Grasshopper.Kernel.IGH_ActiveObject)
Returns True is any one of my input parameters depends on the source.
potentialSource: Source to test for dependency.

Grasshopper.Kernel.GH_Component.AddedToDocument(Grasshopper.Kernel.GH_Document)
Overrides the AddedToDocument method and delegates the call to all parameters.
document: Document that now owns this object.

Grasshopper.Kernel.GH_Component.RemovedFromDocument(Grasshopper.Kernel.GH_Document)
Overrides the RemovedFromDocument method and delegates the call to all parameters.
document: Document that now no longer owns this object.

Grasshopper.Kernel.GH_Component.MovedBetweenDocuments(Grasshopper.Kernel.GH_Document,Grasshopper.Kernel.GH_Document)
Overrides the MovedBetweenDocuments method and delegates the call to all parameters.
oldDocument: Document that used to own this object.
newDocument: Document that now owns ths object.

Grasshopper.Kernel.GH_Component.DocumentContextChanged(Grasshopper.Kernel.GH_Document,Grasshopper.Kernel.GH_DocumentContext)
Overrides the DocumentContextChanged method and delegates the call to all parameters.
document: Document that owns this object.
context: The reason for this event.

Grasshopper.Kernel.GH_Component.RegisterRemoteIDs(Grasshopper.Kernel.GH_GuidTable)
Registers all my input parameters with the UUID_LookUpTable
table:

Grasshopper.Kernel.GH_Component.Message
Gets or sets a custom message to be displayed underneath the component.
This message is not serialized and should be assigned on every solution anew.

Grasshopper.Kernel.GH_Component.AppendAdditionalMenuItems(System.Windows.Forms.ToolStripDropDown)
Adds typical component type items to the context menu:
1. Data comparison types
2. Custom (overridden) items
3. Nested input parameter context menu items
4. Nested output parameter context menu items
menu:

Grasshopper.Kernel.GH_Component.AppendAdditionalComponentMenuItems(System.Windows.Forms.ToolStripDropDown)
Override this function if you want to insert some custom menu items in your derived Component class.
Items will be added between List Matching items and parameter menus.

Grasshopper.Kernel.GH_Component.HtmlHelp_Source
Return a String which contains HTML formatted source for the help topic.
If you want to pass a URL that points to a remote page, then prefix the URL with a GOTO: tag, like so:
GOTO:http://www.YourWebAddressHere.com
Returns: The HTML default help topic for this component including all parameters
Remarks: You can use the GUI.GH_HtmlFormatter class to generate an HTML page which conforms to Grasshopper Help standards

Grasshopper.Kernel.GH_Component.HelpDescription
Override this method if you want the help topic content to be more than the Component description.

Grasshopper.Kernel.GH_Component.GenerateDefaultHTML
Creates the default component help topic, including all parameter lists.
Remarks: This formatter does not include the this-is-an-autogenerated-topic message

Grasshopper.Kernel.GH_Component.GenerateParameterHelp
Create an HTML string that lists names and descriptions for input and output parameters.

Grasshopper.Kernel.GH_Component.GenerateParameterHelp(Grasshopper.Kernel.IGH_Param)
Generate HTML string for a single parameter.

Grasshopper.Kernel.GH_Component.DataComparison
Gets or sets the data matching algorithm for this component

Grasshopper.Kernel.GH_Component.RunCount
Gets a value indicating how many times the SolveInstance method was called on this component during the last solution.
This property will return -1 if no valid runcount is available.

Grasshopper.Kernel.GH_Component.PrincipalParameterIndex
Gets or sets the principal parameter index override.
Negative indices or indices larger than or equal to the input parameter count will
be ignored and regular principal parameter detection will kick in.

Grasshopper.Kernel.GH_Component.IsValidPrincipalParameterIndex
Gets whether the MasterParameterIndex property identifies a valid parameter.

Grasshopper.Kernel.GH_Component.Locked
Gets or sets the Locked state for this Component.
This also sets locked states for all input and output parameters.

Grasshopper.Kernel.GH_Component.ProcessorTime
Gets the total processor time (profiler) spend by this component and all input parameters.

Grasshopper.Kernel.GH_Component.ExpireDownStreamObjects
Expire all objects that depend on any of the output parameters.

Grasshopper.Kernel.GH_Component.ClearData
Clear the data inside this component and all output parameters.

Grasshopper.Kernel.GH_Component.CollectData
Calls CollectData on all input parameters and makes sure the
Component and all associated parameters are left in a valid state.

Grasshopper.Kernel.GH_Component.ComputeData
Compute all data and fill out all output parameters.

Grasshopper.Kernel.GH_Component.SolveInstance(Grasshopper.Kernel.IGH_DataAccess)
This function will be called (successively) from within the
ComputeData method of this component.
DA: Data Access object. Use this object to retrieve data
from input parameters and assign data to output parameters.

Grasshopper.Kernel.GH_Component.BeforeSolveInstance
Override this method if you want to be called
before the first call to SolveInstance.

Grasshopper.Kernel.GH_Component.AfterSolveInstance
Override this method if you want to be called
after the last call to SolveInstance.

Grasshopper.Kernel.GH_Component.DocumentTolerance
Gets the Absolute tolerance for the currently active Rhino document.

Grasshopper.Kernel.GH_Component.DocumentAngleTolerance
Gets the Angle tolerance (in radians) for the currently active Rhino document.

Grasshopper.Kernel.GH_Component.Hidden
Gets or sets the hidden flag for this component.
Does not affect Hidden flags on parameters associated
with this component.

Grasshopper.Kernel.GH_Component.IsPreviewCapable
If a single parameter is PreviewCapable, so is the component.
Override this property if you need special Preview flags.

Grasshopper.Kernel.GH_Component.ClippingBox
Gets the clipping box for all preview geometry drawn by this component
and all associated parameters.

Grasshopper.Kernel.GH_Component.DrawViewportMeshes(Grasshopper.Kernel.IGH_PreviewArgs)
Draw preview meshes for this component and all associated parameters.
args: Display data used during preview drawing.

Grasshopper.Kernel.GH_Component.DrawViewportWires(Grasshopper.Kernel.IGH_PreviewArgs)
Draw preview wires for this component and all associated parameters.
args: Display data used during preview drawing.

Grasshopper.Kernel.GH_Component.IsRenderPreviewCapable
If a single parameter is RenderPreviewCapable, so is the component.
Override this property if you need special Preview flags.
Since: 8.0

Grasshopper.Kernel.GH_Component.AppendRenderGeometry(Grasshopper.Kernel.GH_RenderArgs)
Append all geometry associated with this component to a render queue.

Grasshopper.Kernel.GH_Component.Write(GH_IO.Serialization.GH_IWriter)
Write all required data for deserialization to an IO archive.
writer: Object to write with.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Component.Read(GH_IO.Serialization.GH_IReader)
Read all required data for deserialization from an IO archive.
reader: Object to read with.
Returns: True on success, false on failure.