Grasshopper.Kernel.Special.GH_ClusterFileType
Enumerates the possible cluster reference file types.

Grasshopper.Kernel.Special.GH_ClusterFileType.None
Indicates no reference file is defined.

Grasshopper.Kernel.Special.GH_ClusterFileType.Gh
Indicates a GH (binary) file is referenced.

Grasshopper.Kernel.Special.GH_ClusterFileType.Ghx
Indicates a GHX (Xml) file is referenced.

Grasshopper.Kernel.Special.GH_ClusterFileType.GhCluster
Indicates a GHCLUSTER file is referenced.

Grasshopper.Kernel.Special.GH_ClusterFileType.Unknown
Indicates a file of unknown type is referenced.