Grasshopper.GUI.StringDisplay.GH_StringList`1.RenderItem
Delegate function that will be called during item rendering.
item: The item currently being rendered.
destination: The destination formatting rectangle in Graphics coordinates.