Grasshopper.GUI.GH_StandardIcons
Provides access to a set of standard icons.

Grasshopper.GUI.GH_StandardIcons.#ctor
This class only exposes static methods and cannot be constructed.

Grasshopper.GUI.GH_StandardIcons.UnknownObjectIcon_24x24
Gets the icon used for objects that do not have their own icon
and unknown objects.

Grasshopper.GUI.GH_StandardIcons.BlankParameterIcon_24x24
Gets the base icon for parameters; an empty black hexagon.

Grasshopper.GUI.GH_StandardIcons.BlankObjectIcon_24x24
Gets the base icon for objects; an empty white square.

Grasshopper.GUI.GH_StandardIcons.UserObjectIcon_24x24
Gets the icon used for user objects.

Grasshopper.GUI.GH_StandardIcons.ClusterIcon_24x24
Gets the icon used for clusters.

Grasshopper.GUI.GH_StandardIcons.GroupIcon_24x24
Gets the icon used for canvas groups.

Grasshopper.GUI.GH_StandardIcons.FlattenIcon_24x24
Gets the trunk icon used to indicate flattening.

Grasshopper.GUI.GH_StandardIcons.GraftIcon_24x24
Gets the twig icon used to indicate grafting.

Grasshopper.GUI.GH_StandardIcons.FileIconGH_32x36
Gets the file icon used for Grasshopper Binary files.

Grasshopper.GUI.GH_StandardIcons.FileIconGHMissing_32x36
Gets the file icon used for missing Grasshopper Binary files.

Grasshopper.GUI.GH_StandardIcons.FileIconGHX_32x36
Gets the file icon used for Grasshopper Xml files.

Grasshopper.GUI.GH_StandardIcons.FileIconGHXMissing_32x36
Gets the file icon used for missing Grasshopper Xml files.

Grasshopper.GUI.GH_StandardIcons.FileIconDll_32x32
Gets the file icon used for Dll files.

Grasshopper.GUI.GH_StandardIcons.FileIconExe_32x32
Gets the file icon used for Exe files.

Grasshopper.GUI.GH_StandardIcons.FileIconGha_32x32
Gets the file icon used for Gha files.

Grasshopper.GUI.GH_StandardIcons.FileIconRhp_32x32
Gets the file icon used for Rhp files.