Grasshopper.Kernel.GH_RenderArgs
This class is passed to objects that implement IGH_RenderAwareData or IGH_RenderAwareObject during render queue operations.

Grasshopper.Kernel.GH_RenderArgs.#ctor(Grasshopper.Kernel.GH_RenderPipeline)
Create new render arguments.
pipeline: Render pipeline .
Since: 8.0

Grasshopper.Kernel.GH_RenderArgs.#ctor(Rhino.RhinoDoc,Rhino.DocObjects.ViewportInfo,Rhino.Render.RenderPrimitiveList,System.Guid,Rhino.Render.RenderMaterial,Rhino.Render.RenderMaterial)
Create new render arguments.
doc: Rhino document.
vp: Viewport.
geometry: Geometry list.
id: Render plugin id.
matNormal: Material for unselected objects.
matSelected: Material for selected objects.

Grasshopper.Kernel.GH_RenderArgs.#ctor(Rhino.RhinoDoc,Rhino.DocObjects.ViewportInfo,Rhino.Render.RenderPrimitiveList,System.Guid,System.Collections.Generic.Dictionary{System.Int32,Rhino.Render.RenderMaterial})
Create new render arguments.
doc: Rhino document.
vp: Viewport.
geometry: Geometry list.
id: Render plugin id.
materialCache: Material cache - can be Nothing.

Grasshopper.Kernel.GH_RenderArgs.Document
Gets the rhino document from whence the render originated.

Grasshopper.Kernel.GH_RenderArgs.Viewport
Gets the viewport details involved in this rendering.

Grasshopper.Kernel.GH_RenderArgs.ViewportName
Gets the viewport name involved in this rendering.
Since: 8.0

Grasshopper.Kernel.GH_RenderArgs.PipelineAttributes
Gets the viewport details involved in this rendering.
Since: 8.0

Grasshopper.Kernel.GH_RenderArgs.PluginId
Gets the render plugin id that is about to render this geometry.

Grasshopper.Kernel.GH_RenderArgs.ModelTransform
Gets the current model transform.
Since: 8.0

Grasshopper.Kernel.GH_RenderArgs.Geomety
Gets the geometry primitive list to append to.

Grasshopper.Kernel.GH_RenderArgs.MaterialCache
Gets the material cache.

Grasshopper.Kernel.GH_RenderArgs.MaterialNormal
Gets the material hint to use for unselected objects.

Grasshopper.Kernel.GH_RenderArgs.MaterialSelected
Gets the material hint to use for selected objects.