Grasshopper.Kernel.Data.GH_IndexRuleSet
A collection of index rules.

Grasshopper.Kernel.Data.GH_IndexRuleSet.#ctor
Blank constructor. Creates an empty collection of rules.

Grasshopper.Kernel.Data.GH_IndexRuleSet.Count
Gets the number of rules defined in this collection.

Grasshopper.Kernel.Data.GH_IndexRuleSet.Rule(System.Int32)
Gets the rule at the specified index.

Grasshopper.Kernel.Data.GH_IndexRuleSet.AddDigitRule(System.Int32,System.Boolean)
Append a single digit rule.
digit: Digit to filter.
invert: If true, the digit will be filtered against rather than for.

Grasshopper.Kernel.Data.GH_IndexRuleSet.AddRangeRule(Grasshopper.Kernel.Data.GH_IndexRange,System.Boolean)
Append a single range rule.
range: Range to filter.
invert: If true, the range will be filtered against rather than for.

Grasshopper.Kernel.Data.GH_IndexRuleSet.AddAnyDigitRule
Append a rule for any single digit.

Grasshopper.Kernel.Data.GH_IndexRuleSet.AddAnyDigitsRule
Append a rule for any amount of digits.

Grasshopper.Kernel.Data.GH_IndexRuleSet.AddDigitPatternRule(System.Int32,System.Int32)
Append a rule for filtering digit patterns. This pattern does not have an upper bound.
firstDigit: First digit in pattern.
nextDigit: Next digit in pattern.

Grasshopper.Kernel.Data.GH_IndexRuleSet.AddDigitPatternRule(System.Int32,System.Int32,System.Int32)
Append a rule for filtering digit patterns.
firstDigit: First digit in pattern.
nextDigit: Next digit in pattern.
lastDigit: Last digit in pattern.

Grasshopper.Kernel.Data.GH_IndexRuleSet.AddDigitPatternRule(System.Int32[])
Append a rule for filtering digit patterns.
pattern: Complete pattern. A complete pattern consists of at least three integers,
the first one signifying the pattern lower bound, the last one signifying the patters upper bound
(use Int32.MaxValue is you do not want to enforce an upper bound), and at least one integer in between
defining the pattern growth.

Grasshopper.Kernel.Data.GH_IndexRuleSet.AddRangePatternRule(Grasshopper.Kernel.Data.GH_IndexRange[])
Append a rule for filtering range patterns.
pattern: Complete pattern. A complete pattern consists of at least three ranges,
the first one signifying the pattern lower bound, the last one signifying the patters upper bound
(use GH_IndexRange.MaxValue is you do not want to enforce an upper bound), and at least one range in between
defining the pattern growth.

Grasshopper.Kernel.Data.GH_IndexRuleSet.Evaluate(System.Int32)
Evaluate the index given the local rules.
index: Index to evaluate.
Returns: The result of the evaluation.