Grasshopper.GUI.Ribbon.GH_Ribbon


Grasshopper.GUI.Ribbon.GH_Ribbon.ActiveTabIndex
Gets or sets the current tab index.
Returns: The index of the first active tab or -1 if no active tab can be found
Remarks: Invalid indices will result in exceptions

Grasshopper.GUI.Ribbon.GH_Ribbon.ActiveTabName
Gets or sets the active tab by name.

Grasshopper.GUI.Ribbon.GH_Ribbon.ActiveTab
Getsor sets the first active tab or Null is no active tab is defined

Grasshopper.GUI.Ribbon.GH_Ribbon.Tabs
Gets the tabs collection.
Remarks: Do not modify this collection, use AddTab, RemoveTab... methods instead

Grasshopper.GUI.Ribbon.GH_Ribbon.EnsureTab(System.String)
Gets a tab with a similar name or adds a new tab.

Grasshopper.GUI.Ribbon.GH_Ribbon.PopulateRibbon
Populate the entire Ribbon control from scratch. Call this function when you make a change to
the state of the component library or ribbon layouts.

Grasshopper.GUI.Ribbon.GH_Ribbon.ActiveObject
Gets or sets the Active object. The active object can be any class which implements the IGH_RibbonInteractiveObject interface.
Under normal circumstances it will most likely be a RibbonItem or a class derived from RibbonItem.

Grasshopper.GUI.Ribbon.GH_Ribbon.FindAndDisplayProxy(System.Guid,System.Drawing.Rectangle@,System.Drawing.Rectangle@,Grasshopper.GUI.Ribbon.GH_RibbonDropdown@)
Iterates over all tabs and panels to try and find the icon with
the associated proxy id.
id: ID of proxy to search for.
tabBox: The tab rectangle (in screen space).
iconbox: The icon rectangle (in screen space).
dropdown: The dropdown window if shown.
Returns: Rectangle of proxy icon or Rectangle.Empty if the icon could not be found.
Rectangle is defined in screen coordinates, not control coordinates.