Grasshopper.Kernel.IGH_BakeAwareObject
Implement this interface on your IGH_ActiveObject if you want to participate
in the Bake GUI.

Grasshopper.Kernel.IGH_BakeAwareObject.IsBakeCapable
Gets a value indicating whether or not the object can potentially Bake
data in its current state.

Grasshopper.Kernel.IGH_BakeAwareObject.BakeGeometry(Rhino.RhinoDoc,System.Collections.Generic.List{System.Guid})
Bake all the goemetry in this object in the given Rhino document.
doc: Document to bake into.
obj_ids: All bake objects IDs will be appended to this list.

Grasshopper.Kernel.IGH_BakeAwareObject.BakeGeometry(Rhino.RhinoDoc,Rhino.DocObjects.ObjectAttributes,System.Collections.Generic.List{System.Guid})
Bake all the goemetry in this object in the given Rhino document.
doc: Document to bake into.
att: Attributes to use for baked geometry.
obj_ids: All bake objects IDs will be appended to this list.