Grasshopper.Kernel.Geometry.Voronoi.Cell3
Represents a single 3D voronoi cell.

Grasshopper.Kernel.Geometry.Voronoi.Cell3.Facets
Gets the facets of this cell. Do not modify this list or you'll make the cell invalid.

Grasshopper.Kernel.Geometry.Voronoi.Cell3.BoundaryCount
Gets how many of the facets of this cell are part of the original boundary.

Grasshopper.Kernel.Geometry.Voronoi.Cell3.Center
Gets the center of this cell.

Grasshopper.Kernel.Geometry.Voronoi.Cell3.Tolerance
Gets or sets the tolerance for this cell.

Grasshopper.Kernel.Geometry.Voronoi.Cell3.MidPlane(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Compute the mid-plane between two points.
Points must not be coincident.
A: First point (below the plane)
B: Second point (above the plane)
Returns: Midplane.

Grasshopper.Kernel.Geometry.Voronoi.Cell3.Slice(Rhino.Geometry.Point3d)
Slice this cell using a neighbouring point.
pt: Neighbouring point.

Grasshopper.Kernel.Geometry.Voronoi.Cell3.Slice(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Slice this cell using a collection of neighbouring points.
pt: Neighbouring point.

Grasshopper.Kernel.Geometry.Voronoi.Cell3.Slice(Rhino.Geometry.Point3d[])
Slice this cell using a collection of neighbouring points.
pt: Neighbouring point.

Grasshopper.Kernel.Geometry.Voronoi.Cell3.Slice(Rhino.Geometry.Plane)
Slice this cell with a plane. Everything underneath the section XY plane will be discarded.
section: Slicing section.

Grasshopper.Kernel.Geometry.Voronoi.Cell3.SliceFacet(Grasshopper.Kernel.Geometry.Voronoi.Cell3Facet,Rhino.Geometry.Plane,System.Collections.Generic.List{Rhino.Geometry.Line})
Slice a single facet. If the facet disappears or becomes invalid, False will be returned.

Grasshopper.Kernel.Geometry.Voronoi.Cell3.ToBrep
Convert the cell to a closed brep.