Grasshopper.Kernel.Graphs.GH_AbstractGraph


Grasshopper.Kernel.Graphs.GH_AbstractGraph.CreateDerivedDuplicate
Implement this function and return an instance of yourself with all specific values copied.
All properties in the GH_AbstractGraph class are copied by the GH_AbstractGraph.
Remarks: If you don't want to use the base class copy-logic. Override Duplicate() instead.

Grasshopper.Kernel.Graphs.GH_AbstractGraph.PrepareForUse
This function is called when the graph is about to be used for the first time,
maybe more often. You're supposed to reset all defaults. By default, this function
calls ClearGrips(), CreateGrips() and UpdateEquation()

Grasshopper.Kernel.Graphs.GH_AbstractGraph.EmitProxyObject
Override this function if you want to be able to edit the graph through a PropertyGrid.

Grasshopper.Kernel.Graphs.GH_AbstractGraph.ValueAt(System.Double)
This function supplies evaluation logic for the unit domains
t: parameter in unit domain to evaluate

Grasshopper.Kernel.Graphs.GH_AbstractGraph.IntersectionEvaluate(Rhino.Geometry.Curve,System.Double)
Evaluates a curve by intersecting it with a vertical line at t
C: Curve to evaluate. Curve physical domain has to be between 0.0 and 1.0.
offset: value to evaluate at.

Grasshopper.Kernel.Graphs.GH_AbstractGraph.UpdateEquation
This function is usually called after a grip change.
This is where you re-evaluate your equation constants based on grip locations.

Grasshopper.Kernel.Graphs.GH_AbstractGraph.Grips
Gets the grip collection, you'd be wise not to modify the collection.
If you want to add or remove grips, use the AddGrip() and ClearGrips() methods instead.

Grasshopper.Kernel.Graphs.GH_AbstractGraph.CreateGrips
Override this function if your Graph supports grip controls
Remarks:

Grasshopper.Kernel.Graphs.GH_AbstractGraph.Internal_GripChanged(Grasshopper.Kernel.Graphs.GH_GraphGrip,System.Boolean)
By default, the grip is clamped to the unit domain and UpdateEquation is called.
If you want to alter this behaviour, override this function.