Grasshopper.Kernel.Special.GH_TimerAttributes


Grasshopper.Kernel.Special.GH_TimerAttributes.RenderTimerConnection(System.Drawing.Graphics,System.Drawing.PointF,System.Drawing.RectangleF,System.Drawing.Color,System.Boolean)
Render a timer expiration connection
g: Graphics object to draw with.
anchor: Point to draw from, this is usually the timer arrow tip.
box: Box to draw to.