Grasshopper.Global_Proc


Grasshopper.Global_Proc.UiAdjust(System.Int32)
Adjust an integer value based on the system wide UI scale factor.
value: Value to adjust.
Returns: Adjusted value.

Grasshopper.Global_Proc.UiAdjust(System.Single)
Adjust an integer value based on the system wide UI scale factor.
value: Value to adjust.
Returns: Adjusted value.