Grasshopper.GUI.GH_NumberPresets
Maintains a collection of presets for use in numeric GUI.

Grasshopper.GUI.GH_NumberPresets.Count
Gets the number of presets stored in this class.

Grasshopper.GUI.GH_NumberPresets.PresetValue(System.Int32)
Gets the preset at the given index.
index: Index of preset to retrieve.
Returns: Value of preset.

Grasshopper.GUI.GH_NumberPresets.PresetName(System.Int32)
Gets the preset name at the given index.
index: Index of preset to retrieve.
Returns: Name of preset.

Grasshopper.GUI.GH_NumberPresets.PresetDescription(System.Int32)
Gets the preset description at the given index.
index: Index of preset to retrieve.
Returns: Description of preset.

Grasshopper.GUI.GH_NumberPresets.AddPreset(System.String,System.Double)
Add a new preset to the collection.
name: Name of preset.
value: Value of preset.

Grasshopper.GUI.GH_NumberPresets.AddPreset(System.String,System.Double,System.String)
Add a new preset to the collection.
name: Name of preset.
value: Value of preset.
description: Description of preset.

Grasshopper.GUI.GH_NumberPresets.AddPreset(System.String,System.Decimal)
Add a new preset to the collection.
name: Name of preset.
value: Value of preset.

Grasshopper.GUI.GH_NumberPresets.AddPreset(System.String,System.Decimal,System.String)
Add a new preset to the collection.
name: Name of preset.
value: Value of preset.
description: Description of preset.

Grasshopper.GUI.GH_NumberPresets.PopulateMenu(System.Windows.Forms.ToolStrip,System.Decimal,System.EventHandler)
Populate a menu with the presets.
Preset values will be stored as Decimals in the Tag of the menu items.
menu: Menu to append to.
current: Current value (will be checked)
clickDelegate: Event handler for all menu items.

Grasshopper.GUI.GH_NumberPresets.PopulateMenu(System.Windows.Forms.ToolStrip,System.Decimal,System.String,System.EventHandler)
Populate a menu with the presets.
Preset values will be stored as Decimals in the Tag of the menu items.
menu: Menu to append to.
current: Current value (will be checked)
format: String format for menu item text.
The Name field will be stored under {0} and the value field under {1}.
clickDelegate: Event handler for all menu items.