Grasshopper.Kernel.Types.GH_RadialDimension
Represents an implementation of a Rhino radial dimension.

Grasshopper.Kernel.Types.GH_RadialDimension.#ctor
Default constructor, creates an invalid radial dimension.

Grasshopper.Kernel.Types.GH_RadialDimension.#ctor(Rhino.Geometry.RadialDimension)
Create a duplicate of an existing radial dimension.
dimension: Radial dimension to duplicate

Grasshopper.Kernel.Types.GH_RadialDimension.#ctor(Rhino.Geometry.RadialDimension,Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle)
Create a duplicate of an existing radial dimension.
dimension: Radial dimension to duplicate
style: Annotation style to use

Grasshopper.Kernel.Types.GH_RadialDimension.#ctor(Grasshopper.Kernel.Types.GH_RadialDimension)
Create a duplicate of another GH_RadialDimension. This constructor also copies reference data.
other: GH_RadialDimension to duplicate

Grasshopper.Kernel.Types.GH_RadialDimension.#ctor(System.Guid)
Create a new referenced radial dimension that references a Rhino dimension with the specified ID.
ref_guid: ID of dimension object to reference.

Grasshopper.Kernel.Types.GH_RadialDimension.DuplicateAnnotation
Create a duplicate of this annotation.

Grasshopper.Kernel.Types.GH_RadialDimension.DuplicateRadialDimension
Create a duplicate of this radial dimension.

Grasshopper.Kernel.Types.GH_RadialDimension.ToString
Format the dimension using default grasshopper formatting logic.

Grasshopper.Kernel.Types.GH_RadialDimension.CastFrom(System.Object)
Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_RadialDimension.CastTo``1(``0@)
Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.