Grasshopper.Kernel.Types.IGH_GeometricGooWithObjRef
Allows for improved tracking of referenced geometry. Note that this is
an internal interface and not part of the public SDK

Grasshopper.Kernel.Types.IGH_GeometricGooWithObjRef.GetObjRef
Get an ObjRef for this IGH_GeometryicGoo
Returns: