Grasshopper.GUI.GH_MaterialPreviewControl
Offers a frontend for Grasshopper Material previews.

Grasshopper.GUI.GH_MaterialPreviewControl.SelectOnClick
Gets or sets whether this control can be selected.

Grasshopper.GUI.GH_MaterialPreviewControl.Selected
Gets or sets the Selected state of this preview. Selected previews have thick borders drawn around them.

Grasshopper.GUI.GH_MaterialPreviewControl.Colour
Gets or sets the colour of this preview.