Grasshopper.Kernel.GH_ParamKind
Enumerates the different guises of parameter

Grasshopper.Kernel.GH_ParamKind.unknown
Unknown, when this happens, something went wrong. Most likely it is due to
someone deriving from GH_Param and not setting the kind.

Grasshopper.Kernel.GH_ParamKind.floating
Parameter is top-level.

Grasshopper.Kernel.GH_ParamKind.input
Parameter is tied to an owner component as an input.

Grasshopper.Kernel.GH_ParamKind.output
Parameter is tied to an owner component as an output.