Grasshopper.Kernel.GH_PreviewMode
Lists all possible Grasshopper preview modes.

Grasshopper.Kernel.GH_PreviewMode.Disabled
Preview is not drawn in the Rhino viewports.

Grasshopper.Kernel.GH_PreviewMode.Wireframe
Only wireframe preview is drawn in the Rhino Viewports.

Grasshopper.Kernel.GH_PreviewMode.Shaded
Wireframe and shaded previews are drawn in the Rhino Viewports.