Grasshopper.Kernel.Special.GH_Cluster_OBSOLETE
The Grasshopper Cluster object.

Grasshopper.Kernel.Special.GH_Cluster_OBSOLETE.m_doc
Local cluster document.

Grasshopper.Kernel.Special.GH_Cluster_OBSOLETE.m_input_ids
For every input parameter, we maintain a target ID
of a cluster input gateway inside m_doc.

Grasshopper.Kernel.Special.GH_Cluster_OBSOLETE.m_output_ids
For every output parameter, we maintain a target ID
of a cluster output gateway inside m_doc.

Grasshopper.Kernel.Special.GH_Cluster_OBSOLETE.InternalDocument
Gets the internal document for this cluster. Document might be null.

Grasshopper.Kernel.Special.GH_Cluster_OBSOLETE.AuthorName
Gets or sets the Author Name field for this cluster.

Grasshopper.Kernel.Special.GH_Cluster_OBSOLETE.AuthorCompany
Gets or sets the Author Company field for this cluster.

Grasshopper.Kernel.Special.GH_Cluster_OBSOLETE.AuthorContact
Gets or sets the Author Contact field for this cluster.

Grasshopper.Kernel.Special.GH_Cluster_OBSOLETE.AuthorCopyright
Gets or sets the Author Copyright field for this cluster.

Grasshopper.Kernel.Special.GH_Cluster_OBSOLETE.WipeParameterCaches
Destroy all parameters and all parameter id references.
Remarks:

Grasshopper.Kernel.Special.GH_Cluster_OBSOLETE.CreateFromDocument(Grasshopper.Kernel.GH_Document)
Create a cluster from an entire document.
doc: Document to wrap. The document will not be copied,
so be sure you supply a fresh one.
Returns: True on success, false on failure.

Grasshopper.Kernel.Special.GH_Cluster_OBSOLETE.CreateFromSelection(Grasshopper.Kernel.GH_Document)
Create a cluster from the selected portion of a document.
doc: Document to harvest selection from. This document will not be touched.
Returns: True on success, false on failure.

Grasshopper.Kernel.Special.GH_Cluster_OBSOLETE.CreateAllInputs
Parse all Cluster Param objects.

Grasshopper.Kernel.Special.GH_Cluster_OBSOLETE.CreateAllInputs(Grasshopper.Kernel.GH_Document,Grasshopper.Kernel.GH_Document,Grasshopper.Kernel.GH_ConnectivityDisparity)
Parse all Cluster Param objects and external connections.

Grasshopper.Kernel.Special.GH_Cluster_OBSOLETE.CreateInput(Grasshopper.Kernel.Special.GH_ClusterInputHook,System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_Param})
Convert a gateway and a collection of sources into a Cluster input.

Grasshopper.Kernel.Special.GH_Cluster_OBSOLETE.CreateAllOutputs
Parse all Cluster Param objects.

Grasshopper.Kernel.Special.GH_Cluster_OBSOLETE.CreateAllOutputs(Grasshopper.Kernel.GH_Document,Grasshopper.Kernel.GH_Document,Grasshopper.Kernel.GH_ConnectivityDisparity)
Parse all Cluster Param objects and external connections.

Grasshopper.Kernel.Special.GH_Cluster_OBSOLETE.CreateOutput(Grasshopper.Kernel.Special.GH_ClusterOutputHook,System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_Param})
Convert a gateway and a collection of recipients to a cluster output.

Grasshopper.Kernel.Special.GH_Cluster_OBSOLETE.SharedTypeIDs(System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_Param})
Tests whether all the parameters in a list are of the same type.
params: Parameters to compare.
Returns: The typeid if all parameters have the same type or Guid.Empty if they do not.

Grasshopper.Kernel.Special.GH_Cluster_OBSOLETE.SortParameters
Sort all parameters using the Cluster Hook Y order.

Grasshopper.Kernel.Special.GH_Cluster_OBSOLETE.DocumentClosed(Grasshopper.Kernel.GH_Document)


Grasshopper.Kernel.Special.GH_Cluster_OBSOLETE.DocumentModified(Grasshopper.Kernel.GH_Document)


Grasshopper.Kernel.Special.GH_Cluster_OBSOLETE.OwnerDocument
