Grasshopper.Kernel.GH_MathUtil


Grasshopper.Kernel.GH_MathUtil.WrapInteger(System.Int32,System.Int32)
Make sure a value is within the 0~upper domain.
Works like MOD except it performs ok on negative values
X: value to remap
upper: upper exclusive limit of remapping domain

Grasshopper.Kernel.GH_MathUtil.WrapInteger(System.Int32,System.Int32,System.Int32)
Make sure a value is within the lower~upper domain.
Works like MOD except it performs ok on negative values
number: Value to remap.
lower: Lower inclusive limit of remapping domain.
upper: Upper exclusive limit of remapping domain.