Grasshopper.Kernel.Types.IGH_QuickCast
IGH_QuickCast allows certain components to speed up type detection for inputs.
This interface is a Grasshopper core interface only, do not implement it. Do not use it.

Grasshopper.Kernel.Types.IGH_QuickCast.QC_Type
Gets the QuickCast type for this instance.