Grasshopper.GUI.Canvas.GH_ResizeBorder


Grasshopper.GUI.Canvas.GH_ResizeBorder.#ctor(System.Drawing.RectangleF,Grasshopper.GUI.Canvas.GH_BorderTopology)
Create a new instance of the GH_ResizeBorder class.
region: Base rectangle for borders.
topology: Border topology.

Grasshopper.GUI.Canvas.GH_ResizeBorder.#ctor(Grasshopper.GUI.Canvas.GH_Border)
Create a new instance of the GH_ResizeBorder class.
borders: Border to mimic.

Grasshopper.GUI.Canvas.GH_ResizeBorder.m_initial_shape
Initial rectangle of sizeable object.

Grasshopper.GUI.Canvas.GH_ResizeBorder.m_initial_pivot
Initial pivot of sizeable object.

Grasshopper.GUI.Canvas.GH_ResizeBorder.m_initial_cursor
Location of cursor when sizing began.

Grasshopper.GUI.Canvas.GH_ResizeBorder.m_size_anchor
Anchor point for resizing operation (usually in the corner of the shape opposite the cursor)

Grasshopper.GUI.Canvas.GH_ResizeBorder.m_limit_min
Minimum size limit for object.

Grasshopper.GUI.Canvas.GH_ResizeBorder.m_limit_max
Maximum size limit for object.

Grasshopper.GUI.Canvas.GH_ResizeBorder.Anchor
Gets or sets the anchor point for sizing operations.
This point is determined automatically when you call Setup(),
however you can alter it afterwards if you want.

Grasshopper.GUI.Canvas.GH_ResizeBorder.Setup(System.Drawing.RectangleF,System.Drawing.PointF,System.Drawing.PointF)
Set up a new sizing operation.
ShapeRegion: Shape of the object to resize.
ShapePivot: Pivot of the object to resize.
MouseCursor: Location of cursor in shape space coordinates.

Grasshopper.GUI.Canvas.GH_ResizeBorder.Setup(System.Drawing.RectangleF,System.Drawing.PointF,System.Drawing.PointF,System.Drawing.SizeF)
Set up a new sizing operation.
ShapeRegion: Shape of the object to resize.
ShapePivot: Pivot of the object to resize.
MouseCursor: Location of cursor in shape space coordinates.
MinSize: Minimum allowed size for shape.

Grasshopper.GUI.Canvas.GH_ResizeBorder.Setup(Grasshopper.Kernel.IGH_Attributes,System.Drawing.PointF)
Set up a new sizing operation.
att: Attributes of shape to resize.
MouseCursor: Location of cursor in shape space coordinates.

Grasshopper.GUI.Canvas.GH_ResizeBorder.Setup(Grasshopper.Kernel.IGH_Attributes,System.Drawing.PointF,System.Drawing.SizeF)
Set up a new sizing operation.
att: Attributes of shape to resize.
MouseCursor: Location of cursor in shape space coordinates.
MinSize: Minimum allowed size for shape.

Grasshopper.GUI.Canvas.GH_ResizeBorder.Setup(Grasshopper.Kernel.IGH_Attributes,System.Drawing.PointF,System.Drawing.SizeF,System.Drawing.SizeF)
Set up a new sizing operation.
att: Attributes of shape to resize.
MouseCursor: Location of cursor in shape space coordinates.
MinSize: Minimum allowed size for shape.
MaxSize: Maximum allowed size for shape.

Grasshopper.GUI.Canvas.GH_ResizeBorder.Setup(System.Drawing.RectangleF,System.Drawing.PointF,System.Drawing.PointF,System.Drawing.SizeF,System.Drawing.SizeF)
Set up a new sizing operation.
ShapeRegion: Shape of the object to resize.
ShapePivot: Pivot of the object to resize.
MouseCursor: Location of cursor in shape space coordinates.
MinSize: Minimum allowed size for shape.
MaxSize: Maximum allowed size for shape.

Grasshopper.GUI.Canvas.GH_ResizeBorder.Solve(System.Drawing.PointF,System.Drawing.RectangleF@,System.Drawing.PointF@)
Solve a resizing step.
nCursor: The new cursor location.
new_shape: The resized shape bounding box.
new_pivot: The adjusted shape pivot.

Grasshopper.GUI.Canvas.GH_ResizeBorder.Scale(System.Drawing.PointF,System.Drawing.PointF,System.Single,System.Single)
Perform 2D scaling with unique factors in X and Y directions.

Grasshopper.GUI.Canvas.GH_ResizeBorder.Scale(System.Single,System.Single,System.Single)
Perform linear scaling of floating point values around an anchor value