Grasshopper.Kernel.Data.IGH_IndexRule
Interface for index rules. An index rule is a way to determine whether a specific integer
is considered valid, invalid or neutral. Index rules are used for selecting elements in DataTrees.