Grasshopper.Kernel.GH_DocumentIO
Provides basic IO operations for GH_Documents.

Grasshopper.Kernel.GH_DocumentIO.#ctor
Create a new instance of GH_DocumentIO without an internal document.

Grasshopper.Kernel.GH_DocumentIO.#ctor(Grasshopper.Kernel.GH_Document)
Create a new instance of GH_DocumentIO with an internal document.
internal_doc: Document to internalise.

Grasshopper.Kernel.GH_DocumentIO.IsDocument
Gets a value indicating whether or not this instance of GH_DocumentIO contains an internal document.

Grasshopper.Kernel.GH_DocumentIO.Document
Gets or sets the internal document.

Grasshopper.Kernel.GH_DocumentIO.SaveDocumentDialog(System.String,System.String)
Display the Save GH/GHX dialog.
path: Optional default path.
title: Title of dialog.
Returns: FileName specified via the Save dialog or null if the dialog was cancelled.

Grasshopper.Kernel.GH_DocumentIO.SaveAsDocumentDialog(System.String)
Display the Save As GH/GHX dialog.
path: Optional default path.
Returns: FileName specified via the Save As dialog or null if the dialog was cancelled.

Grasshopper.Kernel.GH_DocumentIO.SaveAsCopyDocumentDialog(System.String)
Display the Save As Copy GH/GHX dialog.
path: Optional default path.
Returns: FileName specified via the Save As Copy dialog or null if the dialog was cancelled.

Grasshopper.Kernel.GH_DocumentIO.OpenDocumentDialog(System.String,System.String)
Display the Open GH/GHX dialog.
path: Optional default path.
title: Title of dialog.
Returns: FileName specified via the Open dialog or null if the dialog was cancelled.

Grasshopper.Kernel.GH_DocumentIO.SubsidiaryDocumentSavePrompt(Grasshopper.Kernel.GH_Document)
Display a 'stuff has changed do you want to save' message box with Yes/No/Cancel options.
document: Top level document.
Returns: Yes, No, Cancel or None state.

Grasshopper.Kernel.GH_DocumentIO.SubsidiaryDocumentSavePrompt(System.String,System.Boolean,System.Int32)
Display a 'stuff has changed do you want to save' message box with Yes/No/Cancel options.
documentName: Name of top level document.
modified: Boolean indicating whether top-level document is modified.
modifiedSubsidiaries: Number of modified subsidiary documents.
Returns: Yes, No, Cancel or None state.

Grasshopper.Kernel.GH_DocumentIO.LocalClipboardContent
Gets the contents of the local clipboard.

Grasshopper.Kernel.GH_DocumentIO.ClearClipboard(Grasshopper.Kernel.GH_ClipboardType)
Clear the Clipboard Text content.
This function wipes both the Text and UnicodeText clipboard fields.

Grasshopper.Kernel.GH_DocumentIO.Copy(Grasshopper.Kernel.GH_ClipboardType)
Copy the internal document into the clipboard.
clipboard: Specifies the clipboard type to use.

Grasshopper.Kernel.GH_DocumentIO.Copy(Grasshopper.Kernel.GH_ClipboardType,System.Boolean)
Copy the internal document into the clipboard.
clipboard: Specifies the clipboard type to use.
limitToSelection: If true, only the selected objects will be copied.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_DocumentIO.Copy(Grasshopper.Kernel.GH_ClipboardType,System.Collections.Generic.IEnumerable{System.Guid})
Copy the specified objects in the internal document into the clipboard.
clipboard: Specifies the clipboard type to use.
guids: List of object ids to copy.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_DocumentIO.Paste(Grasshopper.Kernel.GH_ClipboardType)
Deserialize a Grasshopper document from the clipboard.
On success, the internal document of this GH_DocumentIO instance will be set.
clipboard: Specifies the clipboard type to use.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_DocumentIO.SaveAs
Perform a default Save As operation on the internal document.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_DocumentIO.SaveBackup
Save a time-stamped copy of the current file.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_DocumentIO.Save
Perform a default Save operation on the internal document.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_DocumentIO.SaveQuiet(System.String)
Quietly save a file to a given location.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_DocumentIO.Open
Perform a default Open operation and store the result as the internal document.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_DocumentIO.Open(System.String)
Open the file at the given location.
filePath: Path of Grasshopper file to open.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_DocumentIO.GetDocumentThumbnail(System.String)
Try and extract the preview image of a document. Not all gh/ghx files contain a thumbnail
so this function may return null. The document itself is not loaded and rendered, so the
thumbnail really has to be part of the file already.
filePath: Filepath to examine.
Returns: A preview bitmap on success or null on failure.
Caller is responsible for disposing of the image.

Grasshopper.Kernel.GH_DocumentIO.GetDocumentIcon(System.String,System.Drawing.Size)
Try and extract the icon image of a document. Not all gh/ghx files contain an icon
so this function may return null. The document itself is not loaded and rendered, so the
icon really has to be part of the file already.
filePath: Filepath to examine.
Returns: An icon bitmap on success or null on failure.
Caller is responsible for disposing of the image.

Grasshopper.Kernel.GH_DocumentIO.DisableOverwriteProtection
Gets or sets whether the file overwrite protection dialog ought to be
shown during risky saves.

Grasshopper.Kernel.GH_DocumentIO.GetFileDate(System.String)
Gets the date associated with a specific file on the disk.
path: File path.
Returns: Date of last write, or Date.MinValue if file cannot be accessed.

Grasshopper.Kernel.GH_DocumentIO.ForgetFile(System.String)
Remove a specific file path from the file+dates cache.
This method is typically called when a file is closed.
path: Path of file.

Grasshopper.Kernel.GH_DocumentIO.RememberFile(System.String,System.DateTime)
Put a file into the file+dates cache.
path: Path of file.
time: Time to associate with file.

Grasshopper.Kernel.GH_DocumentIO.RememberFile(System.String)
Put a file into the file+dates cache,
using the current disc date.

Grasshopper.Kernel.GH_DocumentIO.ShowOverwriteWarningIfNeeded(System.String)
Show the overwrite warning dialog if the cached file time and the disk file time disagree.