Grasshopper.GUI.Script.GH_AssemblyBrowser.History
Gets the internal list of recently used assemblies.
If you update this list you must call UpdateAssemblyUI().

Grasshopper.GUI.Script.GH_AssemblyBrowser.Assemblies
Gets the internal list of referenced assembly files.

Grasshopper.GUI.Script.GH_AssemblyBrowser.AddAssemblies(System.Collections.Generic.IEnumerable{System.String})
Append a collection of assembly paths to the Referenced Assembly list.

Grasshopper.GUI.Script.GH_AssemblyBrowser.AddAssembly(System.String)
Append a new assembly path to the Referenced Assembly list.

Grasshopper.GUI.Script.GH_AssemblyBrowser.UpdateHistory
Move the current referenced assemblies into the history.

Grasshopper.GUI.Script.GH_AssemblyBrowser.AssembliesChanged
Gets whether the list of referenced assemblies has changed
since this window was shown.