Grasshopper.Kernel.Geometry.Voronoi.Cell2
Represents a two-dimensional voronoi diagram cell.

Grasshopper.Kernel.Geometry.Voronoi.Cell2.SliceConvexNGon(System.Collections.Generic.List{Grasshopper.Kernel.Geometry.Node2},Grasshopper.Kernel.Geometry.Line2,Grasshopper.Kernel.Geometry.Side2,System.Boolean@)
Generic n-gon slicer. If the nodes in V do not represent a valid, convex NGon
then the result will not be reliable.
V: Corners of NGon
line: The line to slice with
side: Side of NGon to keep (with respect to line)
Returns: Result. List may share Node instances with V

Grasshopper.Kernel.Geometry.Voronoi.Cell2.Edges
Get a list of all the edges that decribe the boundary of this cell.