Grasshopper.Kernel.IGH_DocumentOwner
Implement this interface if you want to be the owner assigned to a document in the Grasshopper documentserver.

Grasshopper.Kernel.IGH_DocumentOwner.DocumentModified(Grasshopper.Kernel.GH_Document)
This method will be called whenever the owned document is modified.
document: The modified document.

Grasshopper.Kernel.IGH_DocumentOwner.DocumentClosed(Grasshopper.Kernel.GH_Document)
This method will be called whenever the owner document was closed.
document: the closed docment.

Grasshopper.Kernel.IGH_DocumentOwner.OwnerDocument
If the IGH_DocumentOwner is part of a GH_Document of its own,
this function will return that document.