Grasshopper.Kernel.GH_ProfilerMode
Lists all profiler modes.

Grasshopper.Kernel.GH_ProfilerMode.None
Indicates no profiling is required.

Grasshopper.Kernel.GH_ProfilerMode.Processor
Indicates processor time is being measured.

Grasshopper.Kernel.GH_ProfilerMode.Memory
Indicates memory footprint is being measured.
Remarks: