Grasshopper.GUI.GH_IconTable
Utility class for caching 32BppPArgb icons with fast lookup.
Icons are hashed using a hashing algorithm to prevent identical entries.

Grasshopper.GUI.GH_IconTable.#ctor
This class cannot be constructed, use the static (Shared in Visual Basic) methods instead.

Grasshopper.GUI.GH_IconTable.Count
Gets the number of cached icons.

Grasshopper.GUI.GH_IconTable.Icon(System.Int32)
Gets the icon at the specified index.
index: Index of icon to retrieve.
Returns: The icon associated with the runtime index.

Grasshopper.GUI.GH_IconTable.RegisterIcon(System.Drawing.Bitmap)
Register a new icon with the table. If the supplied icon is a null reference,
the NullIconIndex will be returned.
icon: Icon to register.
Returns: Index of icon in table. Use this index for fast retrieval.

Grasshopper.GUI.GH_IconTable.To32BppPArgb(System.Drawing.Image)
Converts an image into 32BitPerPixelPremultipliedAlphaRedGreenBlue format.
This format draws much faster in GDI+ operations. However, there will be no gain
unless you cache the result of this function.

Grasshopper.GUI.GH_IconTable.To32BppArgb(System.Drawing.Image)
Converts an image into 32BitPerPixelAlphaRedGreenBlue format.

Grasshopper.GUI.GH_IconTable.ResizeImage(System.Drawing.Image,System.Drawing.Size,System.Drawing.Drawing2D.InterpolationMode,System.Drawing.Imaging.PixelFormat)
Create a new bitmap which is the resized version of an existing image.
img: Image to resize.
size: New size.
mode: Interpolation mode to use.
format: Bitmap pixelformat.
Returns: A new bitmap.