Grasshopper.Kernel.Types.GH_Curve
Represents a 3D spline curve.

Grasshopper.Kernel.Types.GH_Curve.#ctor
Default constructor, creates an invalid curve.

Grasshopper.Kernel.Types.GH_Curve.#ctor(Rhino.Geometry.Curve)
Create a duplicate of an existing curve.
curve: Curve to duplicate

Grasshopper.Kernel.Types.GH_Curve.#ctor(System.Guid)
Create a new referenced curve that references a Rhino curve object with the specified ID.
ref_guid: ID of curve object to reference.

Grasshopper.Kernel.Types.GH_Curve.#ctor(System.Guid,System.Int32)
Create a new references edge curve that references an edge index in a Rhino Brep object.
ref_guid: ID of Brep to reference.
ref_edge: Edge index of Brep to reference.

Grasshopper.Kernel.Types.GH_Curve.#ctor(Grasshopper.Kernel.Types.GH_Curve)
Create a duplicate of another GH_Curve. This constructor also copies reference data.
other: Curve to duplicate

Grasshopper.Kernel.Types.GH_Curve.DuplicateGeometry
Create a duplicate of this curve.

Grasshopper.Kernel.Types.GH_Curve.DuplicateCurve
Create a duplicate of this curve.

Grasshopper.Kernel.Types.GH_Curve.IsValid
Gets the validity of this curve. If the curve is referenced but cannot be loaded, the curve is not valid.

Grasshopper.Kernel.Types.GH_Curve.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Kernel.Types.GH_Curve.ToString
Format the curve using default grasshopper formatting logic.

Grasshopper.Kernel.Types.GH_Curve.ReferenceEdge
Gets or sets the edge index for a referenced curve. If the index >= 0 then an edge reference is implied.
Remarks: If an edge reference is implied, then the ReferenceID must point to a RhinoBrepObject.

Grasshopper.Kernel.Types.GH_Curve.ClearCaches
Clears all volatile caches for this instance. The boundingbox is cleared, and if the curve is referenced,
the local instance of the curve is erased.

Grasshopper.Kernel.Types.GH_Curve.IsGeometryLoaded
Gets the load state of this curve object. The curve is considered to be loaded when the local OnCurve instance is not null.

Grasshopper.Kernel.Types.GH_Curve.LoadGeometry(Rhino.RhinoDoc)
If the curve is referenced and not yet loaded, attempts to load the curve.
Returns: True if the curve is loaded (or if it was already loaded), False on failure.

Grasshopper.Kernel.Types.GH_Curve.MakeDeformable
Converts the local geometry into deformable nurbs curve geometry.
This method will not destroy Reference data.

Grasshopper.Kernel.Types.GH_Curve.CastFrom(System.Object)
Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_Curve.CastTo``1(``0@)
Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_Curve.EmitProxy
Returns a proxy that represents this curve. Do not call this function unless you're