Grasshopper.Kernel.GH_ParameterSide
Enumerates possible sides for variable parameters.

Grasshopper.Kernel.GH_ParameterSide.Input
Indicates parameters along the left edge of the component.

Grasshopper.Kernel.GH_ParameterSide.Output
Indicates parameters along the right edge of the component.