Grasshopper.Kernel.Data.GH_IndexRange
Represents a range of indices.

Grasshopper.Kernel.Data.GH_IndexRange.#ctor(System.Int32)
Create a new singular range.
index: Index of range start and end.

Grasshopper.Kernel.Data.GH_IndexRange.#ctor(System.Int32,System.Int32)
Create a new range.
index0: First index in range.
index1: Last index in range.

Grasshopper.Kernel.Data.GH_IndexRange.Union(Grasshopper.Kernel.Data.GH_IndexRange,Grasshopper.Kernel.Data.GH_IndexRange)
Create a range which contains both input ranges.
range0:
range1:
Returns: Smallest range big enough to contain both range0 and range1.

Grasshopper.Kernel.Data.GH_IndexRange.Intersection(Grasshopper.Kernel.Data.GH_IndexRange,Grasshopper.Kernel.Data.GH_IndexRange)
Create the intersection between two ranges.
range0: First range to intersect.
range1: Second range to intersect.
Returns: The intersection or an invalid range if the input doesn't intersect.

Grasshopper.Kernel.Data.GH_IndexRange.Split(Grasshopper.Kernel.Data.GH_IndexRange,Grasshopper.Kernel.Data.GH_IndexRange,Grasshopper.Kernel.Data.GH_IndexRange@,Grasshopper.Kernel.Data.GH_IndexRange@)
Split a range into two using an integer index.
range: Range to split.
splitter: Range to split with.
result0: First split result if successful, or an invalid range if not.
result1: Second split result if successful, or an invalid range if not.
Returns: The number of valid split results.

Grasshopper.Kernel.Data.GH_IndexRange.InvalidRange
Gets the predefined invalid range.

Grasshopper.Kernel.Data.GH_IndexRange.Index0
Gets the first index in the range.

Grasshopper.Kernel.Data.GH_IndexRange.Index1
Gets the last index in the range.

Grasshopper.Kernel.Data.GH_IndexRange.Length
Gets the length of the range.

Grasshopper.Kernel.Data.GH_IndexRange.IsSingular
Gets whether the range has zero length.

Grasshopper.Kernel.Data.GH_IndexRange.IsValid
Gets whether this range is valid.

Grasshopper.Kernel.Data.GH_IndexRange.IntersectsWith(Grasshopper.Kernel.Data.GH_IndexRange)
Tests whether certain indices are described by both this and another range.
range: Range to intersect with.
Returns: True if the ranges intersect.

Grasshopper.Kernel.Data.GH_IndexRange.AdjacentTo(Grasshopper.Kernel.Data.GH_IndexRange)
Tests whether this range is adjacent to another.
range: Range to test.
Returns: True if the ranges are adjacent and not intersecting.

Grasshopper.Kernel.Data.GH_IndexRange.Contains(Grasshopper.Kernel.Data.GH_IndexRange)
Tests whether a specified range is entirely contained within this range.
range: Range to test.
Returns: True if the range is inside this one.

Grasshopper.Kernel.Data.GH_IndexRange.Contains(System.Int32)
Tests whether a specified index is defined by this range.
index: Index to test.
Returns: True if the index is inside this range.