Grasshopper.Kernel.Special.GH_GeometryPipeline


Grasshopper.Kernel.Special.GH_GeometryPipeline.AppendMenuItems(System.Windows.Forms.ToolStripDropDown)
This function is called when a context menu is about to be displayed.
Override it to set custom items. GH_ActiveObject will already populate
the menu with default items, if you merely wish to insert object-specific
menu item, consider overriding AppendAdditionalMenuItems instead.
menu: Menu object to populate.
Returns: If true, the menu will be displayed, if false the menu will be supressed.

Grasshopper.Kernel.Special.GH_GeometryPipeline.ToggleTypeFilter(Rhino.DocObjects.ObjectType)
Toggle the filter for a specific type. This method records undo and also resolves immediately.

Grasshopper.Kernel.Special.GH_GeometryPipeline.SublayerFiltering
Gets or sets whether sublayer filtering is on.
Returns: