Grasshopper.Kernel.GH_Attributes`1
Derive from this class rather than implementing IGH_Attributes from scratch.
Type of the objects that owns these attributes.

Grasshopper.Kernel.GH_Attributes`1.#ctor(`0)
Construct a new instance of this class.
owner: Owner object associated with these attributes.

Grasshopper.Kernel.GH_Attributes`1.HasInputGrip
Gets a value indicating whether or not these attributes have an input grip.

Grasshopper.Kernel.GH_Attributes`1.HasOutputGrip
Gets a value indicating whether or not these attributes have an output grip.

Grasshopper.Kernel.GH_Attributes`1.InputGrip
Gets the input grip location for these attributes.
If HasInputGrip equals False, this point is meaningless.

Grasshopper.Kernel.GH_Attributes`1.OutputGrip
Gets the output grip location for these attributes.
If HasOutputGrip equals False, this point is meaningless.

Grasshopper.Kernel.GH_Attributes`1.Pivot
Gets or sets the pivot for these attributes. The pivot controls the general placement
of the attributes. If you want to move the attributes, change the pivot location.

Grasshopper.Kernel.GH_Attributes`1.Bounds
Gets the rectangle that contains the active content of the attributes.
Typically the Contents determine the active area for menus, tooltips etc.
Attributes are not supposed to draw objects beyond the Bounds.

Grasshopper.Kernel.GH_Attributes`1.AllowMessageBalloon
Gets a value indicating whether these attributes allow warning and
error balloons to be drawn on top of them.

Grasshopper.Kernel.GH_Attributes`1.IsPickRegion(System.Drawing.PointF)
Determines whether a point is within the pickable region for this object.
By default, any point inside the Bounds is treated as pickable.
point: Point location to test.

Grasshopper.Kernel.GH_Attributes`1.IsPickRegion(System.Drawing.RectangleF,Grasshopper.Kernel.GH_PickBox)
Determines whether a rectangle is a valid pick region for this object.
By default, the picking rectangle is intersected with the Bounds rectangle.
box: Selection box.
method: Selection method.

Grasshopper.Kernel.GH_Attributes`1.IsMenuRegion(System.Drawing.PointF)
Determines whether a point is available for context menu popups.
By default, IsMenuRegion calls IsPickRegion(PointF).
point: Point location to test.

Grasshopper.Kernel.GH_Attributes`1.IsTooltipRegion(System.Drawing.PointF)
Determines whether a point is available for tooltip popups.
By default, IsMenuRegion calls IsTooltipRegion(PointF).
point: Point location to test.

Grasshopper.Kernel.GH_Attributes`1.SolvePathBoxPick(System.Drawing.Drawing2D.GraphicsPath,System.Drawing.RectangleF,System.Single,Grasshopper.Kernel.GH_PickBox)
Utility function for testing window selections with freeform Graphics paths.
path: Path to test.
box: Window selection box.
fuzz: Fuzzy pixels around object.
mode: Selection mode to apply.
Returns: True if box contains the path.

Grasshopper.Kernel.GH_Attributes`1.m_graphics
This shared object is used in the SolvePathBoxPick method.

Grasshopper.Kernel.GH_Attributes`1.SetupTooltip(System.Drawing.PointF,Grasshopper.GUI.GH_TooltipDisplayEventArgs)
Populates the Grasshopper tooltip with all relevant data.
If this function returns True, it is assumed that all possible
fields have been filled out and the tooltip is ready for display.
e: Tooltip event arguments.
point: The pixel coordinate on the canvas of the cursor.

Grasshopper.Kernel.GH_Attributes`1.TooltipEnabled
Gets the tooltip enabled value. If False, no further tooltip functions will be called.

Grasshopper.Kernel.GH_Attributes`1.ExpireLayout
Expires the entire layout of the attributes. When overridden,
implementer must place a call to the base class ExpireLayout().

Grasshopper.Kernel.GH_Attributes`1.PerformLayout
Recompute the layout for these attributes. This function is automatically called during
Drawing operations, so you typically don't have to.

Grasshopper.Kernel.GH_Attributes`1.Layout
Perform dedicated layout logic specific to this particular DocumentObject.
This method is called from PerformLayout if the existing layout is stale.

Grasshopper.Kernel.GH_Attributes`1.IsTopLevel
Gets whether these attributes are top_level (i.e. no Parent attributes)

Grasshopper.Kernel.GH_Attributes`1.GetTopLevel
Gets the top-level attributes of the attribute stack these attributes belong to.

Grasshopper.Kernel.GH_Attributes`1.Parent
Gets or sets the parent attributes.
Top level attributes do not have parents.

Grasshopper.Kernel.GH_Attributes`1.DocObject
Gets the owner object of these attributes.

Grasshopper.Kernel.GH_Attributes`1.Owner
Gets the type-safe owner object of these attributes. This property is identical to
the DocObject property.

Grasshopper.Kernel.GH_Attributes`1.PathName
Get a description of the location of these attributes
within the local attribute stack.

Grasshopper.Kernel.GH_Attributes`1.InstanceGuid
Gets the instance ID of the document object that owns these attributes.

Grasshopper.Kernel.GH_Attributes`1.NewInstanceGuid
Generate a new instance GUID for the owner object.

Grasshopper.Kernel.GH_Attributes`1.NewInstanceGuid(System.Guid)
Generate a new instance GUID for the owner object. Do not use this overload
unless you're > 1.95m and called David.
newID: New ID to assign.

Grasshopper.Kernel.GH_Attributes`1.AppendToAttributeTree(System.Collections.Generic.List{Grasshopper.Kernel.IGH_Attributes})
Recursively append these attributes and all child attributes to the attribute list.
attributes: List to append to.

Grasshopper.Kernel.GH_Attributes`1.Selected
Gets or sets the selected state of the top-level attributes.

Grasshopper.Kernel.GH_Attributes`1.RenderToCanvas(Grasshopper.GUI.Canvas.GH_Canvas,Grasshopper.GUI.Canvas.GH_CanvasChannel)
Render these attributes into a Canvas control. This function places calls to
PrepareForRender() and Render(), you should override those.
canvas: Canvas to draw on.
channel: Current drawing channel.

Grasshopper.Kernel.GH_Attributes`1.PrepareForRender(Grasshopper.GUI.Canvas.GH_Canvas)
This method will always be called exactly once prior to Render().
This would be a good place to make sure all the necessary GUI data is up and running.
canvas: Canvas that is about to render these attributes.

Grasshopper.Kernel.GH_Attributes`1.Render(Grasshopper.GUI.Canvas.GH_Canvas,System.Drawing.Graphics,Grasshopper.GUI.Canvas.GH_CanvasChannel)
Override this function to supply custom Render logic.
canvas: Canvas in which these attributes are to be drawn.
graphics: Graphics object to draw with.
channel: Current drawing channel.

Grasshopper.Kernel.GH_Attributes`1.InvalidateCanvas(Grasshopper.GUI.Canvas.GH_Canvas,Grasshopper.GUI.GH_CanvasMouseEvent)
If the mouse location should cause a canvas invalidation then return true.
You only need to override this function if you draw objects that are dependant
on cursor positions outside the bounds of the attributes.
canvas: Canvas to potentially invalidate.
e: Event arguments for canvas mousemove.
Returns: True if the canvas ought to be invalidated.

Grasshopper.Kernel.GH_Attributes`1.IsIconMode(Grasshopper.Kernel.GH_IconDisplayMode)
Utility function for determining Icon display modes.
If the supplied mode is ::application, then it will be adjusted to match the current app settings.

Grasshopper.Kernel.GH_Attributes`1.RenderIncomingWires(Grasshopper.GUI.Canvas.GH_Painter,System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_Param},Grasshopper.Kernel.GH_ParamWireDisplay)
Utility function for derived classes. This method draws all the wires going into the
left side of the attributes.
painter: The graphics object to paint with
sources: A list of sources that will be connected with the input grip of this attribute
style: Style for wire display.

Grasshopper.Kernel.GH_Attributes`1.RenderIncomingWires(Grasshopper.GUI.Canvas.GH_Painter,System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_Param},System.Collections.Generic.IEnumerable{System.Drawing.Pen})
Utility function for derived classes. This method draws all the wires going into the
left side of the attributes.
painter: The graphics object to paint with
sources: A list of sources that will be connected with the input grip of this attribute
styles: A collection of pen objects to use for each source. If a pen is null, the default wire style will be used instead.