Grasshopper.GUI.Base.GH_SliderEventArgs
Arguments passed via GH_SliderBase.ValueChanged events.

Grasshopper.GUI.Base.GH_SliderEventArgs.Slider
Gets the instance of the slider that raised the event.

Grasshopper.GUI.Base.GH_SliderEventArgs.Value
Gets the new value of the slider. This value is cached, so even if the
slider subsequently updates, this property remains constant.

Grasshopper.GUI.Base.GH_SliderEventArgs.Intermediate
Gets a value indicating whether the change was an intermediate one.