Grasshopper.Kernel.Special.GH_GraphMapper


Grasshopper.Kernel.Special.GH_GraphMapper.Container
Gets or sets the graph mapper object.
If the Graph mapper has no underlying graph, the instance is discarded.