Grasshopper.Kernel.Special.GH_GroupBorder
Represents all possible Group borders.

Grasshopper.Kernel.Special.GH_GroupBorder.None
Border is not drawn.

Grasshopper.Kernel.Special.GH_GroupBorder.Box
Border is the bounding box of all contained objects.

Grasshopper.Kernel.Special.GH_GroupBorder.Blob
Border is the meta-ball outline of all contained objects.

Grasshopper.Kernel.Special.GH_GroupBorder.Rectangles
Border is a filleted collection of outlines.