Grasshopper.GUI.GH_ExpressionEditor
The Grasshopper expression editor window.

Grasshopper.GUI.GH_ExpressionEditor.PreviewDelegate
Gets or sets the preview delegate function.

Grasshopper.GUI.GH_ExpressionEditor.Expression
Gets or sets the expression string.

Grasshopper.GUI.GH_ExpressionEditor.Variables
Gets the dictionary that maintains copy of the available variables.
It is important that you add variables of the correct type, so that the validity of
the expression can be tested in realtime.
How to use the Variables property when making a new GH_ExpressionEditor:
Dim editor As New GH_ExpressionEditor()
editor.Expression = "Sin(p) + Cos(p*0.95) + A.z"
editor.Variables.Add("p", New Expressions.VAR_Double(0.0))
editor.Variables.Add("A", New Expressions.VAR_Point(0.0, 0.0, 0.0))
editor.ShowDialog()