Grasshopper.Kernel.Types.GH_Goo`1
Base class for IGH_Goo implementation. Takes care of some default behaviour.
Remarks: Feel free to implement IGH_Goo directly though.

Grasshopper.Kernel.Types.GH_Goo`1.#ctor
Blank constructor, m_value will be set to default (null for reference types, zeroes for value types)

Grasshopper.Kernel.Types.GH_Goo`1.#ctor(`0)
Data constructor, m_value will be set to internal_data.
internal_data: Value to store inside this Goo instance.

Grasshopper.Kernel.Types.GH_Goo`1.#ctor(Grasshopper.Kernel.Types.GH_Goo{`0})
Copy constructor, copies the data from another GH_Goo(Of T) instance.
Reference types will not be duplicated.
other: Goo instance to copy.

Grasshopper.Kernel.Types.GH_Goo`1.Duplicate
Make a complete duplicate of this instance. No shallow copies.
Remarks: Classes which implement this interface should also provide type specific Duplicate methods

Grasshopper.Kernel.Types.GH_Goo`1.EmitProxy
Create a new proxy for this instance. Return Null if this class does not support proxies.

Grasshopper.Kernel.Types.GH_Goo`1.Value
Gets or sets the internal data.

Grasshopper.Kernel.Types.GH_Goo`1.IsValid
Gets a value indicating whether or not the current value is valid.

Grasshopper.Kernel.Types.GH_Goo`1.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return
Nothing or String.Empty.

Grasshopper.Kernel.Types.GH_Goo`1.ToString
Creates a string description of the current instance value.

Grasshopper.Kernel.Types.GH_Goo`1.TypeName
Gets the name of the type of the implementation.

Grasshopper.Kernel.Types.GH_Goo`1.TypeDescription
Gets a description of the type of the implementation.

Grasshopper.Kernel.Types.GH_Goo`1.CastFrom(System.Object)
Attempt a cast from generic data.
source: Reference to data that should be cast.
Returns: True on success, false on failure.
Remarks: If False, the contents of this instance are not to be trusted.

Grasshopper.Kernel.Types.GH_Goo`1.CastTo``1(``0@)
Attempt a cast to type Q.
Type to cast to.
target: Pointer to target of cast.
Returns: True on success, false on failure.
Remarks: If false, the target instance contents are not guaranteed to be valid.

Grasshopper.Kernel.Types.GH_Goo`1.ScriptVariable
This function will be called when the local IGH_Goo instance
disappears into a user Script. This would be an excellent place to
cast your IGH_Goo type to a simple data type.
Returns: The default implementation of this function returns the Value instance.

Grasshopper.Kernel.Types.GH_Goo`1.Read(GH_IO.Serialization.GH_IReader)
Default behaviour is to return True.

Grasshopper.Kernel.Types.GH_Goo`1.Write(GH_IO.Serialization.GH_IWriter)
Default behaviour is to return True.