Grasshopper.Kernel.Special.GH_Panel


Grasshopper.Kernel.Special.GH_Panel.AutoResize
Gets or sets whether the panel ought to automatically resize to fit the content during the next draw operation.
This field is typically only set to True during SetInitCodes.

Grasshopper.Kernel.Special.GH_Panel.UserText
Gets or sets user text, but doesn't expire caches.
If you wish to replace all display caches, use SetUserText() instead.

Grasshopper.Kernel.Special.GH_Panel.SetUserText(System.String)
Sets user text field and causes everything to update accordingly.
Only call this function if you want the new text to propagate throughout the solution.

Grasshopper.Kernel.Special.GH_Panel.ScrollRatio
Gets or sets the scroll ratio for this panel.

Grasshopper.Kernel.Special.GH_Panel.Properties
Gets the one and only properties instance for this panel.

Grasshopper.Kernel.Special.GH_Panel.EnsureMappingDictionary
Builds the mapping dictionaries if they do not exist yet.

Grasshopper.Kernel.Special.GH_Panel.MapSymbol(System.String)
Map a symbol description to a given unicode symbol.
description: Description.
Returns: description or symbol.

Grasshopper.Kernel.Special.GH_Panel.GetMappingList
Get a list of all defined mapping combos for the 'special codes' option in panels.