Grasshopper.GUI.Ribbon.GH_LayoutTab
Represents a tab on a ribbon layout.

Grasshopper.GUI.Ribbon.GH_LayoutTab.#ctor
Create a new blank Tab

Grasshopper.GUI.Ribbon.GH_LayoutTab.#ctor(System.String)
Create a new empty tab.
name: Name of tab.

Grasshopper.GUI.Ribbon.GH_LayoutTab.#ctor(Grasshopper.GUI.Ribbon.GH_LayoutTab)
Duplicate another Tab.
other: Tab to duplicate

Grasshopper.GUI.Ribbon.GH_LayoutTab.Name
Gets or sets the name of this tab.
Tabs must have a non-zero name or they will be "unnamed".

Grasshopper.GUI.Ribbon.GH_LayoutTab.Selected
Gets or sets whether this tab is selected. This property is used
exclusively inside Layout Editors, not Ribbon controls.

Grasshopper.GUI.Ribbon.GH_LayoutTab.Panels
Gets the list of Panels for this tab.

Grasshopper.GUI.Ribbon.GH_LayoutTab.SortPanels(System.String[])
Attempt to sort the panels in this tab to match a given order.
order: A collection of strings that identify the order of panels.

Grasshopper.GUI.Ribbon.GH_LayoutTab.AddPanel
Add a new panel to this tab. The panel will receive a default name.

Grasshopper.GUI.Ribbon.GH_LayoutTab.AddPanel(System.String)
Add a new panel to this layout. If a panel with a similar name already exists, nothing is done.
name: Name of panel.

Grasshopper.GUI.Ribbon.GH_LayoutTab.Deselect
Deselect this tab and all objects it contains.