Grasshopper.GUI.HTML.GH_HtmlTextProperties
Enumerates simple html text properties.

Grasshopper.GUI.HTML.GH_HtmlTextProperties.None
Specifies no overrides, text will adhere to local style properties.

Grasshopper.GUI.HTML.GH_HtmlTextProperties.Strong
The text will be rendered as STRONG.

Grasshopper.GUI.HTML.GH_HtmlTextProperties.Emphasis
The text will be render as EMPHASIS.

Grasshopper.GUI.HTML.GH_HtmlTextProperties.SuperScript
The text will be rendered as SUPERSCRIPT. This property is not compatible with SubScript.

Grasshopper.GUI.HTML.GH_HtmlTextProperties.SubScript
The text will be rendered as SUBSCRIPT. This properti is not compatible with SuperScript.

Grasshopper.GUI.HTML.GH_HtmlTextProperties.Code
The text will be rendered as CODE.