Grasshopper.GUI.GH_FontControl
Represents a control that offers both Font preview and Picking methods.

Grasshopper.GUI.GH_FontControl.OnLayout(System.Windows.Forms.LayoutEventArgs)
Raises the System.Windows.Forms.Control.Layout event.
e: A System.Windows.Forms.LayoutEventArgs that contains the event data.