Grasshopper.Kernel.Types.GH_Field
Represents a field of forces.

Grasshopper.Kernel.Types.GH_Field.#ctor
Blank constructor.

Grasshopper.Kernel.Types.GH_Field.#ctor(Grasshopper.Kernel.Types.GH_Field)
Copy constructor.
other: Field to duplicate.

Grasshopper.Kernel.Types.GH_Field.Elements
Gets the list of elements of this field.

Grasshopper.Kernel.Types.GH_Field.TensorAt(Rhino.Geometry.Point3d)
Compute the field tensor at the given location as contributed by all the field elements.
location: Location to sample field at.
Returns: The strength and direction of the field at the given location.

Grasshopper.Kernel.Types.GH_Field.SolveStep(Rhino.Geometry.Point3d,System.Double,Grasshopper.Kernel.Types.GH_DifferentialSolver)
Move a point through the field.
location: Point to move from.
factor: Multiplication factor to apply to sampling. A low factor results in more accurate sampling, but smaller steps.
method: Estimator to use.
Returns: New point location.

Grasshopper.Kernel.Types.GH_Field.SolveSteps(Rhino.Geometry.Point3d,System.Double,System.Int32,Grasshopper.Kernel.Types.GH_DifferentialSolver)
Move a point through a succession of steps.
location: Point to move.
accuracy: Rough accuracy.
count: Number of samples to take.
method: Estimator to use.
Returns: A track (including the original location) of all the samples.