Grasshopper.Kernel.GH_ValueProxy`1
Represents the abstract base implementation of the IGH_ValueProxy interface.
The type of this implementation

Grasshopper.Kernel.GH_ValueProxy`1.#ctor(`0,System.String,System.Boolean)
Default constructor for the base class. All derived classes must call this constructor.
nValue: The value to store in this proxy
nProxyName: The human-friendly name of this value type
bIsStringProxy: If True, then this proxy becomes Parsable.

Grasshopper.Kernel.GH_ValueProxy`1.UserString
Wraps the protected m_UserString field

Grasshopper.Kernel.GH_ValueProxy`1.ToString
Performs a default ToString operation on the local value.
If the value is Nothing, an empty String is returned.
Remarks: Implementors: override this function if you need custom formatting logic.

Grasshopper.Kernel.GH_ValueProxy`1.FromString(System.String)
Performs the String->Value parsing. The default implementation always returns False.
in: The String to parse
Returns: True in cae of success, False in case of failure.
Remarks: The result of the parse is stored in the local value pointer.
If this function returns False there is no guarantee the local value is still valid.