Grasshopper.GUI.GH_AnimatedProcessPanel
Panel that displays an infinite animation.

Grasshopper.GUI.GH_AnimatedProcessPanel.ParticleCount
Gets or sets the number of particles.

Grasshopper.GUI.GH_AnimatedProcessPanel.Particles
Gets the list of all particles.

Grasshopper.GUI.GH_AnimatedProcessPanel.ParticleDirections
Gets the travel direction of all particles.

Grasshopper.GUI.GH_AnimatedProcessPanel.ParticleSpeed
Gets or sets the particle velocity factor.