Grasshopper.GUI.Canvas.GH_CanvasViewportChangedEventArgs
These arguments are used in the ViewportChanged event on GH_Canvas.

Grasshopper.GUI.Canvas.GH_CanvasViewportChangedEventArgs.Canvas
Gets the Canvas whose viewport was changed.

Grasshopper.GUI.Canvas.GH_CanvasViewportChangedEventArgs.Viewport
Gets the new Viewport.