Grasshopper.Kernel.GH_ConnectivityNode
Represents a single node in a Grasshopper connectivity diagram.
A single node represents a single IGH_Param instance.

Grasshopper.Kernel.GH_ConnectivityNode.NodeID
Gets the InstanceID of the Parameter that this node represents.

Grasshopper.Kernel.GH_ConnectivityNode.NodeIn
Gets the list of IDs that are connected to the input of this node.

Grasshopper.Kernel.GH_ConnectivityNode.NodeOut
Gets the list of IDs that are connected to the input of this node.