Grasshopper.Kernel.Expressions.GH_ExpressionParser
Provides a run-time evaluator for Grasshopper expressions.

Grasshopper.Kernel.Expressions.GH_ExpressionParser.ClearVariables
Destroy the variable cache.

Grasshopper.Kernel.Expressions.GH_ExpressionParser.ClearSymbols
Destroy the Symbols cache.

Grasshopper.Kernel.Expressions.GH_ExpressionParser.IsValidVariableName(System.String)
Tests whether a string is a valid variable name for expressions.
Valid names must contain at least one character, must start with an
alphabetic character, and only contain alphanumeric chars and underscores.
name: Name to test.
Returns: True if the name is valid (might still conflict with a function name though), false if not.

Grasshopper.Kernel.Expressions.GH_ExpressionParser.CacheSymbols(System.String)
Create a Symbols array from the expression.
Use this method if you intend to evaluate the same expression multiple times.
At this point, the expression has to be in correct syntax format.
Use the GH_ExpressionSyntaxWriter.RewriteAll() method to make sure.

Grasshopper.Kernel.Expressions.GH_ExpressionParser.CachedSymbols
Retrieve a copy of the Queue of cached symbols. You can use the cached symbols as an uber-optimization
to speed up successive calls to Evaluate() with an identical expression string

Grasshopper.Kernel.Expressions.GH_ExpressionParser.Evaluate
Evaluate the expression currently loaded in the Symbols cache using the currently loaded variables.

Grasshopper.Kernel.Expressions.GH_ExpressionParser.Evaluate(System.Collections.Generic.Queue{Grasshopper.Kernel.Expressions.GH_ParserSymbol})
Evaluate the expression queue without overriding any local caches.
You can obtain an expression queue by calling CachedSymbols()

Grasshopper.Kernel.Expressions.GH_ExpressionParser.Evaluate(System.String)
Store a new expression in the Symbols cache and evaluate it using the current variables

Grasshopper.Kernel.Expressions.GH_ExpressionParser.BalancedCharTest(System.String,System.Char,System.Char,System.Int32@)
Test a string for balanced open and close chars. You can use this function to
see if brackets or parenthesis have been properly used.
str: String to parse.
char_open: Char that indicates an opening statement.
char_close: Char that indicates a closing statement.
error_at: The index at which the first error appears or -1 if no error was found.
Returns: True if the chars are balanced, false if they are not.