Grasshopper.Kernel.Special.GH_GradientControl


Grasshopper.Kernel.Special.GH_GradientControl.DefaultGradient
Gets or sets the default gradient for Gradient controls.
This property accesses the [grasshopper_gradients] settings database.

Grasshopper.Kernel.Special.GH_GradientControl.GradientPresets
Gets or sets all gradient presets. This property access the [grasshopper_gradient]
settings database.