Grasshopper.GUI.GH_TrackerFrame
Represents a single frame in a mouse-tracker history.
A frame represents all relevant mouse and keyboard data at a given time.

Grasshopper.GUI.GH_TrackerFrame.PositionControl
The position (in control coordinates) of the frame.

Grasshopper.GUI.GH_TrackerFrame.PositionScreen
The position (in screen coordinates) of the frame.

Grasshopper.GUI.GH_TrackerFrame.Time
The time at which this frame was recorded.

Grasshopper.GUI.GH_TrackerFrame.Keys
The state of the modifier keys (Contro, Shift and Alt) of the frame.

Grasshopper.GUI.GH_TrackerFrame.Buttons
The state of the mouse buttons of the frame.

Grasshopper.GUI.GH_TrackerFrame.Tag
Optional Tag object (to be supplied by user).