Grasshopper.Kernel.GH_LineParserAction
Enumerates the possible actions a line parser can invoke.

Grasshopper.Kernel.GH_LineParserAction.Include
Include the return code of the parser function.

Grasshopper.Kernel.GH_LineParserAction.Ignore
Ignore this line of text and move on to the next line.

Grasshopper.Kernel.GH_LineParserAction.Abort
Ignore this line of text and don't parse all subsequent lines.