Grasshopper.Kernel.Types.GH_Predicate.FromFunc``1(System.Func{``0,System.Boolean})
Method used in Grasshopper.Kernel.GH_Convert.ToGoo(System.Object) to wrap a System.Func`2.
Remarks: The Method is internal and its name should not coincide with an other static method in this Type.
predicate:
Returns: