Grasshopper.Kernel.IGH_DataAccess
Provides access to component parameters, in order to retrieve and assign data
during solutions.

Grasshopper.Kernel.IGH_DataAccess.Iteration
Gets the current iteration count.
The first time the SolveInstance() function is called on a component
during a solution the Iteration counter will be zero. It will be
incremented by one for every subsequent call.
Returns: An integer representing the iteration count.

Grasshopper.Kernel.IGH_DataAccess.IncrementIteration
Increments the iteration count by 1.

Grasshopper.Kernel.IGH_DataAccess.DisableGapLogic
Call this function if you want to disable the gap null logic for the current iteration.

Grasshopper.Kernel.IGH_DataAccess.DisableGapLogic(System.Int32)
Call this function if you want to disable the gap null logic for a specific output parameter.
paramIndex: Index of output parameter to disable.

Grasshopper.Kernel.IGH_DataAccess.ParameterTargetPath(System.Int32)
Get the target path for the specified output parameter.
paramIndex: Index of output parameter.

Grasshopper.Kernel.IGH_DataAccess.ParameterTargetIndex(System.Int32)
Get the target index for the specified output parameter.
paramIndex: Index of output parameter.

Grasshopper.Kernel.IGH_DataAccess.AbortComponentSolution
Call this method if you wish to stop solving this component.

Grasshopper.Kernel.IGH_DataAccess.Util_RemoveNullRefs``1(System.Collections.Generic.List{``0})
Remove all null references from a list of items.
Type of list
L: List to filter
Returns: List containing only non-null items. References are shared with L

Grasshopper.Kernel.IGH_DataAccess.Util_CountNullRefs``1(System.Collections.Generic.List{``0})
Count all null references in L
Type of list
L: List to parse
Returns: Number of nulls in L

Grasshopper.Kernel.IGH_DataAccess.Util_CountNonNullRefs``1(System.Collections.Generic.List{``0})
Count all object references in L
Type of list
L: List to parse
Returns: Number of proper objects in L

Grasshopper.Kernel.IGH_DataAccess.Util_EnsureNonNullCount``1(System.Collections.Generic.List{``0},System.Int32)
Tests a list to see if it contains sufficient non-null references.
Type of list
L: List to parse
Returns: True if L contains N or more non-null references.

Grasshopper.Kernel.IGH_DataAccess.Util_FirstNonNullItem``1(System.Collections.Generic.List{``0})
Returns the index of the first non-null item in a list.
Type of list
L: List to parse.
Returns: The index of the first non-null item or -1 if no object reference could be found.

Grasshopper.Kernel.IGH_DataAccess.SetData(System.Int32,System.Object)
Stores data in an output parameter during GH_Component.SolveInstance().
Use this function only for setting individual data items.
If you want to set lists of data, you *must* call SetDataList() instead.
paramIndex: Index of the output parameter at which to store the data.
data: Data to store. Data will be converted if necessary,
but it will not be duplicated automatically.

Grasshopper.Kernel.IGH_DataAccess.SetData(System.Int32,System.Object,System.Int32)
Expert user function. Stores data in an output parameter during GH_Component.SolveInstance().
Use this function only for setting individual data items.
If you want to set lists of data, you *must* call SetDataList() instead.
paramIndex: Index of the output parameter at which to store the data.
data: Data to store. Data will be converted if necessary,
but it will not be duplicated automatically.
itemIndexOverride: Typically the item index is a result of Data matching logic.
If you want to override the item index, then call this function.

Grasshopper.Kernel.IGH_DataAccess.SetData(System.String,System.Object)
Stores data in an output parameter during GH_Component.SolveInstance().
paramName: Name of the output parameter at which to store the data.
data: Data to store. Data will be converted if necessary,
but it will not be duplicated automatically.
Remarks: Parameter access by index is faster, consider using the other overload if possible.

Grasshopper.Kernel.IGH_DataAccess.SetDataList(System.Int32,System.Collections.IEnumerable)
Stores a list of data in an output parameter during GH_Component.SolveInstance().
paramIndex: Index of the output parameter at which to store the list.
data: Data to store. Data will be converted if necessary,
but it will not be duplicated automatically.

Grasshopper.Kernel.IGH_DataAccess.SetDataList(System.Int32,System.Collections.IEnumerable,System.Int32)
Expert user function. Stores a list of data in an output parameter
during GH_Component.SolveInstance().
paramIndex: Index of the output parameter at which to store the list.
data: Data to store. Data will be converted if necessary,
but it will not be duplicated automatically.
listIndexOverride: Typically the branch index is a result of Data matching logic.
If you want to override the branch index, then call this function.

Grasshopper.Kernel.IGH_DataAccess.SetDataList(System.String,System.Collections.IEnumerable)
Stores data in an output parameter during GH_Component.SolveInstance().
paramName: Name of the parameter at which to store the data.
data: Data to store. Data will be converted if necessary,
but it will not be duplicated automatically.
Remarks: Parameter access by index is faster, consider using the other overload if possible.

Grasshopper.Kernel.IGH_DataAccess.SetDataTree(System.Int32,Grasshopper.Kernel.Data.IGH_DataTree)
Folds a utility tree representation into this tree.
paramIndex: Index of output parameter to merge with.
tree: Tree to merge

Grasshopper.Kernel.IGH_DataAccess.SetDataTree(System.Int32,Grasshopper.Kernel.Data.IGH_Structure)
Folds a utility tree representation into this tree.
paramIndex: Index of output parameter to merge with.
tree: Tree to merge

Grasshopper.Kernel.IGH_DataAccess.BlitData``1(System.Int32,Grasshopper.Kernel.Data.GH_Structure{``0},System.Boolean)
Creates a direct copy of an existing data structure.
The existing generic instance must of the exact same type as the target parameter.
Type specified for GH_Structure(Of Q) comparison.
paramIndex: Index of output parameter.
tree: Parameter whose data to blit
overwrite: If true, any existing data will be removed.

Grasshopper.Kernel.IGH_DataAccess.GetData``1(System.Int32,``0@)
Retrieve data from an input parameter during GH_Component.SolveInstance().
Type of the data to retrieve.
If the data type does not match the parameter type,
a conversion will be attempted.
Index: Index of input parameter from which to retrieve data.
Destination: Destination instance of type T in which data will be stored if successful.
Destination can be a null reference.
Returns: True on success, false on failure.

Grasshopper.Kernel.IGH_DataAccess.GetData``1(System.String,``0@)
Retrieve data from an input parameter during GH_Component.SolveInstance().
Type of the data to retrieve.
If the data type does not match the parameter type,
a conversion will be attempted.
Name: Name of input parameter from which to retrieve data.
Destination: Destination instance of type T in which data will be stored if successful.
Destination can be a null reference.
Returns: True on success, false on failure.
Remarks: Parameter access by index is faster, consider using the other overload if possible.

Grasshopper.Kernel.IGH_DataAccess.GetDataList``1(System.Int32,System.Collections.Generic.List{``0})
Retrieve an entire list of data from an input parameter during GH_Component.SolveInstance().
Type of the data to retrieve.
If the data type does not match the parameter type,
a conversion will be attempted.
Index: Index of input parameter from which to retrieve data.
List: The data list will be appended to the supplied List.
List must not be a null reference.
Returns: True on success, false on failure.

Grasshopper.Kernel.IGH_DataAccess.GetDataList``1(System.String,System.Collections.Generic.List{``0})
Retrieve an entire list of data from an input parameter during GH_Component.SolveInstance().
Type of the data to retrieve.
If the data type does not match the parameter type,
a conversion will be attempted.
Name: Name of input parameter from which to retrieve data.
List: The data list will be appended to the supplied List.
List must not be a null reference.
Returns: True on success, false on failure.\
Remarks: Parameter access by index is faster, consider using the other overload if possible.

Grasshopper.Kernel.IGH_DataAccess.GetDataTree``1(System.Int32,Grasshopper.Kernel.Data.GH_Structure{``0}@)
Retrieve an entire data tree from an input parameter during GH_Component.SolveInstance().
Type of the data to retrieve. Must be identical to the type stored in the parameter.
Index: Index of input parameter from which to retrieve data.
Tree: The data tree target. The current value will be overwritten, you should probably pass in a null.
Returns: True on success, false on failure.

Grasshopper.Kernel.IGH_DataAccess.GetDataTree``1(System.String,Grasshopper.Kernel.Data.GH_Structure{``0}@)
Retrieve an entire data tree from an input parameter during GH_Component.SolveInstance().
Type of the data to retrieve. Must be identical to the type stored in the parameter.
Name: Name of input parameter from which to retrieve data.
Tree: The data tree target. The current value will be overwritten, you should probably pass in a null.
Returns: True on success, false on failure.
Remarks: Parameter access by index is faster, consider using the other overload if possible.