Grasshopper.GUI.Theme.GH_BackgroundSettings.Style
Canvas monochromatic flag. If True, the canvas background is a solid colour.

Grasshopper.GUI.Theme.GH_BackgroundSettings.Hatch
Background hatch brush style. This property is only used if BackgroundStyle is set to GH_ThemeBackgroundStyle.Hatch.

Grasshopper.GUI.Theme.GH_BackgroundSettings.Colour1
First background colour. Depending on the background style, this colour is used in different ways.

Grasshopper.GUI.Theme.GH_BackgroundSettings.Colour2
Second background colour. Depending on the background style, this colour is used in different ways.