Grasshopper.Kernel.GH_TaskCapableComponent`1
Abstract implementation of IGH_TaskCapableComponent. Inherit from this class
instead of implementing IGH_TaskCapableComponent directly.

Grasshopper.Kernel.GH_TaskCapableComponent`1.#ctor
Custom blank constructor for naughty components.

Grasshopper.Kernel.GH_TaskCapableComponent`1.#ctor(System.String,System.String,System.String,System.String,System.String)
Constructor for this component. This function will call the PostConstructor which will initialize the parameters
name: The name of this component. Keep it short, single words are best.
nickname: The abbreviation of this component. Keep it short, 1~5 character words are best.
description: The description of this component. Be succinct but clear. You can supply whole sentences.
category: The category of this component. The category controls in which tab the component will end up.
subCategory: the SubCategory for this component. The SubCategory controls in which panel the component will end up.

Grasshopper.Kernel.GH_TaskCapableComponent`1.GetSolveResults(Grasshopper.Kernel.IGH_DataAccess,`0@)
Call this method to await the associated task and retrieve its data.
access: Access object identifying the task.
data: Data (if any) will be returned here.
Returns: If true, the data was successfully retrieved and can be assigned to outputs immediately.
If false, the data was not found and needs to be calculated by the caller.

Grasshopper.Kernel.GH_TaskCapableComponent`1.UseTasks
Returns True if the component is set to support tasks. Components can have this
feature turned on/off. Note that even if UseTasks returns True, there is a chance
that a multipass task based solution may not be invoked depending on if multiple
calls need to be made during enumeration. You must pay attention to the value of
InPreSolve during SolveInstance.
The set version of this property can be called by the framework if we want to
provide a technique to globally turn on/off task support for all components in
a definition.

Grasshopper.Kernel.GH_TaskCapableComponent`1.SerializeUseTasks
Gets or sets whether the UseTasks value ought to be serialized.

Grasshopper.Kernel.GH_TaskCapableComponent`1.InPreSolve
Is set to True by the framework right before a "use tasks" pass is made on
SolveIntance calls. When True, SolveInstance should be using Tasks to start
calculations on input data. When False, SolveInstance should be setting the
output data by either using the result of a task or directly computing the
results.

Grasshopper.Kernel.GH_TaskCapableComponent`1.RequestTaskCancellation
Called by the framework when solving has been interrupted and tasks do not
need to complete.