Grasshopper.Rhinoceros.ModelContent.Attributes.Path
Full content path in 'Root::Parent::Name' format if is nested.
Returns:

Grasshopper.Rhinoceros.ModelContent.Attributes.Parent
Path of the parent element in 'Root::Parent' format if nested.
Remarks: Empty string in case it is not nested.
Returns:

Grasshopper.Rhinoceros.ModelContent.Attributes.Name
The last component of the element Path.
Remarks: Just 'Name' in case it is nested like 'Root::Parent::Name'.
Returns: