Grasshopper.Kernel.GH_Component.GH_InputParamManager
This class is used during Component construction to add input parameters.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.ParamCount
Returns the number of input parameters already part of this component.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Param(System.Int32)
Gets the input parameter at the given index.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.HideParameter(System.Int32)
Hide a specific input parameter. If the parameter at the given index implements IGH_PreviewObject
then the Hidden flag will be set to True. Otherwise, nothing will happen.
index: Index of parameter to hide.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.RegisterParam(Grasshopper.Kernel.IGH_Param)
Generic parameter registration. This class provides methods to register standard parameters,
but if you have a custom type you have to use this generic function.
param: The parameter to add.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.RegisterParam(Grasshopper.Kernel.IGH_Param,System.String,System.String,System.String)
Generic parameter registration. This class provides methods to register standard parameters,
but if you have a custom type you have to use this generic function.
new_param: The parameter to add.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks: The parameter will not be a list parameter

Grasshopper.Kernel.GH_Component.GH_InputParamManager.RegisterParam(Grasshopper.Kernel.IGH_Param,System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Generic parameter registration. This class provides methods to register standard parameters,
but if you have a custom type you have to use this generic function.
new_param: The parameter to add.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access type. This affects the DataMatching behaviour.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_PointParam(System.String,System.String,System.String)
Register a new 3D point param with no default coordinate.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_PointParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D point param with no default coordinate.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access type. This affects the DataMatching behaviour.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_PointParam(System.String,System.String,System.String,Rhino.Geometry.Point3d)
Register a new 3D point param with a single default coordinate.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default coordinate

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_PointParam(System.String,System.String,System.String,Rhino.Geometry.Point3d,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D point param with a single default coordinate.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default coordinate.
access: Parameter access type. This affects the DataMatching behaviour.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_PointParam(System.String,System.String,System.String,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D point param with multiple default coordinates.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default coordinates.
access: Parameter access type. This affects the DataMatching behaviour.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_VectorParam(System.String,System.String,System.String)
Register a new 3D vector param with no default value
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_VectorParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D vector param with no default value
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access type. This affects the DataMatching behaviour.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_VectorParam(System.String,System.String,System.String,Rhino.Geometry.Vector3d)
Register a new 3D vector param with a default value
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default vector.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_VectorParam(System.String,System.String,System.String,Rhino.Geometry.Vector3d,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D vector param with a default value
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default vector.
access: Parameter access type. This affects the DataMatching behaviour.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_FieldParam(System.String,System.String,System.String)
Register a new field parameter.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_FieldParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new field parameter.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access type. This affects the DataMatching behaviour.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_MatrixParam(System.String,System.String,System.String)
Register a new matrix parameter.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_MatrixParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new matrix parameter.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
access: Parameter access type. This affects the DataMatching behaviour.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_PlaneParam(System.String,System.String,System.String)
Register a new 3D vector param with no default value
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_PlaneParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D vector param with no default value
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_PlaneParam(System.String,System.String,System.String,Rhino.Geometry.Plane)
Register a new 3D vector param with a default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default plane

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_PlaneParam(System.String,System.String,System.String,Rhino.Geometry.Plane,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D vector param with a default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default plane.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_BoxParam(System.String,System.String,System.String)
Register a new 3D box param with no default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_BoxParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D box param with no default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_BoxParam(System.String,System.String,System.String,Rhino.Geometry.Box)
Register a new 3D box param with a default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default box

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_BoxParam(System.String,System.String,System.String,Rhino.Geometry.Box,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D box param with a default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Default: The default box.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_LineParam(System.String,System.String,System.String)
Register a new 3D line param with no default value
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_LineParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D line param with no default value
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_LineParam(System.String,System.String,System.String,Rhino.Geometry.Line)
Register a new 3D line param with a default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default line.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_LineParam(System.String,System.String,System.String,Rhino.Geometry.Line,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D line param with a default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default line.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_CircleParam(System.String,System.String,System.String)
Register a new 3D circle param with no default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_CircleParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D circle param with no default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_CircleParam(System.String,System.String,System.String,Rhino.Geometry.Circle)
Register a new 3D circle param with a default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default circle.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_CircleParam(System.String,System.String,System.String,Rhino.Geometry.Circle,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D circle param with a default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default circle.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_RectangleParam(System.String,System.String,System.String)
Register a new 3D rectangle param with no default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_RectangleParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D rectangle param with no default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_RectangleParam(System.String,System.String,System.String,Rhino.Geometry.Rectangle3d)
Register a new 3D rectangle param with a default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default rectangle.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_RectangleParam(System.String,System.String,System.String,Rhino.Geometry.Rectangle3d,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D rectangle param with a default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default rectangle.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_ArcParam(System.String,System.String,System.String)
Register a new 3D arc param with no default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_ArcParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D arc param with no default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_ArcParam(System.String,System.String,System.String,Rhino.Geometry.Arc)
Register a new 3D arc param with a default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default arc.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_ArcParam(System.String,System.String,System.String,Rhino.Geometry.Arc,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D arc param with a default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default arc.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_CurveParam(System.String,System.String,System.String)
Register a new 3D curve param.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_CurveParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D curve param.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_SurfaceParam(System.String,System.String,System.String)
Register a new 3D surface param. Surfaces are Breps can thus be trimmed.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_SurfaceParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D surface param. Surfaces are Breps can thus be trimmed.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_BRepParam(System.String,System.String,System.String)
Register a new 3D Brep param.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_BRepParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D Brep param.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_MeshParam(System.String,System.String,System.String)
Register a new 3D Mesh param.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_MeshParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D Mesh param.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_MeshFaceParam(System.String,System.String,System.String)
Register a new 3D Mesh face param.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_MeshFaceParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D Mesh face param.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_GeometryParam(System.String,System.String,System.String)
Register a new 3D geometry param. This parameter is useful for transform components etc.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_GeometryParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new 3D geometry param. This parameter is useful for transform components etc.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_GroupParam(System.String,System.String,System.String)
Register a new geometric group param.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_GroupParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new geometric group param.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_BooleanParam(System.String,System.String,System.String)
Register a new Boolean primitive param with no default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_BooleanParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new Boolean primitive param with no default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_BooleanParam(System.String,System.String,System.String,System.Boolean)
Register a new Boolean primitive param with a default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default value.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_BooleanParam(System.String,System.String,System.String,System.Boolean,Grasshopper.Kernel.GH_ParamAccess)
Register a new Boolean primitive param with a default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default value.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_IntervalParam(System.String,System.String,System.String)
Register a new Interval param with no default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_IntervalParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new Interval param with no default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_IntervalParam(System.String,System.String,System.String,Rhino.Geometry.Interval)
Register a new OnInterval param with a default value
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default value

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_IntervalParam(System.String,System.String,System.String,Rhino.Geometry.Interval,Grasshopper.Kernel.GH_ParamAccess)
Register a new OnInterval param with a default value
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default value

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_2DIntervalParam(System.String,System.String,System.String)
Register a new two-dimensional Interval param
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_2DIntervalParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new two-dimensional Interval param
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_TransformParam(System.String,System.String,System.String)
Register a new Transform param
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_TransformParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new Transform param
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_IntegerParam(System.String,System.String,System.String)
Register a new integer primitive param. This parameter type includes an expression parser.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_IntegerParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new integer primitive param. This parameter type includes an expression parser.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_IntegerParam(System.String,System.String,System.String,System.Int32)
Register a new integer primitive param with a default value. This parameter type includes an expression parser.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default value.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_IntegerParam(System.String,System.String,System.String,System.Int32,Grasshopper.Kernel.GH_ParamAccess)
Register a new integer primitive param with a default value. This parameter type includes an expression parser.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default value.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_DoubleParam(System.String,System.String,System.String)
Register a new Double primitive param with no default value. This parameter type includes an expression parser.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_DoubleParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new Double primitive param with no default value. This parameter type includes an expression parser.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_DoubleParam(System.String,System.String,System.String,System.Double)
Register a new Double primitive param with a default value. This parameter type includes an expression parser.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default value.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_DoubleParam(System.String,System.String,System.String,System.Double,Grasshopper.Kernel.GH_ParamAccess)
Register a new Double primitive param with a default value. This parameter type includes an expression parser.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default value.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_ComplexParam(System.String,System.String,System.String)
Register a new Complex primitive param with no default value. This parameter type includes an expression parser.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_ComplexParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new Complex primitive param with no default value. This parameter type includes an expression parser.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_ComplexParam(System.String,System.String,System.String,Grasshopper.Kernel.Types.GH_ComplexNumber)
Register a new Complex primitive param with a default value. This parameter type includes an expression parser.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Default: The default value.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_ComplexParam(System.String,System.String,System.String,Grasshopper.Kernel.Types.GH_ComplexNumber,Grasshopper.Kernel.GH_ParamAccess)
Register a new Complex primitive param with a default value. This parameter type includes an expression parser.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Default: The default value.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_StringParam(System.String,System.String,System.String)
Register a new string primitive param with no default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_StringParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new string primitive param with no default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_StringParam(System.String,System.String,System.String,System.String)
Register a new string primitive param with a default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default value.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_StringParam(System.String,System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new string primitive param with a default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default value.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_ScriptParam(System.String,System.String,System.String,System.Boolean)
Register a new Script Variable param.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
bIsList: If True, the parameter will be a list parameter which affects the data-matching algorithms

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_ColourParam(System.String,System.String,System.String)
Register a new colour primitive param.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_ColourParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new colour primitive param.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_ColourParam(System.String,System.String,System.String,System.Drawing.Color)
Register a new colour primitive param with a default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default value.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_ColourParam(System.String,System.String,System.String,System.Drawing.Color,Grasshopper.Kernel.GH_ParamAccess)
Register a new colour primitive param with a default value.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
default: The default value.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_PathParam(System.String,System.String,System.String)
Register a new Data Structure path param.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_PathParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new Data Structure path param.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_GenericParam(System.String,System.String,System.String)
Register a new generic parameter (contains Object type). Generic parameters are sometimes not capable of duplicating
data, so use these with caution.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Register_GenericParam(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Register a new generic parameter (contains Object type). Generic parameters are sometimes not capable of duplicating
data, so use these with caution.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddParameter(Grasshopper.Kernel.IGH_Param)
Generic parameter addition. If you cannot use one of the utility methods provided
by this class, you can register a customized parameter using this method.
param: The parameter to add.
Returns: Index of the newly added parameter.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddParameter(Grasshopper.Kernel.IGH_Param,System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Generic parameter addition. If you cannot use one of the utility methods provided
by this class, you can register a customized parameter using this method.
param: The parameter to add.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
Returns: Index of the newly added parameter.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddPointParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a 3D Point parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddPointParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess,Rhino.Geometry.Point3d)
Register a new 3D point param with a single default coordinate.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default: A default value to store in the parameter Persistent Data.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddPointParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Register a new 3D point param with multiple default coordinates.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default: A collection of default values to store in the parameter Persistent Data.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddVectorParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a 3D Vector parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddVectorParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess,Rhino.Geometry.Vector3d)
Add a 3D Vector parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default: A default value to store in the parameter Persistent Data.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddFieldParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Field parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddMatrixParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Matrix parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddTransformParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Transformation parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddPlaneParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a 3D Plane parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddPlaneParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess,Rhino.Geometry.Plane)
Add a 3D Plane parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default: A default value to store in the parameter Persistent Data.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddBoxParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a 3D Box parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddBoxParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess,Rhino.Geometry.Box)
Add a 3D Box parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default: A default value to store in the parameter Persistent Data.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddLineParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a 3D Line parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddLineParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess,Rhino.Geometry.Line)
Add a 3D Line parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default: A default value to store in the parameter Persistent Data.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddCircleParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a 3D Circle parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddCircleParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess,Rhino.Geometry.Circle)
Add a 3D Circle parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default: A default value to store in the parameter Persistent Data.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddRectangleParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a 3D Rectangle parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddRectangleParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess,Rhino.Geometry.Rectangle3d)
Add a 3D Rectangle parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default: A default value to store in the parameter Persistent Data.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddArcParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a 3D Arc parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddArcParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess,Rhino.Geometry.Arc)
Add a 3D Arc parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default: A default value to store in the parameter Persistent Data.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddCurveParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a 3D Curve parameter to the input list of this component.
Curve parameters can handle all curve types (Lines, Polylines, Circles, Arcs, NurbsCurves etc.)
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddSurfaceParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a 3D Surface parameter to the input list of this component.
Surface parameters can handle both trimmed and untrimmed single-faced Breps.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddBrepParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a 3D Brep parameter to the input list of this component.
Brep parameters can handle both trimmed and untrimmed single or multi-faced Breps.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddSubDParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a 3D Sub-D parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddMeshParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a 3D Mesh parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddMeshFaceParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a topological MeshFace parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddGeometryParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a generic 3D Geometry parameter to the input list of this component.
Geometry parameters can handle all types that represent actual shapes.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddGroupParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Transform Group parameter to the input list of this component.
Groups are collections of geometry that are transformed as one, they are not the same as Rhino groups.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddBooleanParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Boolean parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddBooleanParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess,System.Boolean)
Add a Boolean parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default: A default value to store in the parameter Persistent Data.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddBooleanParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess,System.Collections.Generic.IEnumerable{System.Boolean})
Add a Boolean parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default: A collection of default values to store in the parameter Persistent Data.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddIntegerParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Integer parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddIntegerParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess,System.Int32)
Add a Integer parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default: A default value to store in the parameter Persistent Data.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddIntegerParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess,System.Collections.Generic.IEnumerable{System.Int32})
Add a Integer parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default: A collection of default values to store in the parameter Persistent Data.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddNumberParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a floating point Number parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddNumberParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess,System.Double)
Add a floating point Number parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default: A default value to store in the parameter Persistent Data.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddNumberParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess,System.Collections.Generic.IEnumerable{System.Double})
Add a floating point Number parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default: A collection of default values to store in the parameter Persistent Data.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddAngleParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a floating point Number parameter to the input list of this component.
The parameter will be aware that it is representing angles.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddAngleParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess,System.Double)
Add a floating point Number parameter to the input list of this component.
The parameter will be aware that it is representing angles.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default: A default value to store in the parameter Persistent Data.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddAngleParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess,System.Collections.Generic.IEnumerable{System.Double})
Add a floating point Number parameter to the input list of this component.
The parameter will be aware that it is representing angles.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default: A collection of default values to store in the parameter Persistent Data.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddComplexNumberParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Complex Number parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddComplexNumberParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess,Grasshopper.Kernel.Types.GH_ComplexNumber)
Add a Complex Number parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default: A default value to store in the parameter Persistent Data.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddTimeParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Time parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddTimeParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess,System.DateTime)
Add a Time parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default: A default value to store in the parameter Persistent Data.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddCultureParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Cultue parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddCultureParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess,System.Globalization.CultureInfo)
Add a Culture parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default: A default value to store in the parameter Persistent Data.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddColourParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add an ARGB Colour parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddColourParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess,System.Drawing.Color)
Add an ARGB Colour parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default: A default value to store in the parameter Persistent Data.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddColourParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess,System.Collections.Generic.IEnumerable{System.Drawing.Color})
Add an ARGB Colour parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default: A collection of default values to store in the parameter Persistent Data.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddTextParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Text parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddTextParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess,System.String)
Add a Text parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default: A default value to store in the parameter Persistent Data.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddTextParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess,System.Collections.Generic.IEnumerable{System.String})
Add a Text parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default: A collection of default values to store in the parameter Persistent Data.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddIntervalParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add an Interval (i.e. numeric domain) parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddIntervalParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess,Rhino.Geometry.Interval)
Add an Interval (i.e. numeric domain) parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default: A default value to store in the parameter Persistent Data.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddIntervalParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess,System.Collections.Generic.IEnumerable{Rhino.Geometry.Interval})
Add an Interval (i.e. numeric domain) parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.
default: A collection of default values to store in the parameter Persistent Data.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddInterval2DParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add an Interval2D (i.e. uv domain) parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddScriptVariableParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Script Variable parameter to the input list of this component.
Script variable parameters are used almost exclusively in VB/C#/Python components so you probably don't want this one.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddPathParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Data Path parameter to the input list of this component.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.AddGenericParameter(System.String,System.String,System.String,Grasshopper.Kernel.GH_ParamAccess)
Add a Generic parameter to the input list of this component.
Generic parameters can handle all types of data.
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear, single sentences are best.
access: Parameter access type. You must provide a correct access code in order to use GetData(), GetDataList() or GetDataTree() respectively.