Grasshopper.Kernel.GH_BakeUtility
A utility class for baking. We heavily recommend you use this for any baking,
as it handles invalid objects correctly.

Grasshopper.Kernel.GH_BakeUtility.#ctor(Grasshopper.Kernel.GH_Document)
Create a new baker.
document: Grasshopper document, if any.

Grasshopper.Kernel.GH_BakeUtility.BakedCount
Gets the number of successful baking operations.

Grasshopper.Kernel.GH_BakeUtility.InvalidCount
Gets the number of invalid objects encountered.

Grasshopper.Kernel.GH_BakeUtility.BakedIds
Gets all collected object ids.

Grasshopper.Kernel.GH_BakeUtility.BakeObject(System.Object,Rhino.DocObjects.ObjectAttributes,Rhino.RhinoDoc)
Try and bake a single object.
obj: Object to bake, must at least implement IGH_BakeAwareData.
att: Object attributes.
Returns: True if object was baked.

Grasshopper.Kernel.GH_BakeUtility.BakeObjects(System.Collections.IEnumerable,Rhino.DocObjects.ObjectAttributes,Rhino.RhinoDoc)
Bake a bunch of objects.
objects: Objects to bake.
att: Attributes.
doc: Document.
Returns: Number of successful bake operations.

Grasshopper.Kernel.GH_BakeUtility.EncodeDocument
Encode the document (if it exists).