Grasshopper.Kernel.GH_DataMapping
Enumerates all parameter data mapping types.

Grasshopper.Kernel.GH_DataMapping.None
Data is not mapped.

Grasshopper.Kernel.GH_DataMapping.Flatten
Data is flattened inside this parameter.

Grasshopper.Kernel.GH_DataMapping.Graft
Data is grafted inside this parameter.