Grasshopper.GUI.HTML.GH_HtmlWriter
General purpose HTML writer.

Grasshopper.GUI.HTML.GH_HtmlWriter.Title
Gets or sets the HTML document title.

Grasshopper.GUI.HTML.GH_HtmlWriter.CssStyleSheet
Gets the internal Css style sheet data.

Grasshopper.GUI.HTML.GH_HtmlWriter.ComposeHTMLDocument(Grasshopper.GUI.HTML.GH_CssStyle[])
Compose a complete html document based on the current Title, CSS style sheet and html body content.
cssBodyStyles: CSS styles to apply to the Body tag.
Returns: A string representing the full html document.

Grasshopper.GUI.HTML.GH_HtmlWriter.ComposeHTMLDocument(System.String[])
Compose a complete html document based on the current Title, CSS style sheet and html body content.
cssBodyStyles: CSS styles to apply to the Body tag.
Returns: A string representing the full html document.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteComment(System.String)
Write a new comment to the Html document.
comment:

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteLineBreak
Write a line break into the Html document.
Ideally you should achieve formatting using div tags, not line breaks.
Remarks:

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteHorizontalRule
Write a horizontal rule into the Html document.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteHorizontalRule(System.String[])
Write a horizontal rule into the Html document.
cssClasses: CSS style names to apply to this tag.
These styles must be part of the document style sheet before the final Html is composed.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteHorizontalRule(Grasshopper.GUI.HTML.GH_CssStyle[])
Write a horizontal rule into the Html document.
cssClasses: CSS styles to apply to this tag.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteText(System.String)
Write a section of text to the Html document.
text: Text to write.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteText(System.String,Grasshopper.GUI.HTML.GH_HtmlTextProperties)
Write a section of text to the Html document.
text: Text to write.
properties: Standard Html formatting tag.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteText(System.String,System.String[])
Write a section of text to the Html document.
text: Text to write.
cssClasses: CSS style names to apply to this tag.
These styles must be part of the document style sheet before the final Html is composed.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteText(System.String,Grasshopper.GUI.HTML.GH_CssStyle[])
Write a section of text to the Html document.
text: Text to write.
cssClasses: CSS styles to apply to this tag.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteLink(System.String,System.String)
Write a link to the Html document.
target: Link target (url)
name: Link text.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteLink(System.String,System.String,System.String[])
Write a link to the Html document.
target: Link target (url)
name: Link text.
cssClasses: CSS style names to apply to this tag.
These styles must be part of the document style sheet before the final Html is composed.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteLink(System.String,System.String,Grasshopper.GUI.HTML.GH_CssStyle[])
Write a link to the Html document.
target: Link target (url)
name: Link text.
cssClasses: CSS styles to apply to this tag.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteDivStart
Write the start of a Div block.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteDivStart(System.String[])
Write the start of a Div block.
cssClasses: CSS style names to apply to this tag.
These styles must be part of the document style sheet before the final Html is composed.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteDivStart(Grasshopper.GUI.HTML.GH_CssStyle[])
Write the start of a Div block.
cssClasses: CSS styles to apply to this tag.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteDivEnd
Write the end of a Div block.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteHorizontalGradient(System.Drawing.Color,System.Drawing.Color,System.Int32,System.Int32)
Write a collection of horizontal div blocks with a gradient colour.
top: Colour for topmost section.
bottom: Colour for bottommost section.
steps: Number of gradient steps.
stepHeight: Height (in pixels) for each step.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteBlankSpace(System.Int32)
Write a blank space.
height: Height (in pixels) of blank space.

Grasshopper.GUI.HTML.GH_HtmlWriter.WritePreStart
Write the start of a Preformatted text block.

Grasshopper.GUI.HTML.GH_HtmlWriter.WritePreStart(System.String[])
Write the start of a Preformatted text block.
cssClasses: CSS style names to apply to this tag.
These styles must be part of the document style sheet before the final Html is composed.

Grasshopper.GUI.HTML.GH_HtmlWriter.WritePreStart(Grasshopper.GUI.HTML.GH_CssStyle[])
Write the start of a Preformatted text block.
cssClasses: CSS styles to apply to this tag.

Grasshopper.GUI.HTML.GH_HtmlWriter.WritePreEnd
Write the end of a Preformatted text block.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteSpanStart
Write the start of a Span section.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteSpanStart(System.String[])
Write the start of a Span section.
cssClasses: CSS style names to apply to this tag.
These styles must be part of the document style sheet before the final Html is composed.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteSpanStart(Grasshopper.GUI.HTML.GH_CssStyle[])
Write the start of a Span section.
cssClasses: CSS styles to apply to this tag.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteSpanEnd
Write the end of a Span section.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteUnorderedListStart
Write the start an unordered list section.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteUnorderedListStart(System.String[])
Write the start an unordered list section.
cssClasses: CSS style names to apply to this tag.
These styles must be part of the document style sheet before the final Html is composed.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteUnorderedListStart(Grasshopper.GUI.HTML.GH_CssStyle[])
Write the start an unordered list section.
cssClasses: CSS styles to apply to this tag.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteOrderedListStart(System.Int32)
Write the start an unordered list section.
start: First number in list.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteOrderedListStart(System.Int32,System.String[])
Write the start an unordered list section.
start: First number in list.
cssClasses: CSS style names to apply to this tag.
These styles must be part of the document style sheet before the final Html is composed.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteOrderedListStart(System.Int32,Grasshopper.GUI.HTML.GH_CssStyle[])
Write the start an unordered list section.
start: First number in list.
cssClasses: CSS styles to apply to this tag.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteListEnd
Write the end of a List section.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteListItemStart
Write the start of a list item element.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteListItemStart(System.String[])
Write the start of a list item element.
cssClasses: CSS style names to apply to this tag.
These styles must be part of the document style sheet before the final Html is composed.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteListItemStart(Grasshopper.GUI.HTML.GH_CssStyle[])
Write the start of a list item element.
cssClasses: CSS styles to apply to this tag.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteListItemEnd
Write the end of a list item element.

Grasshopper.GUI.HTML.GH_HtmlWriter.WriteListItem(System.String)
Write a complete list item.
itemContent: Item content.