Grasshopper.Kernel.Expressions.GH_VariantType
Lists all possible variable types supported in the Grasshopper Expression Parser.

Grasshopper.Kernel.Expressions.GH_VariantType.unknown
Unknown type.

Grasshopper.Kernel.Expressions.GH_VariantType.null
Variant is a null reference.

Grasshopper.Kernel.Expressions.GH_VariantType.bool
Variant is of type System.Boolean

Grasshopper.Kernel.Expressions.GH_VariantType.int
Variant is of type System.Int32

Grasshopper.Kernel.Expressions.GH_VariantType.double
Variant is of type System.Double

Grasshopper.Kernel.Expressions.GH_VariantType.string
Variant is of type System.String

Grasshopper.Kernel.Expressions.GH_VariantType.point
Variant is of type Rhino.Geometry.Point3d

Grasshopper.Kernel.Expressions.GH_VariantType.plane
Variant is of type Rhino.Geometry.Plane

Grasshopper.Kernel.Expressions.GH_VariantType.complex
Variant is of type Grasshopper.Types.GH_Complex