Grasshopper.Kernel.GH_LibraryLicense
Enumerates the possible library types for GHA assemblies.

Grasshopper.Kernel.GH_LibraryLicense.unset
Unset library type. You should not return this value.

Grasshopper.Kernel.GH_LibraryLicense.expired
The license for this library has expired and it can no longer be used.

Grasshopper.Kernel.GH_LibraryLicense.alpha
This library is an Alpha release.

Grasshopper.Kernel.GH_LibraryLicense.beta
This library is a Beta release.

Grasshopper.Kernel.GH_LibraryLicense.free
This library is freeware.

Grasshopper.Kernel.GH_LibraryLicense.opensource
This library is distributed under an open source license.

Grasshopper.Kernel.GH_LibraryLicense.trial
This library is running in Trial mode.

Grasshopper.Kernel.GH_LibraryLicense.commercial
This library is running under a Commercial license.

Grasshopper.Kernel.GH_LibraryLicense.educational
This library is running under an Educational license.

Grasshopper.Kernel.GH_LibraryLicense.developer
This library is running under a Developer license.

Grasshopper.Kernel.GH_LibraryLicense.reseller
This library is running under a Reseller license.

Grasshopper.Kernel.GH_LibraryLicense.other
Undefined library type.