Grasshopper.GUI.Gradient.GH_Grip
Represents a grip in a gradient.
A grip defines both where and how the colour of a gradient changes.

Grasshopper.GUI.Gradient.GH_Grip.GripId
Gets the Grip ID.

Grasshopper.GUI.Gradient.GH_Grip.MutateId
Create a new grip ID.

Grasshopper.GUI.Gradient.GH_Grip.IsValid
Gets whether this grip is valid. A valid grip must have a
non-empty Id and a non-NaN parameter.

Grasshopper.GUI.Gradient.GH_Grip.Selected
Gets or sets whether this grip is selected.
Selection state is not (de)serialized.

Grasshopper.GUI.Gradient.GH_Grip.Parameter
Gets or sets the numeric parameter of the grip.

Grasshopper.GUI.Gradient.GH_Grip.ColourLeft
Gets the colour to the left of this grip.

Grasshopper.GUI.Gradient.GH_Grip.ColourRight
Gets the colour to the right of this grip.

Grasshopper.GUI.Gradient.GH_Grip.Type
Gets whether the colour across this grip is smooth.