Grasshopper.Kernel.GH_Component.GH_ParamManager


Grasshopper.Kernel.GH_Component.GH_ParamManager.FixUpParameter(Grasshopper.Kernel.IGH_Param,System.String,System.String,System.String)
Assign some common fields to a parameter object.

Grasshopper.Kernel.GH_Component.GH_ParamManager.ParamCount
Gets the total number of parameters.

Grasshopper.Kernel.GH_Component.GH_ParamManager.Param(System.Int32)
Gets the parameter at the given index.

Grasshopper.Kernel.GH_Component.GH_ParamManager.HideParameter(System.Int32)
Hide a specific parameter. If the parameter at the given index implements IGH_PreviewObject
then the Hidden flag will be set to True. Otherwise, nothing will happen.
index: Index of parameter to hide.