Grasshopper.GUI.Canvas.Interaction.GH_RewireInteraction.m_target
New parameter for all connections.

Grasshopper.GUI.Canvas.Interaction.GH_RewireInteraction.m_source
Parameter that supplies connections.

Grasshopper.GUI.Canvas.Interaction.GH_RewireInteraction.m_input
If True, the source input is used, otherwise the output.

Grasshopper.GUI.Canvas.Interaction.GH_RewireInteraction.IsValid
Gets the validity of this rewire interaction.