Grasshopper.Kernel.Types.GH_PointRefData.SetCurveParam(Rhino.Geometry.Curve,System.Double)
Set the curve reference parameter based on the value of m_RefType and the curve parameter
c: The curve to act on
t: The parameter on the curve domain which is to be translated
Returns: True on success

Grasshopper.Kernel.Types.GH_PointRefData.SetSurfaceParam(Rhino.Geometry.Surface,System.Double,System.Double)
Set the surface reference parameters
srf: The surface to act on
u: The parameter on the surface u domain
v: The parameter on the surface v domain
Returns: True on success

Grasshopper.Kernel.Types.GH_PointRefData.EvCurveParam(Rhino.Geometry.Curve)
Evaluate this reference structure when applied to a curve
c: The curve to act on
Returns: The parameter on the curve that corresponds to this reference, or NaN
Remarks: Evaluation depends on the value of m_RefType

Grasshopper.Kernel.Types.GH_PointRefData.EvCurve(Rhino.Geometry.Curve)
Evaluate this reference structure when applied to a curve
c: The curve to act on
Returns: The point on the curve if successful, or Nothing
Remarks: Evaluation depends on the value of m_RefType

Grasshopper.Kernel.Types.GH_PointRefData.EvSurface(Rhino.Geometry.Surface)
Evaluate this reference structure when applied to the surface
s: The surface to act on.
Returns: A point if successful, or Nothing
Remarks: Surface is evaluated at normalized {uv} parameters