Grasshopper.GUI.IGH_Embeddable
Implement this interface in your custom control if you want to be called before a menu commits or cancels.

Grasshopper.GUI.IGH_Embeddable.PrepareForCommit
This will be called prior to a Commit operation.

Grasshopper.GUI.IGH_Embeddable.PrepareForCancel
This will be called prior to a Cancel operation.