Grasshopper.GUI.RemotePanel.RcpIndex
Contains the indices needed to identify an item on a Remote Control Panel.

Grasshopper.GUI.RemotePanel.RcpIndex.#ctor(System.Int32,System.Int32)
Construct a new RcpIndex.
groupIndex: Index of group.
itemIndex: Index of item.

Grasshopper.GUI.RemotePanel.RcpIndex.Group
Gets the index of the group containing the object.

Grasshopper.GUI.RemotePanel.RcpIndex.Item
Gets the index of this object in the container.