Grasshopper.GUI.Ribbon.GH_LayoutItem
Represents an item on a ribbon layout.

Grasshopper.GUI.Ribbon.GH_LayoutItem.Id
Gets the ComponentID of the associated object.

Grasshopper.GUI.Ribbon.GH_LayoutItem.Selected
Gets or sets the selected state of this item.
This property is only used inside Layout Editors.

Grasshopper.GUI.Ribbon.GH_LayoutItem.Exposure
Gets the exposure (Panel segment) of this custom item.