Grasshopper.Kernel.Geometry.SpatialTrees.Coordinates3d`1
Delegate for coordinate retrieval.
Element type.
element: Element to retrieve coordinates from.
x: X coordinate of element.
y: Y coordinate of element.
z: Z coordinate of element.