Grasshopper.Kernel.GH_Conversion
Level flag for conversion algorithms.

Grasshopper.Kernel.GH_Conversion.Primary
Primary conversions only entail direct casts from identical or similar data types.

Grasshopper.Kernel.GH_Conversion.Secondary
Secondary conversions entail all implied conversions with the exception of direct casts.

Grasshopper.Kernel.GH_Conversion.Both
Indicates both Primary and Secondary