Grasshopper.GUI.GH_SliderInputMode
Enumerates all possible slider text input modes.

Grasshopper.GUI.GH_SliderInputMode.None
Text input mode is not available.

Grasshopper.GUI.GH_SliderInputMode.OnKeyDown
Text input mode will be available on keydown.

Grasshopper.GUI.GH_SliderInputMode.OnDoubleClick
Text input mode will be available upon double click.

Grasshopper.GUI.GH_SliderInputMode.All
All text input modes will be available.