Grasshopper.GUI.Canvas.GH_Canvas.GH_ImageSettings
Settings class for high-resolution image output.

Grasshopper.GUI.Canvas.GH_Canvas.GH_ImageSettings.#ctor
Create a new instance of the GH_ImageSettings class with default values.

Grasshopper.GUI.Canvas.GH_Canvas.GH_ImageSettings.#ctor(System.String)
Create a new instance of the GH_ImageSettings class.
filePath: Target location for image.

Grasshopper.GUI.Canvas.GH_Canvas.GH_ImageSettings.#ctor(System.String,System.String,System.String)
Create a new instance of the GH_ImageSettings class.
folder: Folder for target image.
filename: File name of target image.
extension: Image extension for target image.

Grasshopper.GUI.Canvas.GH_Canvas.GH_ImageSettings.Folder
Gets or sets the folder in which the target image will be saved.

Grasshopper.GUI.Canvas.GH_Canvas.GH_ImageSettings.FileName
Gets or sets the filename of the target image.

Grasshopper.GUI.Canvas.GH_Canvas.GH_ImageSettings.Extension
Gets or sets the image extension of the target image.

Grasshopper.GUI.Canvas.GH_Canvas.GH_ImageSettings.TileSize
Gets the default tile size for high-resolution export. This is a constant value.

Grasshopper.GUI.Canvas.GH_Canvas.GH_ImageSettings.Zoom
Gets or sets the zoom at which to export the high-resolution image.

Grasshopper.GUI.Canvas.GH_Canvas.GH_ImageSettings.BackColour
Gets or sets the background colour to use for the high-resolution rendering.