Grasshopper.GUI.GH_SeparatorDisplay
Enumerates all possible display modes for horizontal and vertical separators.

Grasshopper.GUI.GH_SeparatorDisplay.None
No separator is drawn.

Grasshopper.GUI.GH_SeparatorDisplay.Etched
A double line etched separator is drawn.

Grasshopper.GUI.GH_SeparatorDisplay.EtchedFading
A double line etched separator with fading extremes is drawn.

Grasshopper.GUI.GH_SeparatorDisplay.Dashed
A single line dashed separator is drawn.