Grasshopper.Kernel.Geometry.Node3Leaf
Represents a single element in a recursive Oc-tree Node structure.

Grasshopper.Kernel.Geometry.Node3Leaf.#ctor
Blank constructor

Grasshopper.Kernel.Geometry.Node3Leaf.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Box constructor. Create an empty leaf with a specific box.

Grasshopper.Kernel.Geometry.Node3Leaf.#ctor(Grasshopper.Kernel.Geometry.Node3Leaf)
Copy constructor
other: Leaf to mimic

Grasshopper.Kernel.Geometry.Node3Leaf.Nodes
Gets the indices of all nodes which are contained in this leaf.

Grasshopper.Kernel.Geometry.Node3Leaf.SubDivide(Grasshopper.Kernel.Geometry.Node3List,System.Collections.Generic.List{System.Int32},System.Int32)
Builds a subtree from a Node list.
nodes: All the nodes that are supposed to be included in this tree.
index_subset: A subset of nodes on which to perform the subdivision. Pass a null-pointer to use ALL nodes.
If the list is not null, used indices will be extracted from the list, in order to reduce the number of pointless inclusion tests.
group_limit: The number of allowed Nodes per Leaf. If a Leaf contains more than N nodes, it will subdivide.

Grasshopper.Kernel.Geometry.Node3Leaf.RemoveNode(Grasshopper.Kernel.Geometry.Node3List,System.Int32)
Remove the node with the specified tag from this leaf or any subleafs.
This method assumes that a node with a given tag occurs at most once within this subtree.
Removing nodes will not close leafs, you need to call TrimExcess() in order to remove
empty subleafs or empty nodelists.
nodes: Node data.
nodeTag: Tag of node.

Grasshopper.Kernel.Geometry.Node3Leaf.RemoveNode(Grasshopper.Kernel.Geometry.Node3List,Grasshopper.Kernel.Geometry.Node3)
Remove the specified node from this leaf or any subleafs.
This method assumes that any node occurs at most once within this subtree.
Removing nodes will not close leafs, you need to call TrimExcess() in order to remove
empty subleafs or empty nodelists.
nodes: Node data.
node: Node to remove.

Grasshopper.Kernel.Geometry.Node3Leaf.TrimExcess
Removes empty leaves, empty nodelists and nodelist capacity overflow from this leaf and all subleaves.

Grasshopper.Kernel.Geometry.Node3Leaf.x_min
Gets the left bounary of the Leaf space.

Grasshopper.Kernel.Geometry.Node3Leaf.x_max
Gets the right bounary of the Leaf space.

Grasshopper.Kernel.Geometry.Node3Leaf.y_min
Gets the bottom bounary of the Leaf space.

Grasshopper.Kernel.Geometry.Node3Leaf.y_max
Gets the top bounary of the Leaf space.

Grasshopper.Kernel.Geometry.Node3Leaf.z_min
Gets the bottom boundary of the Leaf space.

Grasshopper.Kernel.Geometry.Node3Leaf.z_max
Gets the top boundary of the Leaf space.

Grasshopper.Kernel.Geometry.Node3Leaf.x_mid
Gets the vertical center axis of the Leaf space.

Grasshopper.Kernel.Geometry.Node3Leaf.y_mid
Gets the horizontal center axis of the Leaf space.

Grasshopper.Kernel.Geometry.Node3Leaf.z_mid
Gets the z center axis of the Leaf space.

Grasshopper.Kernel.Geometry.Node3Leaf.SolveProximity(Grasshopper.Kernel.Geometry.Node3List,Grasshopper.Kernel.Geometry.Node3Proximity)
Recursive method that solves a proximity search.
nodes: Node set to search
prox: Proximity object to search with