Grasshopper.Kernel.Geometry.Node2List.NodeListSort
Represents the different sort types that a VorNodeList can maintain.

Grasshopper.Kernel.Geometry.Node2List.NodeListSort.none
No specific sorting. When nodes are added or inserted the sort is always set back to none.

Grasshopper.Kernel.Geometry.Node2List.NodeListSort.X
Nodes are sorted by ascending x-coordinate

Grasshopper.Kernel.Geometry.Node2List.NodeListSort.Y
Nodes are sorted by ascending y-coordinate

Grasshopper.Kernel.Geometry.Node2List.NodeListSort.Index
Nodes are sorted by ascending index