Grasshopper.GUI.Canvas.GH_DocDiagramPainter
This class paints diagrammatic images of a collection of objects.

Grasshopper.GUI.Canvas.GH_DocDiagramPainter.Zoom
Gets the zoom factor for this diagram.

Grasshopper.GUI.Canvas.GH_DocDiagramPainter.Size
Gets the width and height (in pixels) of this diagram image.

Grasshopper.GUI.Canvas.GH_DocDiagramPainter.Image
Gets the diagram image (only available after a call to PaintDiagram().

Grasshopper.GUI.Canvas.GH_DocDiagramPainter.IgnoreSelectedStates
Gets or sets the Ignore Selected State flag. When set to True,
selected objects are not drawn in a different colour.

Grasshopper.GUI.Canvas.GH_DocDiagramPainter.BoundingBox
Gets the 2D domain of the diagram in canvas coordinates.

Grasshopper.GUI.Canvas.GH_DocDiagramPainter.DrawingBox
Gets the 2D domain of the diagram in image coordinates.

Grasshopper.GUI.Canvas.GH_DocDiagramPainter.PaintDiagram(System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_DocumentObject},System.Int32,System.Int32)
Paint a diagram of a document.
objs: Objects to paint.
approx_size: Approximate size along each side.
inflate: Padding around the objects.
Returns: True on success, false on failure.

Grasshopper.GUI.Canvas.GH_DocDiagramPainter.PaintDiagram(System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_DocumentObject},System.Int32,System.Int32,System.Int32)
Paint a diagram of a document.
objs: Objects to paint.
mapWidth: Width (in pixels) of diagram.
mapHeight: Height (in pixels) of diagram.
inflate: Padding around the objects.
Returns: True on success, false on failure.