Grasshopper.Kernel.Graphs.IGH_Graph


Grasshopper.Kernel.Graphs.IGH_Graph.GraphChanged
This event is raised whenever the graph changes.
sender:
bIntermediate: If bIntermediate is True, more events are expected in the near future.

Grasshopper.Kernel.Graphs.IGH_Graph.EmitProxyObject
Override this function if you want to be able to edit the graph through a PropertyGrid.

Grasshopper.Kernel.Graphs.IGH_Graph.Duplicate
Returns a full duplicate (perhaps minus any cache values) of the graph.

Grasshopper.Kernel.Graphs.IGH_Graph.PrepareForUse
This method is called when a Graph is about to be displayed/used, maybe for the first time ever, maybe not.
Remarks:

Grasshopper.Kernel.Graphs.IGH_Graph.ClearCaches
This method will be called when it is suspected that all caches have gone stale.
If your graph class uses any custom caching, override this method and clear your caches.

Grasshopper.Kernel.Graphs.IGH_Graph.Grips
Gets the collection of grips that define this graph

Grasshopper.Kernel.Graphs.IGH_Graph.Name
Gets the name of the graph type

Grasshopper.Kernel.Graphs.IGH_Graph.IsValid
Gets the validity of the graph instance.

Grasshopper.Kernel.Graphs.IGH_Graph.Description
Gets the description of the graph type

Grasshopper.Kernel.Graphs.IGH_Graph.GraphTypeID
Gets the ID of the graph type

Grasshopper.Kernel.Graphs.IGH_Graph.Icon_16x16
Gets the icon associated with the graph
Remarks: Icon can be null

Grasshopper.Kernel.Graphs.IGH_Graph.ValueAt(System.Double)
Evaluates a single parameter in the unit range
t: the parameter to evaluate

Grasshopper.Kernel.Graphs.IGH_Graph.GDI_GraphPath(System.Drawing.RectangleF)
Override this function if you wish to provide a customized graphics path for the UI of the graph.
The region is only provided as a reference, the returned path points should be in unit domain coordinates.
reg: The region (in canvas coordinates) of the graph rectangle.

Grasshopper.Kernel.Graphs.IGH_Graph.Draw_PreRenderGrid(System.Drawing.Graphics,Grasshopper.Kernel.Graphs.GH_GraphContainer)
Override this function if you want to draw something behind of or instead of the default Grid.
g: Graphics object to draw with
cnt: The container that owns this graph instance and is responsible for the drawing.
Returns: If the return code is GH_GraphDrawInstruction.skip, the container will not draw the default grid.

Grasshopper.Kernel.Graphs.IGH_Graph.Draw_PostRenderGrid(System.Drawing.Graphics,Grasshopper.Kernel.Graphs.GH_GraphContainer)
Override this function if you want to draw something on top of the Graph Grid.
g: Graphics object to draw with
cnt: The container that owns this graph instance and is responsible for the drawing.

Grasshopper.Kernel.Graphs.IGH_Graph.Draw_PreRenderGraph(System.Drawing.Graphics,Grasshopper.Kernel.Graphs.GH_GraphContainer)
Override this function if you want to draw something behind of or instead of the default Graph curve
g: Graphics object to draw with
cnt: The container that owns this graph instance and is responsible for the drawing.
Returns: If the return code is GH_GraphDrawInstruction.skip, the container will not draw the default Graph curve.

Grasshopper.Kernel.Graphs.IGH_Graph.Draw_PostRenderGraph(System.Drawing.Graphics,Grasshopper.Kernel.Graphs.GH_GraphContainer)
Override this function if you want to draw something on top of the Graph curve.
g: Graphics object to draw with
cnt: The container that owns this graph instance and is responsible for the drawing.

Grasshopper.Kernel.Graphs.IGH_Graph.Draw_PreRenderGrip(System.Drawing.Graphics,Grasshopper.Kernel.Graphs.GH_GraphContainer,System.Int32)
Override this function if you want to draw something in addition to or instead of the current Grip
g: Graphics object to draw with
cnt: The container that owns this graph instance and is responsible for the drawing.
index: The index of the grip that is about to be drawn
Returns: If the return code is GH_GraphDrawInstruction.skip, the container will not draw the default grid.

Grasshopper.Kernel.Graphs.IGH_Graph.Draw_PostRenderGrip(System.Drawing.Graphics,Grasshopper.Kernel.Graphs.GH_GraphContainer,System.Int32)
Override this function if you want to draw something on top of the current Grip
g: Graphics object to draw with
cnt: The container that owns this graph instance and is responsible for the drawing.
index: The index of the grip that was just drawn

Grasshopper.Kernel.Graphs.IGH_Graph.Draw_PreRenderTags(System.Drawing.Graphics,Grasshopper.Kernel.Graphs.GH_GraphContainer)
Override this function if you want to draw something behind of or instead of the default Domain tags.
This function is called whether or not cnt.LockGrips is true
g: Graphics object to draw with
cnt: The container that owns this graph instance and is responsible for the drawing.
Returns: If the return code is GH_GraphDrawInstruction.skip, the container will not draw the default tags.

Grasshopper.Kernel.Graphs.IGH_Graph.Draw_PostRenderTags(System.Drawing.Graphics,Grasshopper.Kernel.Graphs.GH_GraphContainer)
Override this function if you want to draw something on top of the Domain tags.
This function is called whether or not cnt.LockGrips is true
g: Graphics object to draw with
cnt: The container that owns this graph instance and is responsible for the drawing.