Grasshopper.GUI.Base.GH_SliderBase
Provides Numeric slider GUI not tied to a control-handle.

Grasshopper.GUI.Base.GH_SliderBase.ControlBackColour
Gets or sets the BackColour for this slider control.

Grasshopper.GUI.Base.GH_SliderBase.ControlEdgeColour
Gets or sets the EdgeColor for this slider control.

Grasshopper.GUI.Base.GH_SliderBase.ControlShadowColour
Gets or sets the Shadow colour for this control.

Grasshopper.GUI.Base.GH_SliderBase.GripTopColour
Gets or sets the fill colour for the top edge of the slider grip.

Grasshopper.GUI.Base.GH_SliderBase.GripBottomColour
Gets or sets the fill colour for the bottom edge of the slider grip.

Grasshopper.GUI.Base.GH_SliderBase.GripEdgeColour
Gets or sets the edge colour for the slider grip.

Grasshopper.GUI.Base.GH_SliderBase.TextColour
Gets or sets the fill colour for the slider text.

Grasshopper.GUI.Base.GH_SliderBase.RailFullColour
Gets or sets the fill colour for the full portion of the rail.

Grasshopper.GUI.Base.GH_SliderBase.RailEmptyColour
Gets or sets the fill colour for the empty portion of the rail.

Grasshopper.GUI.Base.GH_SliderBase.RailDarkColour
Gets or sets the dark colour used to draw rails and ticks.

Grasshopper.GUI.Base.GH_SliderBase.RailBrightColour
Gets or sets the bright colour used to draw rails and ticks.

Grasshopper.GUI.Base.GH_SliderBase.Font
Gets or sets the font for this slider.

Grasshopper.GUI.Base.GH_SliderBase.FormatMask
Gets or sets the string format mask to use for the display.
Should contain at least one "{0}" element.

Grasshopper.GUI.Base.GH_SliderBase.RailDisplay
Gets or sets how the slider rail (or track) is drawn.

Grasshopper.GUI.Base.GH_SliderBase.GripDisplay
Gets or sets how the slider grip (or thumb) is drawn.

Grasshopper.GUI.Base.GH_SliderBase.TickDisplay
Gets or sets how the slider ticks are drawn.

Grasshopper.GUI.Base.GH_SliderBase.DrawControlBackground
Gets or sets whether the background of the slider should be drawn.

Grasshopper.GUI.Base.GH_SliderBase.DrawControlBorder
Gets or sets whether the border of the slider should be drawn.

Grasshopper.GUI.Base.GH_SliderBase.DrawControlShadows
Gets or sets whether the drop shadows of the slider should be drawn.

Grasshopper.GUI.Base.GH_SliderBase.TickCount
Gets or sets the number of ticks displayed.

Grasshopper.GUI.Base.GH_SliderBase.TickFrequency
Gets or sets the frequency of large ticks vs small ticks.

Grasshopper.GUI.Base.GH_SliderBase.ShadowSize
Gets or sets the size of the border shadow along all edges of the box.

Grasshopper.GUI.Base.GH_SliderBase.Bounds
Gets or sets the bounds of the slider.

Grasshopper.GUI.Base.GH_SliderBase.Padding
Gets or sets the padding around the slider border.

Grasshopper.GUI.Base.GH_SliderBase.GripWidth
Gets an estimate of the maximum number of pixels taken up by the grip.
This property depends on many different factors, though should remain constant
when other properties are not changed. If the Font hasn't been specified, the default
Windows.Forms.Control font is used.

Grasshopper.GUI.Base.GH_SliderBase.Grip
Gets the box of the current grip. If the slider value/limits are not set up correctly
then this rectangle may well be outside of the bounds. If the limits are coincident,
this will fail (divide by zero).

Grasshopper.GUI.Base.GH_SliderBase.Rail
Gets the shape of the rail. The height of the rectangle will be zero,
but the y-position will be rounded to integer precision.

Grasshopper.GUI.Base.GH_SliderBase.Ticks
Gets a list of all the tick offset x positions.

Grasshopper.GUI.Base.GH_SliderBase.Type
Gets or sets the accuracy type of the slider.

Grasshopper.GUI.Base.GH_SliderBase.DecimalPlaces
Gets or sets the number of decimal places allowed for floating point type sliders.
Valid values between zero and 12.

Grasshopper.GUI.Base.GH_SliderBase.Minimum
Gets or sets the lower limit of the slider.

Grasshopper.GUI.Base.GH_SliderBase.Maximum
Gets or sets the upper limit of the slider.

Grasshopper.GUI.Base.GH_SliderBase.Value
Gets or sets the value of the slider.

Grasshopper.GUI.Base.GH_SliderBase.ValueF
Gets or sets the value of the slider in single precision.

Grasshopper.GUI.Base.GH_SliderBase.NormalizedValue
Gets or sets the normalized value within the slider domain.

Grasshopper.GUI.Base.GH_SliderBase.RaiseEvents
Gets or sets a value indicating whether this slider raises the ValueChanged event.

Grasshopper.GUI.Base.GH_SliderBase.Epsilon
Gets the smallest value change supported by the current slider properties.

Grasshopper.GUI.Base.GH_SliderBase.GripText
Gets the text that will be drawn on the slider.

Grasshopper.GUI.Base.GH_SliderBase.GripTextPure
Gets the text format of the number of this slider value.

Grasshopper.GUI.Base.GH_SliderBase.SnapDistance
Gets or sets the snap distance in absolute values.

Grasshopper.GUI.Base.GH_SliderBase.SetSnapRanges(System.Collections.Generic.IEnumerable{Grasshopper.GUI.Base.SliderSnapRange})
Assign a collection of snap ranges to this slider.
ranges: Ranges to snap to. Will override whatever snap ranges were defined before.

Grasshopper.GUI.Base.GH_SliderBase.EnsureValidDomain
Nasty, nasty function! This will bump the Maximum domain if it's coincident with the minimum domain.

Grasshopper.GUI.Base.GH_SliderBase.FixDomain
Fix the limits of the slider. Limits will be rounded according to slider type and accuracy.
Also, a minimum range for all types is ensured.

Grasshopper.GUI.Base.GH_SliderBase.FixValue
Fix the value of the slider. The value will be rounded according to slider type and accuracy.
Also, the value will be clipped to the limits. Before you call this function, ensure the
limits are set up correctly.

Grasshopper.GUI.Base.GH_SliderBase.ProcessNumber(System.Decimal,Grasshopper.GUI.Base.GH_SliderAccuracy,System.Int32)
Process a number using the given slider characteristics.
val: Number to process.
accuracy: Slider rounding accuracy.
digits: Number of digits to use for floating point rounding.
Returns: Processed number.

Grasshopper.GUI.Base.GH_SliderBase.FormatGripText(System.String,Grasshopper.GUI.Base.GH_SliderAccuracy,System.Int32,System.Double)
Create the display text for a given set of slider settings.

Grasshopper.GUI.Base.GH_SliderBase.ClearDisplayCache
Reset the cached grip dimensions.

Grasshopper.GUI.Base.GH_SliderBase.ValueChanged
Raised whenever the value of this slider is changed due to User-Interface methods.
sender: GH_SliderBase that raised the event.
e: Arguments for this event.

Grasshopper.GUI.Base.GH_SliderBase.OnValueChanged(System.Boolean)
Raise the ValueChanged event.
intermediate: Set the intermediate state of the event arguments.

Grasshopper.GUI.Base.GH_SliderBase.m_mouse_drag
0 = no drag, 1 = drag can start, 2 = dragging.

Grasshopper.GUI.Base.GH_SliderBase.MouseDown(System.Windows.Forms.MouseEventArgs,System.Drawing.PointF)
Respond to mouse-down events.
args: Mouse Event arguments.
pt: Mouse cursor position in floating point accuracy.
Returns: True if a Drag operation was started, false if the event went unnoticed.

Grasshopper.GUI.Base.GH_SliderBase.MouseMove(System.Windows.Forms.MouseEventArgs,System.Drawing.PointF)
Respond to mouse-move events.
args: Mouse Event arguments.
pt: Mouse cursor position in floating point accuracy.
Returns: True if a Drag operation was performed, false if the event went unnoticed.

Grasshopper.GUI.Base.GH_SliderBase.MouseUp(System.Windows.Forms.MouseEventArgs,System.Drawing.PointF)
Respond to mouse-up events.
args: Mouse Event arguments.
pt: Mouse cursor position in floating point accuracy.
Returns: True if a Drag operation was terminated, false if the event went unnoticed.

Grasshopper.GUI.Base.GH_SliderBase.KeyDown(System.Windows.Forms.KeyEventArgs)
Respond to a KeyDown event.
args: KeyDown event arguments.
Returns: True if something changed, false if not.

Grasshopper.GUI.Base.GH_SliderBase.TextInputHandlerDelegate
Gets or sets the custom handler for text input.
If you do not set a custom handler the default behaviour will be used.

Grasshopper.GUI.Base.GH_SliderBase.RenderDelegate_Background
Gets or sets the delegate called after the background of the slider has been drawn.

Grasshopper.GUI.Base.GH_SliderBase.RenderDelegate_Ticks
Gets or sets the delegate called after the ticks of the slider have been drawn.

Grasshopper.GUI.Base.GH_SliderBase.RenderDelegate_Rail
Gets or sets the delegate called after the rail of the slider has been drawn.

Grasshopper.GUI.Base.GH_SliderBase.RenderDelegate_Grip
Gets or sets the delegate called after the grip of the slider has been drawn.

Grasshopper.GUI.Base.GH_SliderBase.RenderDelegate_Border
Gets or sets the delegate called after the border of the slider has been drawn.

Grasshopper.GUI.Base.GH_SliderBase.Render(System.Drawing.Graphics)
Render this slider into a Graphics context.
G: Graphics to render with.