Grasshopper.Kernel.Special.GH_PanelAttributes.ZuiElement.None
Unset element.

Grasshopper.Kernel.Special.GH_PanelAttributes.ZuiElement.MarginTop
Top Margin line.

Grasshopper.Kernel.Special.GH_PanelAttributes.ZuiElement.MarginLeft
Left Margin line.

Grasshopper.Kernel.Special.GH_PanelAttributes.ZuiElement.MarginRight
Right Margin line.

Grasshopper.Kernel.Special.GH_PanelAttributes.ZuiElement.Scroll
Scroller grip.