Grasshopper.Kernel.Special.GH_Cluster
The Grasshopper Cluster object.

Grasshopper.Kernel.Special.GH_Cluster.m_password
Hash of password string.

Grasshopper.Kernel.Special.GH_Cluster.m_file
Maintains all information regarding cluster reference files.

Grasshopper.Kernel.Special.GH_Cluster.m_internalDocument
Internal cluster document.

Grasshopper.Kernel.Special.GH_Cluster.m_author
Author data.

Grasshopper.Kernel.Special.GH_Cluster.m_mapping
Maintains map of parameter/hook IDs between the hooks in the current cluster document and the current cluster input|output parameters.

Grasshopper.Kernel.Special.GH_Cluster.m_component_cache
Support caching results from cluster solves

Grasshopper.Kernel.Special.GH_Cluster.FilePath
Gets the filepath that points to the cluster file.
If this cluster does not reference a file, the FilePath will be null.

Grasshopper.Kernel.Special.GH_Cluster.Synchronisation
Gets the current synchronisation state of the cluster.

Grasshopper.Kernel.Special.GH_Cluster.Author
Gets or sets the author data of a cluster.

Grasshopper.Kernel.Special.GH_Cluster.Document(System.String)
Gets the cluster document. If the cluster has a password, you'll need to supply it.
password: Cluster password. Without a correct password null will be returned.
Returns: The cluster document or null on failure or incorrect password.

Grasshopper.Kernel.Special.GH_Cluster.DocumentId
Gets or sets the ID of the internal cluster document.
If there is no internal document, the ID returned will be Guid.Empty.
Do not use the setter unless you know what you are doing.

Grasshopper.Kernel.Special.GH_Cluster.CreateFromDocument(Grasshopper.Kernel.GH_Document)
Recreate this cluster based on the provided document.
The document will not be copied so it should be a unique instance reference.
The document should have input and output hooks otherwise the cluster will
have no input or output parameters.
document: Document to wrap. The document will not be copied,
so be sure you supply a fresh one.

Grasshopper.Kernel.Special.GH_Cluster.CreateFromDocument(Grasshopper.Kernel.GH_Document,System.Drawing.Point)
Recreate this cluster based on the provided document.
The document will not be copied so it should be a unique instance reference.
The document should have input and output hooks otherwise the cluster will
have no input or output parameters.
document: Document to wrap. The document will not be copied,
so be sure you supply a fresh one.
location: Location for cluster object.
This is typically the center of the boundingbox of the document.

Grasshopper.Kernel.Special.GH_Cluster.CreateFromSelection(Grasshopper.Kernel.GH_Document,System.Boolean,System.Boolean,System.Boolean)
Recreate this cluster based on the selected objects in the provided document.
The selection in the document will be copied so you do not have to supply a unique doc.
The luster will be inserted into the provided document.
sourceDocument: Document to cluster.
deleteOriginalObjects: If true, the original objects will be deleted from the document.
reconnectSources: If true, cluster inputs will be reconnected to the same sources as the original objects.
reconnectRecipients: If true, cluster outputs will be reconnected to the same recipients as the original objects.

Grasshopper.Kernel.Special.GH_Cluster.CreateFromFilePath(System.String)
Recreate this cluster based on a provided filepath.
path: File to load from.

Grasshopper.Kernel.Special.GH_Cluster.CreateFromFilePath(System.String,System.Drawing.Point)
Recreate this cluster based on a provided filepath.
path: File to load from.
location: Location for cluster object.

Grasshopper.Kernel.Special.GH_Cluster.UpdateDocument(Grasshopper.Kernel.GH_Document)
Update this cluster to use a new document.
Input and Output parameters will be maintained whenever possible.
This function is very low-level, if you're in doubt about whether to use it or not,
ask on https://discourse.mcneel.com/ for further information.
document: New cluster document.

Grasshopper.Kernel.Special.GH_Cluster.ExplodeCluster
Explode this cluster back into the document that contains it.

Grasshopper.Kernel.Special.GH_Cluster.CreateAllInputs(System.Collections.Generic.SortedDictionary{System.Guid,Grasshopper.Kernel.IGH_Param})
Parse all Cluster Param objects.

Grasshopper.Kernel.Special.GH_Cluster.CreateAllOutputs(System.Collections.Generic.SortedDictionary{System.Guid,Grasshopper.Kernel.IGH_Param})
Parse all Cluster Param objects.

Grasshopper.Kernel.Special.GH_Cluster.CreateInput(Grasshopper.Kernel.Special.GH_ClusterInputHook)
Convert a gateway and a collection of sources into a Cluster input.

Grasshopper.Kernel.Special.GH_Cluster.CreateOutput(Grasshopper.Kernel.Special.GH_ClusterOutputHook)
Convert a gateway and a collection of recipients to a cluster output.

Grasshopper.Kernel.Special.GH_Cluster.SharedTypeIDs(System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_Param})
Tests whether all the parameters in a list are of the same type.
params: Parameters to compare.
Returns: The typeid if all parameters have the same type or Guid.Empty if they do not.

Grasshopper.Kernel.Special.GH_Cluster.InstanceGuidsChanged(System.Collections.Generic.SortedDictionary{System.Guid,System.Guid})
Whenever the InstanceIDs of objects were changed, the cluster needs to be informed.
map: InstanceId map of before and after keys/values.

Grasshopper.Kernel.Special.GH_Cluster.DocumentClosed(Grasshopper.Kernel.GH_Document)


Grasshopper.Kernel.Special.GH_Cluster.DocumentModified(Grasshopper.Kernel.GH_Document)


Grasshopper.Kernel.Special.GH_Cluster.OwnerDocument


Grasshopper.Kernel.Special.GH_Cluster.ClusterFamily
Gets the complete family of clusters of which this cluster is a part.
Returns: A list of associated clusters (including this one)

Grasshopper.Kernel.Special.GH_Cluster.ProtectionLevel
Gets the protection level of this cluster.

Grasshopper.Kernel.Special.GH_Cluster.IsPasswordValid(System.String)
Tests whether a given password is valid. If there is no password defined for this cluster every password is considered valid.
password: Password to test.
Returns: True on success, false on failure.

Grasshopper.Kernel.Special.GH_Cluster.RequestPassword(System.String)
Display a window which requests a password from the user.
If this cluster has no password, this method returns True immediately.
prompt: Message to display.
Returns: True if the user entered a valid password, false if not.

Grasshopper.Kernel.Special.GH_Cluster.AssignNewPassword(System.String,System.String)
Assign a new password to this cluster.
oldPassword: Current password. If the cluster has no password yet any string will do.
newPassword: New password to assign. Pass in an empty string to remove password protection.
Returns: True on success, false on failure. This function only returns false if the oldPassword is incorrect.

Grasshopper.Kernel.Special.GH_Cluster.CreateKey(System.String)
Convert a password to a byte key.
password: Password to encode.
Returns: Byte array representing the password.

Grasshopper.Kernel.Special.GH_Cluster.DoKeysMatch(System.Byte[],System.Byte[])
Test two keys.
key0: Master key, if key0 is null, the keys are assumed to match.
key1: Test key.
Returns: True if they keys match, false if otherwise.

Grasshopper.Kernel.Special.GH_Cluster.EnableCaching
Gets whether cluster caching is enabled.
This is an application wide setting modified by the
"TestClusterCache" command. It's primary aim is to
reduce computational overhead on Rhino Compute servers.

Grasshopper.Kernel.Special.GH_Cluster.PreviewContent
Gets or sets whether the document inside the cluster is included in the preview.

Grasshopper.Kernel.Special.GH_Cluster.Render(Grasshopper.Kernel.GH_RenderPipeline)
Append all geometry associated with this component to a render queue.

Grasshopper.Kernel.Special.GH_Cluster.WriteGhClusterFile(System.String)
Write this cluster object to a *.ghcluster file.
path: Path to write to, should be a *.ghcluster file.
Returns: True on success, false on failure.

Grasshopper.Kernel.Special.GH_Cluster.ReadGhClusterFile(System.String)
Read all cluster data from a *.ghcluster file.
path: Path to read from, should be a *.ghcluster file.
Returns: True on success, false on failure.