Grasshopper.GUI.GH_PreviewSettingsChangedEventArgs
Event arguments for Colour changes in GH_DocumentPreviewSettings.

Grasshopper.GUI.GH_PreviewSettingsChangedEventArgs.NormalColour
Gets the new Normal colour as defined by the UI.

Grasshopper.GUI.GH_PreviewSettingsChangedEventArgs.SelectedColour
Gets the new Selected colour as defined by the UI.