Grasshopper.Kernel.Special.GH_Synchronisation
Enumerates the possible synchronisation states between a cluster instance and the cluster file.

Grasshopper.Kernel.Special.GH_Synchronisation.Unset
Indicates an unset (unsolved) state. This state is never returned.

Grasshopper.Kernel.Special.GH_Synchronisation.NotReferenced
Indicates this cluster is not supposed to be synchronized with a file.

Grasshopper.Kernel.Special.GH_Synchronisation.MissingReference
Indicates the reference file doesn't exist.

Grasshopper.Kernel.Special.GH_Synchronisation.UpToDate
Indicates this cluster is in sync with the reference file.

Grasshopper.Kernel.Special.GH_Synchronisation.OutOfDate
Indicates this cluster is not in sync with the reference file.