Grasshopper.Kernel.Special.GH_ValueList


Grasshopper.Kernel.Special.GH_ValueList.SelectedItems
Gets the selected value list items. If the ListMode only supports a single selected item
then only the first selected item will be included.

Grasshopper.Kernel.Special.GH_ValueList.FirstSelectedItem
Gets the first selected item in this list, or the first item if there are no selected items.

Grasshopper.Kernel.Special.GH_ValueList.ToggleItem(System.Int32)
Safe method of toggling the item at the specified index.
index: Index of item to toggle.

Grasshopper.Kernel.Special.GH_ValueList.SelectItem(System.Int32)
Safe method to select a single item.
index: Index of item to select.

Grasshopper.Kernel.Special.GH_ValueList.NextItem
Safe method of selecting the next item.
The select next logic depends on the ListMode, in that only Cycle and Sequence support NextItem()

Grasshopper.Kernel.Special.GH_ValueList.PrevItem
Safe method of selecting the previous item.
The select prev logic depends on the ListMode, in that only Cycle and Sequence support PrevItem()

Grasshopper.Kernel.Special.GH_ValueList.ShowListEditor(System.Windows.Forms.IWin32Window)
Display the list name/value editor.
owner: Owner window.