Grasshopper.GUI.Base.GH_DigitScrollerBase.GH_MouseAction
Enumerates the possible actions due to mouse-down mouse-move events.

Grasshopper.GUI.Base.GH_DigitScrollerBase.GH_MouseAction.None
No specific action.

Grasshopper.GUI.Base.GH_DigitScrollerBase.GH_MouseAction.SignDown
Mouse down on sign symbol.

Grasshopper.GUI.Base.GH_DigitScrollerBase.GH_MouseAction.DigitDown
Mouse down on scrolling digit.

Grasshopper.GUI.Base.GH_DigitScrollerBase.GH_MouseAction.DigitDrag
Mouse move on scrolling digit.

Grasshopper.GUI.Base.GH_DigitScrollerBase.GH_MouseAction.RadixDown
Mouse down on radix point.

Grasshopper.GUI.Base.GH_DigitScrollerBase.GH_MouseAction.RadixDrag
Mouse move on radix point.