Grasshopper.GUI.Ribbon.GH_RibbonContentBase


Grasshopper.GUI.Ribbon.GH_RibbonContentBase.Region
Represents the entire region taken up by this object.

Grasshopper.GUI.Ribbon.GH_RibbonContentBase.Visible
Gets or sets visibility of this control.
Typically visibility affects drawing and mouse interaction

Grasshopper.GUI.Ribbon.GH_RibbonContentBase.Contains(System.Drawing.Point)
Tests to see if the given point is considered to be 'on' the control.
By default, the content region of the control is tested, but derived
classes can override this behaviour.
pt: Point to test for

Grasshopper.GUI.Ribbon.GH_RibbonContentBase.ContentRegion
Gets or sets the Content region of the layout. The content region as defined
as the entire region minus the margin.

Grasshopper.GUI.Ribbon.GH_RibbonContentBase.ClientRegion
Gets the Client region of the layout. The client region as defined
as the entire region minus the margin and the padding.

Grasshopper.GUI.Ribbon.GH_RibbonContentBase.PerformLayout
This method is called when the control layout has potentially expired.