Grasshopper.Kernel.GH_PrincipalState
Enumerates the different possible states in which the masterness of a parameter can occur.

Grasshopper.Kernel.GH_PrincipalState.CannotBePrincipal
This parameter cannot be a principal parameter.
It is not a valid component input.

Grasshopper.Kernel.GH_PrincipalState.IsPrincipal
This parameter is the current principal parameter
as defined by the component which owns it.

Grasshopper.Kernel.GH_PrincipalState.IsNotPrincipal
This parameter is not the current principal parameter,
but it could be.