Grasshopper.Kernel.GH_ParamHashFields
Enumerates all accepted fields for hashing parameter data.

Grasshopper.Kernel.GH_ParamHashFields.None
Represents a blank hash.

Grasshopper.Kernel.GH_ParamHashFields.Input
Input parameters are taken into account.

Grasshopper.Kernel.GH_ParamHashFields.Output
Output parameters are taken into account.

Grasshopper.Kernel.GH_ParamHashFields.InputAndOutput
Input and output parameters are taken into account.

Grasshopper.Kernel.GH_ParamHashFields.InstanceId
Parameter instance ID is taken into account.

Grasshopper.Kernel.GH_ParamHashFields.NickName
Parameter nickname is taken into account.

Grasshopper.Kernel.GH_ParamHashFields.Access
Parameter access (item, list, tree) is taken into account.

Grasshopper.Kernel.GH_ParamHashFields.TypeId
Parameter type code is taken into account.

Grasshopper.Kernel.GH_ParamHashFields.PersistentData
Parameter persistent data is taken into account.

Grasshopper.Kernel.GH_ParamHashFields.Expression
Parameter Expression is taken into account.

Grasshopper.Kernel.GH_ParamHashFields.TypeHint
Parameter typehint is taken into account.

Grasshopper.Kernel.GH_ParamHashFields.Sources
Parameter source IDs are taken into account.

Grasshopper.Kernel.GH_ParamHashFields.Recipients
Parameter recipient IDs are taken into account.

Grasshopper.Kernel.GH_ParamHashFields.SourcesAndRecipients
Parameter sources and recipients are taken into account.

Grasshopper.Kernel.GH_ParamHashFields.SerialData
Parameter serialization byte array is taken into account.