Grasshopper.Kernel.IGH_Attributes
Base interface for all Attributes. Attributes are the visual portion of GH_DocumentObjects.
They handle display, mouse events, layout, context menus etc. etc.
You should consider inheriting from GH_Attributes or some other abstract class instead of
implementing this interface from scratch.

Grasshopper.Kernel.IGH_Attributes.Pivot
Gets the pivot for these attributes. The pivot controls the general placement
of the attributes. If you want to move the attributes, change the pivot location.

Grasshopper.Kernel.IGH_Attributes.Bounds
Gets the rectangle that contains the active content of the attributes.
Typically the Contents determine the active area for menus, tooltips etc.
Attributes are not supposed to draw objects beyond the Bounds.

Grasshopper.Kernel.IGH_Attributes.AllowMessageBalloon
Gets a value indicating whether these attributes allow warning and
error boxes to be drawn on top of them.

Grasshopper.Kernel.IGH_Attributes.HasInputGrip
Gets a value indicating whether or not these attributes have an input grip.

Grasshopper.Kernel.IGH_Attributes.HasOutputGrip
Gets a value indicating whether or not these attributes have an output grip.

Grasshopper.Kernel.IGH_Attributes.InputGrip
Gets the input grip location for these attributes.
If HasInputGrip equals False, this point is meaningless.

Grasshopper.Kernel.IGH_Attributes.OutputGrip
Gets the output grip location for these attributes.
If HasOutputGrip equals False, this point is meaningless.

Grasshopper.Kernel.IGH_Attributes.IsPickRegion(System.Drawing.PointF)
Determines whether a point is within the pickable region for this object.
By default, any point inside the Bounds is treated as pickable.
point: Point location to test.

Grasshopper.Kernel.IGH_Attributes.IsPickRegion(System.Drawing.RectangleF,Grasshopper.Kernel.GH_PickBox)
Determines whether a rectangle is a valid pick region for this object.
By default, the picking rectangle is intersected with the Bounds rectangle.
box: Selection box.
method: Selection method.

Grasshopper.Kernel.IGH_Attributes.IsMenuRegion(System.Drawing.PointF)
Determines whether a point is available for context menu popups.
By default, IsMenuRegion calls IsPickRegion(PointF).
point: Point location to test.

Grasshopper.Kernel.IGH_Attributes.ExpireLayout
Expires the entire layout of the attributes. When overridden,
implementer must place a call to the base class ExpireLayout().

Grasshopper.Kernel.IGH_Attributes.PerformLayout
Recompute the layout for these attributes. This function is automatically called during
Drawing operations, so you typically don't have to.

Grasshopper.Kernel.IGH_Attributes.RenderToCanvas(Grasshopper.GUI.Canvas.GH_Canvas,Grasshopper.GUI.Canvas.GH_CanvasChannel)
Render these attributes into a Canvas control.
canvas: Canvas to draw on.
channel: Current drawing channel.

Grasshopper.Kernel.IGH_Attributes.InvalidateCanvas(Grasshopper.GUI.Canvas.GH_Canvas,Grasshopper.GUI.GH_CanvasMouseEvent)
If the mouse location should cause a canvas invalidation then return true.
You only need to override this function if you draw objects that are dependant
on cursor positions outside the bounds of the attributes.
canvas: Canvas to potentially invalidate.
e: Event arguments for canvas mousemove.
Returns: True if the canvas ought to be invalidated.

Grasshopper.Kernel.IGH_Attributes.DocObject
Gets the owner object of these attributes.

Grasshopper.Kernel.IGH_Attributes.Parent
Gets or sets the parent attributes. Top level attributes do not have parents.

Grasshopper.Kernel.IGH_Attributes.IsTopLevel
Gets whether these attributes are top_level (i.e. no Parent attributes)

Grasshopper.Kernel.IGH_Attributes.GetTopLevel
Gets the top level attributes of these attributes.

Grasshopper.Kernel.IGH_Attributes.PathName
Get a description of the location of these attributes within the local
attribute tree.

Grasshopper.Kernel.IGH_Attributes.AppendToAttributeTree(System.Collections.Generic.List{Grasshopper.Kernel.IGH_Attributes})
Recursively append these attributes and all child attributes to the attribute list.
attributes: List to append to.

Grasshopper.Kernel.IGH_Attributes.NewInstanceGuid
Generate a new instance GUID for the owner object.

Grasshopper.Kernel.IGH_Attributes.NewInstanceGuid(System.Guid)
Generate a new instance GUID for the owner object. Do not use this overload
unless you're > 1.95m and called David.
newID: New ID to assign.

Grasshopper.Kernel.IGH_Attributes.InstanceGuid
Gets the instance ID for these attributes.

Grasshopper.Kernel.IGH_Attributes.Selected
Gets or sets the selected state of the top-level attributes.