Grasshopper.GUI.GH_FadePhase
Enumerates the possible states of a ZUI fade animation.

Grasshopper.GUI.GH_FadePhase.Hidden
Indicates the UI elements ought to be hidden.

Grasshopper.GUI.GH_FadePhase.Hiding
Indicates the UI elements are in the process of being hidden.

Grasshopper.GUI.GH_FadePhase.Shown
Indicates the UI elements ought to be shown.

Grasshopper.GUI.GH_FadePhase.Showing
Indicates the UI elements are in the process of being shown.