Grasshopper.Kernel.Data.GH_IndexRanges
Represents a sorted, non-colliding collection of index ranges.

Grasshopper.Kernel.Data.GH_IndexRanges.Count
Gets the number of ranges stored in this collection.

Grasshopper.Kernel.Data.GH_IndexRanges.Range(System.Int32)
Gets the range at the given index.
index: Index of range to retrieve.

Grasshopper.Kernel.Data.GH_IndexRanges.InsertRange(Grasshopper.Kernel.Data.GH_IndexRange)
Insert an index range into the collection.
range: Range to insert.
Returns: True if the collection was meaningfully modified.

Grasshopper.Kernel.Data.GH_IndexRanges.RemoveRange(Grasshopper.Kernel.Data.GH_IndexRange)
Remove an index range from the collection.
range: Range to remove.
Returns: True if the collection was meaningfully modified.