Grasshopper.Kernel.GH_DocumentTree
Represents a hierarchical tree of documents that are subsidiary to one another.

Grasshopper.Kernel.GH_DocumentTree.#ctor(Grasshopper.Kernel.GH_Document)
Create a new document tree.
root: Root document.

Grasshopper.Kernel.GH_DocumentTree.Root
Gets the root node for this document.

Grasshopper.Kernel.GH_DocumentTree.RootDocument
Gets the document inside the root node of this tree.

Grasshopper.Kernel.GH_DocumentTree.FlatCollection
Gets a flat collection of all documents.
The most subsidiary documents are at the start of the collection.