Grasshopper.Kernel.GH_AssemblyInfoStub
Provides basic properties for a GHA assembly that does not expose a type that derives from GH_AssemblyInfo.
This type is created automatically when a GH_AssemblyInfo type is not found in an assembly.