Grasshopper.Kernel.GDL.GH_GDLParser.GdlLineType
Enumerates the possible types of instruction.

Grasshopper.Kernel.GDL.GH_GDLParser.GdlLineType.None
Line is empty. None cannot be combined with other types.

Grasshopper.Kernel.GDL.GH_GDLParser.GdlLineType.Remark
Line is a remark and ought to be ignored by the parser.
Remarks cannot be combined with other types.

Grasshopper.Kernel.GDL.GH_GDLParser.GdlLineType.Declaration
Line declares one or more objects.

Grasshopper.Kernel.GDL.GH_GDLParser.GdlLineType.Association
Line associates two parameters.

Grasshopper.Kernel.GDL.GH_GDLParser.GdlLineType.Assignment
Line assign one or more values or properties to an object.