Grasshopper.Kernel.GDL.GH_GDLParser.GdlObject
Represents a single object in a Gdl text.

Grasshopper.Kernel.GDL.GH_GDLParser.GdlObject.#ctor(System.String)
Create a new instance of a GdlObject.
fullName: Full name.