Grasshopper.Kernel.Types.GH_AngularDimension
Represents an implementation of a Rhino angular dimension.

Grasshopper.Kernel.Types.GH_AngularDimension.#ctor
Default constructor, creates an invalid angular dimension.

Grasshopper.Kernel.Types.GH_AngularDimension.#ctor(Rhino.Geometry.AngularDimension)
Create a duplicate of an existing angular dimension.
dimension: Angular dimension to duplicate

Grasshopper.Kernel.Types.GH_AngularDimension.#ctor(Rhino.Geometry.AngularDimension,Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle)
Create a duplicate of an existing angular dimension.
dimension: Angular dimension to duplicate
style: Annotation style to use

Grasshopper.Kernel.Types.GH_AngularDimension.#ctor(Grasshopper.Kernel.Types.GH_AngularDimension)
Create a duplicate of another GH_AngularDimension. This constructor also copies reference data.
other: GH_AngularDimension to duplicate

Grasshopper.Kernel.Types.GH_AngularDimension.#ctor(System.Guid)
Create a new referenced angular dimension that references a Rhino dimension with the specified ID.
ref_guid: ID of dimension object to reference.

Grasshopper.Kernel.Types.GH_AngularDimension.DuplicateAnnotation
Create a duplicate of this annotation.

Grasshopper.Kernel.Types.GH_AngularDimension.DuplicateAngularDimension
Create a duplicate of this angular dimension.

Grasshopper.Kernel.Types.GH_AngularDimension.ToString
Format the dimension using default grasshopper formatting logic.

Grasshopper.Kernel.Types.GH_AngularDimension.CastFrom(System.Object)
Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_AngularDimension.CastTo``1(``0@)
Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.