Grasshopper.Kernel.Special.GH_DialKnob.Minimum
Gets or sets the lowest value allowed in this dial.
If Limit == false, this property is ignored.

Grasshopper.Kernel.Special.GH_DialKnob.Maximum
Gets or sets the highest value allowed in this dial.
If Limit == false, this property is ignored.

Grasshopper.Kernel.Special.GH_DialKnob.Value
Gets or sets the value for this dial.

Grasshopper.Kernel.Special.GH_DialKnob.Range
Gets or sets the difference a full turn of the dial makes.

Grasshopper.Kernel.Special.GH_DialKnob.Decimals
Gets or sets how many decimals are allowed.

Grasshopper.Kernel.Special.GH_DialKnob.Limit
Gets or sets whether the dial is limited.

Grasshopper.Kernel.Special.GH_DialKnob.DisplayFormat
Gets or sets the display format for this knob.

Grasshopper.Kernel.Special.GH_DialKnob.Angle
Compute the angle in radians of the dial (clockwise, starting at y-up)
for the current value.

Grasshopper.Kernel.Special.GH_DialKnob.RepairValue
Apply rounding and limits to the value field.