Grasshopper.GUI.GH_ControlKnobOptionsForm


Grasshopper.GUI.GH_ControlKnobOptionsForm.ApplyLimits
Apply limits and adjust UI state based on Limit state.

Grasshopper.GUI.GH_ControlKnobOptionsForm.AdjustMinimum
Adjust the minimum scroller based on the maximum scroller.

Grasshopper.GUI.GH_ControlKnobOptionsForm.AdjustMaximum
Adjust the maximum scroller based on the minimum scroller.