Grasshopper.Kernel.Types.GH_ComplexNumber
Wraps up the Complex data type for IGH_Goo adherence.

Grasshopper.Kernel.Types.GH_ComplexNumber.#ctor
Blank constructor

Grasshopper.Kernel.Types.GH_ComplexNumber.IsValid
Gets the validity of this instance. If either the real or the imaginary component are NaN, then it is considered invalid

Grasshopper.Kernel.Types.GH_ComplexNumber.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Kernel.Types.GH_ComplexNumber.QC_Type


Grasshopper.Kernel.Types.GH_ComplexNumber.QC_Hash


Grasshopper.Kernel.Types.GH_ComplexNumber.QC_Distance(Grasshopper.Kernel.Types.IGH_QuickCast)


Grasshopper.Kernel.Types.GH_ComplexNumber.QC_Bool


Grasshopper.Kernel.Types.GH_ComplexNumber.QC_Complex


Grasshopper.Kernel.Types.GH_ComplexNumber.QC_Int


Grasshopper.Kernel.Types.GH_ComplexNumber.QC_Num


Grasshopper.Kernel.Types.GH_ComplexNumber.QC_Matrix


Grasshopper.Kernel.Types.GH_ComplexNumber.QC_Text


Grasshopper.Kernel.Types.GH_ComplexNumber.QC_Pt


Grasshopper.Kernel.Types.GH_ComplexNumber.QC_Vec


Grasshopper.Kernel.Types.GH_ComplexNumber.QC_Col


Grasshopper.Kernel.Types.GH_ComplexNumber.QC_Interval


Grasshopper.Kernel.Types.GH_ComplexNumber.QC_CompareTo(Grasshopper.Kernel.Types.IGH_QuickCast)
