Grasshopper.Kernel.Types.GH_Vector
Represents a 3D vector. GH_Vector re-implements the RhinoCommon Vector3d struct.

Grasshopper.Kernel.Types.GH_Vector.EmitProxy
Returns a proxy that represents this vector. Do not call this function unless you're

Grasshopper.Kernel.Types.GH_Vector.#ctor
Default constructor. Creates a zero-length vector.

Grasshopper.Kernel.Types.GH_Vector.#ctor(Rhino.Geometry.Vector3d)
Create a vector from x, y and z components.
vector: Vector to wrap.

Grasshopper.Kernel.Types.GH_Vector.#ctor(Grasshopper.Kernel.Types.GH_Vector)
Create a duplicate of another vector
other: Vector to copy. If null, a default vector will be created.

Grasshopper.Kernel.Types.GH_Vector.Duplicate
Create a duplicate of this vector.

Grasshopper.Kernel.Types.GH_Vector.DuplicateVector
Create a duplicate of this vector.

Grasshopper.Kernel.Types.GH_Vector.ToString
Format the vector using default grasshopper formatting logic.

Grasshopper.Kernel.Types.GH_Vector.CastFrom(System.Object)
Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_Vector.CastTo``1(``0@)
Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_Vector.QC_Type


Grasshopper.Kernel.Types.GH_Vector.QC_Hash


Grasshopper.Kernel.Types.GH_Vector.QC_Distance(Grasshopper.Kernel.Types.IGH_QuickCast)


Grasshopper.Kernel.Types.GH_Vector.QC_Bool


Grasshopper.Kernel.Types.GH_Vector.QC_Complex


Grasshopper.Kernel.Types.GH_Vector.QC_Matrix


Grasshopper.Kernel.Types.GH_Vector.QC_Int


Grasshopper.Kernel.Types.GH_Vector.QC_Num


Grasshopper.Kernel.Types.GH_Vector.QC_Text


Grasshopper.Kernel.Types.GH_Vector.QC_Pt


Grasshopper.Kernel.Types.GH_Vector.QC_Vec


Grasshopper.Kernel.Types.GH_Vector.QC_Col


Grasshopper.Kernel.Types.GH_Vector.QC_Interval


Grasshopper.Kernel.Types.GH_Vector.QC_CompareTo(Grasshopper.Kernel.Types.IGH_QuickCast)
