Grasshopper.Kernel.GH_State
Represents a single recorded document state.
A state contains values for an arbitrary set of objects inside the document.

Grasshopper.Kernel.GH_State.Name
Gets or sets the name of this state.

Grasshopper.Kernel.GH_State.LastModified
Gets the date at which this state was last modified.

Grasshopper.Kernel.GH_State.StateCount
Gets the number of items stored in the state database.

Grasshopper.Kernel.GH_State.Data(System.Guid)
Gets the state data stored under the specified ID

Grasshopper.Kernel.GH_State.Data(System.Int32)
Gets the state data stored under the specified index

Grasshopper.Kernel.GH_State.StateData
Gets a pointer to the internal database of states.

Grasshopper.Kernel.GH_State.AddStateObject(Grasshopper.Kernel.IGH_StateAwareObject,System.Guid)
Append a new object to the database.
obj: Object to append.
obj_id: Instance GUID of object in document.

Grasshopper.Kernel.GH_State.RemoveStateObject(System.Guid)
Remove an object from the database.

Grasshopper.Kernel.GH_State.ClearStates
Removes all items from the state database.

Grasshopper.Kernel.GH_State.CreateStateFromDocument(Grasshopper.Kernel.GH_Document)
Creates a state database from a document.
doc: Document to parse.
Returns: Number of states saved or -1 if the user aborted.