Grasshopper.GUI.RemotePanel.RcpGroup
Represents a container for GH_Object instances.
Containers are top-level objects in the RCP.

Grasshopper.GUI.RemotePanel.RcpGroup.Name
Gets or sets the name of this group.

Grasshopper.GUI.RemotePanel.RcpGroup.Colour
Gets or sets the color of this group.

Grasshopper.GUI.RemotePanel.RcpGroup.Document
Gets or sets the document that owns this group.
This is only necessary during file reading, but hey.

Grasshopper.GUI.RemotePanel.RcpGroup.TitleRectangle
Gets the rectangle taken up by the entire container bar.

Grasshopper.GUI.RemotePanel.RcpGroup.IconRectangle
Gets the rectangle taken up by the icon in the container bar.

Grasshopper.GUI.RemotePanel.RcpGroup.NameRectangle
Gets the rectangle taken up by the title text in the container bar.

Grasshopper.GUI.RemotePanel.RcpGroup.ContentRectangle
Gets the rectangle taken up by the part of the control that is not the title bar or the borders.
If the container is collapsed then this area will have a height of zero.

Grasshopper.GUI.RemotePanel.RcpGroup.ItemLayoutRectangle
Gets the rectangle used for item layouts. This is basically the ContentRectangle minus itempadding on all edges.

Grasshopper.GUI.RemotePanel.RcpGroup.ReplaceItem(Grasshopper.GUI.RemotePanel.IRcpItem)
Replace an item with a placeholder.
item: Item to replace.
Returns: True on success, false on failure.

Grasshopper.GUI.RemotePanel.RcpGroup.RemovePlaceHolders
Remove all placeholders from this group.

Grasshopper.GUI.RemotePanel.RcpGroup.IndexAt(System.Drawing.Point)
Gets the item index at the given point.
pt: Point to search from.
Returns: The index of the item at pt or -1 if no item exists at this location.

Grasshopper.GUI.RemotePanel.RcpGroup.ItemAt(System.Drawing.Point)
Gets the item at the given point.
pt: Point to search from.
Returns: The item at the given point or null if no such item could be found.

Grasshopper.GUI.RemotePanel.RcpGroup.ImpliedInsertionIndex(System.Drawing.Point,System.Double@,System.Int32@)
Finds the insertion index implied by the position of a point.
pt: Point for insertion test.
distance: Distance from insertion location to test point.
index: Insertion index.

Grasshopper.GUI.RemotePanel.RcpGroup.LayoutItems
Layout all items within the content area. It is the responsibility of the caller
to assign the correct dimensions and position to the group bounds. I.e. make sure that
the height of the of the Bounds are the same as the DesiredHeight.
Layout will not occur when a group is collapsed.