Grasshopper.GUI.GH_SourceCodeLines
Represents a collection of source code lines.

Grasshopper.GUI.GH_SourceCodeLines.Blocks
Break this collection of lines into distinct blocks.

Grasshopper.GUI.GH_SourceCodeLines.FindNthBlock(System.Int32,System.Boolean,System.Boolean)
Find the Nth block of source code lines that adheres to the given parameters.
N: Block offset (one based)
b_include_readonly: If True, blocks which are Readonly will be included.
b_include_editable: If True, blocks which are not ReadOnly will be included.

Grasshopper.GUI.GH_SourceCodeLines.StringSplit(System.String,System.String)
Splits a string into substrings.
delim: String to split with
stream: String to split