Grasshopper.Kernel.Data.GH_PathOffset
Represents a relative offset within a data structure.

Grasshopper.Kernel.Data.GH_PathOffset.ItemOffset
Gets or sets the relative offset for branch items.

Grasshopper.Kernel.Data.GH_PathOffset.PathOffset
Gets access to the relative offsets for path indices.

Grasshopper.Kernel.Data.GH_PathOffset.PathWrap
Gets or sets the PathWrap flag.

Grasshopper.Kernel.Data.GH_PathOffset.ItemWrap
Gets or sets the ItemWrap flag.

Grasshopper.Kernel.Data.GH_PathOffset.ToString
Format the Path Offset.

Grasshopper.Kernel.Data.GH_PathOffset.OffsetDirection
Determines whether the Path Offset is positive, negative or indeterminate.
Returns: -1 for negative, +1 for positive, 0 for indeterminate.

Grasshopper.Kernel.Data.GH_PathOffset.OffsetPath(Grasshopper.Kernel.Data.GH_Path,System.Int32,Grasshopper.Kernel.Data.GH_Path@,System.Int32@)
Offset a path + index value without wrapping.
path: Path to offset.
index: Item to offset.
rel_path: Offsetted path.
rel_index: Offsetted index.
Returns: True on success, false on failure.

Grasshopper.Kernel.Data.GH_PathOffset.OffsetPath(Grasshopper.Kernel.Data.GH_Path,System.Int32,Grasshopper.Kernel.Data.IGH_Structure,Grasshopper.Kernel.Data.GH_Path@,System.Int32@)
Offset a path + index value with wrapping and bounds checking.
path: Path to offset.
index: Item to offset.
tree: Structure context for offset.
relativePath: Offsetted path.
relativeIndex: Offsetted index.
Returns: True on success, false on failure.