Grasshopper.Kernel.Types.GH_TextEntity
Represents an implementation of a Rhino text entity.

Grasshopper.Kernel.Types.GH_TextEntity.#ctor
Default constructor, creates an invalid text entity.

Grasshopper.Kernel.Types.GH_TextEntity.#ctor(Rhino.Geometry.TextEntity)
Create a duplicate of an existing text entity.
textEntity: text entity to duplicate

Grasshopper.Kernel.Types.GH_TextEntity.#ctor(Rhino.Geometry.TextEntity,Grasshopper.Rhinoceros.Annotations.ModelAnnotationStyle)
Create a duplicate of an existing text entity.
textEntity: text entity to duplicate
style: Annotation style to use

Grasshopper.Kernel.Types.GH_TextEntity.#ctor(System.Guid)
Create a new referenced text entity that references a Rhino text object with the specified ID.
ref_guid: ID of text entity object to reference.

Grasshopper.Kernel.Types.GH_TextEntity.#ctor(Grasshopper.Kernel.Types.GH_TextEntity)
Create a duplicate of another GH_TextEntity. This constructor also copies reference data.
other: GH_TextEntity to duplicate

Grasshopper.Kernel.Types.GH_TextEntity.DuplicateAnnotation
Create a duplicate of this annotation.

Grasshopper.Kernel.Types.GH_TextEntity.DuplicateTextEntity
Create a duplicate of this text entity.

Grasshopper.Kernel.Types.GH_TextEntity.ToString
Format the text entity using default grasshopper formatting logic.

Grasshopper.Kernel.Types.GH_TextEntity.CastFrom(System.Object)
Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_TextEntity.CastTo``1(``0@)
Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.