Grasshopper.Kernel.GH_Convert
Provides static converters for different data types inside Grasshopper.
This class both has specific and generic converters.

Grasshopper.Kernel.GH_Convert.#ctor
This class cannot be instantiated, use the Shared methods directly.

Grasshopper.Kernel.GH_Convert.ToRectangle(System.Drawing.RectangleF)
Convert a floating point GDI rectangle structure to an integer rounded rectangle.
Use this method for any and all GUI conversions as the specific rounding scheme used here
avoids pixel jitter.
in: RectangleF to convert.
Returns: Integer accuracy rectangle.

Grasshopper.Kernel.GH_Convert.ToSize(System.Drawing.SizeF)
Convert a floating point GDI size structure to an integer rounded size.
in: SizeF to convert.
Returns: Integer accuracy size.

Grasshopper.Kernel.GH_Convert.ToPoint(System.Drawing.PointF)
Convert a floating point GDI point structure to an integer rounded point.
in: PointF to convert.
Returns: Integer accuracy point.

Grasshopper.Kernel.GH_Convert.ToPointF(Rhino.Geometry.Point3d)
Convert a Rhino SDK point structure to a GDI point structure.
in: Point3d to convert.
Returns: Floating point accuracy GDI point.

Grasshopper.Kernel.GH_Convert.ToPlural(System.String)
Apply english rules to convert a noun into its plural form.
This algorithm is not water-tight as it will not handle any irregular cases.
singular: Singular form of noun.
Returns: Plural form of noun.

Grasshopper.Kernel.GH_Convert.ToNextPowerOfTen(System.Double)
Round a number upwards to the nearest power of ten.
num: Number to round.
Returns: The power of ten equal to or higher than num.

Grasshopper.Kernel.GH_Convert.ToPrevPowerOfTen(System.Double)
Round a number downwards to the nearest power of ten.
num: Number to round.
Returns: The power of ten equal to or less than num.

Grasshopper.Kernel.GH_Convert.ToVariant(System.Object)
Convert an object to a Grasshopper Expression Variant if possible.
value: Data to convert.
Returns: An expression variant that matches the input best or a VAR_Null instance.

Grasshopper.Kernel.GH_Convert.ToSHA_Hash(System.Byte[])
Create a SHA hash. The hash algorithm is only guaranteed to yield
the same results from within a unique application domain.
data: Data to hash.
Returns: A guid representing the (partial) SHA hash.

Grasshopper.Kernel.GH_Convert.ToSHA_Hash(System.IO.Stream)
Create a SHA hash. The hash algorithm is only guaranteed to yield
the same results from within a unique application domain.
data: Data to hash.
Returns: A guid representing the (partial) SHA hash.

Grasshopper.Kernel.GH_Convert.ToVariableName(System.String)
Extract the implied variable name from a compound string.
A string is considered compound if it contains a parenthesis pair with
at least one character within the brackets.
compound: String to parse.
Returns: The variable name as extracted or the original compound if no name was implied.

Grasshopper.Kernel.GH_Convert.GetPointFromDocument(Rhino.RhinoDoc,System.Guid,Rhino.Geometry.Point3d@)
Harvest a point object from a Rhino document.
doc: Document to search.
id: ID of point object.
pt: Point result.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.GetCurveFromDocument(Rhino.RhinoDoc,System.Guid,Rhino.Geometry.Curve@)
Harvest a curve object from a Rhino document.
doc: Document to search.
id: ID of curve object.
crv: Curve result.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.GetBrepFromDocument(Rhino.RhinoDoc,System.Guid,Rhino.Geometry.Brep@)
Harvest a brep object from a Rhino document.
doc: Document to search.
id: ID of brep object.
brp: Brep result.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.GetExtrusionFromDocument(Rhino.RhinoDoc,System.Guid,Rhino.Geometry.Extrusion@)
Harvest an extrusion object from a Rhino document.
doc: Document to search.
id: ID of brep object.
extrusion: Extrusion result.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.GetSubDFromDocument(Rhino.RhinoDoc,System.Guid,Rhino.Geometry.SubD@)
Harvest a sub-d object from a Rhino document.
doc: Document to search.
id: ID of brep object.
subd: Sub-D result.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.GetClippingPlaneFromDocument(Rhino.RhinoDoc,System.Guid,Rhino.Geometry.Plane@)
Harvest a clipping plane surface from a Rhino document.
doc: Document to search.
id: ID of clipping plane surface.
pln: Plane result.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.GetSurfaceFromDocument(Rhino.RhinoDoc,System.Guid,Rhino.Geometry.Surface@)
Harvest a surface object from a Rhino document.
doc: Document to search.
id: ID of surface object.
srf: Surface result.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.GetMeshFromDocument(Rhino.RhinoDoc,System.Guid,Rhino.Geometry.Mesh@)
Harvest a mesh object from a Rhino document.
doc: Document to search.
id: ID of mesh object.
msh: Mesh result.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.FindRhinoObjectByNameAndType(System.String,Rhino.DocObjects.ObjectType)
Search the current Rhino document for an object with a given name of a given type.
name: Name of object.
type: Geometry type of object.
Returns: An object that matches the name + type filter or null if no object could be found.

Grasshopper.Kernel.GH_Convert.ToGoo(System.Object)
Converts an object into Goo. Does not duplicate the data if a lossless conversion is possible.
data: Data to convert.
Returns: IGH_Goo instance. If Data is not a null reference this function ALWAYS returns a GOO instance.
Remarks: This function calls a whole sh*tload of other conversion functions. IT IS SLOW.

Grasshopper.Kernel.GH_Convert.ToGeometricGoo(System.Object)
Converts an object into GeometricGoo. Does not duplicate the data if a lossless conversion is possible.
data: Data to convert.
Returns: An instance that implements IGH_GeometricGoo on success or null on failure.

Grasshopper.Kernel.GH_Convert.ObjRefToGeometry(Rhino.DocObjects.ObjRef)
Convert a Rhino Object Reference into Grasshopper IGH_GeometricGoo.
in: Object reference to convert.
Returns: An instance that implements IGH_GeometricGoo on success or false on failure.

Grasshopper.Kernel.GH_Convert.GeometryToObjRef(Grasshopper.Kernel.Types.IGH_GeometricGoo)
Create an ObjRef for a referenced IGH_GeometricGoo.
Unreferenced IGH_GeometryGoo will return null.
[in]: geometric goo to get an ObjRef from
Returns:
An instance of an ObjRef when the goo is referenced geometry.
It is up to the caller to Dispose of the objref when it is no
longer needed
Null for unreferenced geometry

Grasshopper.Kernel.GH_Convert.ToGeometryBase(System.Object)
Attempt to convert an object into a Rhino.Geometry.GeometryBase instance.
data: Data to convert.
Returns: A GeometryBase instance on success or null on failure.

Grasshopper.Kernel.GH_Convert.ToRelativePath(System.String,System.String)
Create a relative path from two absolute paths.
anchor_path: Anchor path, the relative path result will be based on this location. Must be absolute.
target_path: Target path, this is the path that will be converted. Must be absolute and must have the same root as the Anchor.
Returns: The relative path on success or null on failure.
Throws System.ArgumentNullException: Thrown if anchor_path is a null reference.
Throws System.ArgumentNullException: Thrown if target_path is a null reference.

Grasshopper.Kernel.GH_Convert.To_GH_ClassPrefixTypeName(System.String)
Rename a Type FullName from the pre-"GH_"-prefix ea.
old_name: Type name (Type.FullName) to process.
Returns: The renamed typename.

Grasshopper.Kernel.GH_Convert.CommonObjectToByteArray(Rhino.Runtime.CommonObject)
Convert a RhinoCommon object into a compressed byte-array using
safe Rhino 5.0 OpenNurbs serialization.
data: Object to serialize.
Returns: A byte array representing the object or null on failure.

Grasshopper.Kernel.GH_Convert.CommonObjectToByteArray(System.Int32,Rhino.Runtime.CommonObject)
Convert a RhinoCommon object into a compressed byte-array.
data: Object to serialize.
Returns: A byte array representing the object or null on failure.

Grasshopper.Kernel.GH_Convert.ByteArrayToCommonObject``1(System.Byte[])
Convert an OpenNurbs compliant compressed byte array into a RhinoCommon object.
data: Byte array to de-serialize.
Returns: A RhinoCommon object instance or null on failure.

Grasshopper.Kernel.GH_Convert.ByteArrayToCommonObject``1(System.Int32,System.Byte[])
Convert an OpenNurbs compliant compressed byte array into a RhinoCommon object.
data: Byte array to de-serialize.
Returns: A RhinoCommon object instance or null on failure.

Grasshopper.Kernel.GH_Convert.ToSafeRhinoCommonObject(System.Object)
Convert RhinoCommon types that are dangerous to use out of context (BrepFace, BrepEdge, etc.) into
safe types (Brep, Curve, etc.).
data: Data to convert.
Returns: Safe data.

Grasshopper.Kernel.GH_Convert.ToGHBoolean_Primary(System.Object,Grasshopper.Kernel.Types.GH_Boolean@)
Converts similar data into a GH_Boolean instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Boolean will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHInteger_Primary(System.Object,Grasshopper.Kernel.Types.GH_Integer@)
Converts similar data into a GH_Integer instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Integer will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHNumber_Primary(System.Object,Grasshopper.Kernel.Types.GH_Number@)
Converts similar data into a GH_Number instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Number will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHComplexNumber_Primary(System.Object,Grasshopper.Kernel.Types.GH_ComplexNumber@)
Converts similar data into a GH_ComplexNumber instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_ComplexNumber will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHTime_Primary(System.Object,Grasshopper.Kernel.Types.GH_Time@)
Converts similar data into a GH_Time instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Time will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHString_Primary(System.Object,Grasshopper.Kernel.Types.GH_String@)
Converts similar data into a GH_String instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_String will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHColour_Primary(System.Object,Grasshopper.Kernel.Types.GH_Colour@)
Converts similar data into a GH_Colour instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Colour will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHGuid_Primary(System.Object,Grasshopper.Kernel.Types.GH_Guid@)
Converts similar data into a GH_Guid instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Guid will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHInterval_Primary(System.Object,Grasshopper.Kernel.Types.GH_Interval@)
Converts similar data into a GH_Interval instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Interval will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHInterval2D_Primary(System.Object,Grasshopper.Kernel.Types.GH_Interval2D@)
Converts similar data into a GH_Interval2D instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Interval2D will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHMatrix_Primary(System.Object,Grasshopper.Kernel.Types.GH_Matrix@)
Converts similar data into a GH_Matrix instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Matrix will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHVector_Primary(System.Object,Grasshopper.Kernel.Types.GH_Vector@)
Converts similar data into a GH_Vector instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Vector will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHPoint_Primary(System.Object,Grasshopper.Kernel.Types.GH_Point@)
Converts similar data into a GH_Point instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Point will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHPlane_Primary(System.Object,Grasshopper.Kernel.Types.GH_Plane@)
Converts similar data into a GH_Plane instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Plane will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHBox_Primary(System.Object,Grasshopper.Kernel.Types.GH_Box@)
Converts similar data into a GH_Box instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Box will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHRectangle_Primary(System.Object,Grasshopper.Kernel.Types.GH_Rectangle@)
Converts similar data into a GH_Rectangle instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Rectangle will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHCircle_Primary(System.Object,Grasshopper.Kernel.Types.GH_Circle@)
Converts similar data into a GH_Circle instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Circle will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHArc_Primary(System.Object,Grasshopper.Kernel.Types.GH_Arc@)
Converts similar data into a GH_Arc instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Arc will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHLine_Primary(System.Object,Grasshopper.Kernel.Types.GH_Line@)
Converts similar data into a GH_Line instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Line will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHCurve_Primary(System.Object,Grasshopper.Kernel.Types.GH_Curve@)
Converts similar data into a GH_Curve instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Line will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHSurface_Primary(System.Object,Grasshopper.Kernel.Types.GH_Surface@)
Converts similar data into a GH_Surface instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Surface will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHBrep_Primary(System.Object,Grasshopper.Kernel.Types.GH_Brep@)
Converts similar data into a GH_Brep instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Brep will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHExtrusion_Primary(System.Object,Grasshopper.Kernel.Types.GH_Extrusion@)
Converts similar data into a GH_Extrusion instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Brep will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHSubD_Primary(System.Object,Grasshopper.Kernel.Types.GH_SubD@)
Converts similar data into a GH_SubD instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Brep will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHMesh_Primary(System.Object,Grasshopper.Kernel.Types.GH_Mesh@)
Converts similar data into a GH_Mesh instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Mesh will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHMeshFace_Primary(System.Object,Grasshopper.Kernel.Types.GH_MeshFace@)
Converts similar data into a GH_MeshFace instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_MeshFace will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHPointCloud_Primary(System.Object,Grasshopper.Kernel.Types.GH_PointCloud@)
Converts similar data into a GH_PointCloud instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_PointCloud will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHHatch_Primary(System.Object,Grasshopper.Kernel.Types.GH_Hatch@)
Converts similar data into a GH_Hatch instance.
Data is not guaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Hatch will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHTextEntity_Primary(System.Object,Grasshopper.Kernel.Types.GH_TextEntity@)
Converts similar data into a GH_TextEntity instance.
Data is not guaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_TextEntity will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHTextDot_Primary(System.Object,Grasshopper.Kernel.Types.GH_TextDot@)
Converts similar data into a GH_TextDot instance.
Data is not guaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_TextDot will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHLeader_Primary(System.Object,Grasshopper.Kernel.Types.GH_Leader@)
Converts similar data into a GH_Leader instance.
Data is not guaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Leader will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHDimension_Primary``1(System.Object,``0@)
Converts similar data into a GH_Dimension instance.
Data is not guaranteed to be duplicated.
data: Data to convert
target: Target instance.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHLinearDimension_Primary(System.Object,Grasshopper.Kernel.Types.GH_LinearDimension@)
Converts similar data into a GH_LinearDimension instance.
Data is not guaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_LinearDimension will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHRadialDimension_Primary(System.Object,Grasshopper.Kernel.Types.GH_RadialDimension@)
Converts similar data into a GH_RadialDimension instance.
Data is not guaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_RadialDimension will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHAngularDimension_Primary(System.Object,Grasshopper.Kernel.Types.GH_AngularDimension@)
Converts similar data into a GH_AngularDimension instance.
Data is not guaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_AngularDimension will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHOrdinateDimension_Primary(System.Object,Grasshopper.Kernel.Types.GH_OrdinateDimension@)
Converts similar data into a GH_OrdinateDimension instance.
Data is not guaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_OrdinateDimension will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHCentermark_Primary(System.Object,Grasshopper.Kernel.Types.GH_Centermark@)
Converts similar data into a GH_Centermark instance.
Data is not guaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Centermark will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHInstanceReference_Primary(System.Object,Grasshopper.Kernel.Types.GH_InstanceReference@)
Converts similar data into a GH_InstanceReference instance.
Data is not guaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_InstanceReference will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHLight_Primary(System.Object,Grasshopper.Kernel.Types.GH_Light@)
Converts similar data into a GH_Light instance.
Data is not guaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Light will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHBoolean_Secondary(System.Object,Grasshopper.Kernel.Types.GH_Boolean@)
Converts similar data into a GH_Boolean instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Boolean will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHInteger_Secondary(System.Object,Grasshopper.Kernel.Types.GH_Integer@)
Converts similar data into a GH_Integer instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Integer will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHNumber_Secondary(System.Object,Grasshopper.Kernel.Types.GH_Number@)
Converts similar data into a GH_Number instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Number will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHComplexNumber_Secondary(System.Object,Grasshopper.Kernel.Types.GH_ComplexNumber@)
Converts similar data into a GH_ComplexNumber instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_ComplexNumber will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHTime_Secondary(System.Object,Grasshopper.Kernel.Types.GH_Time@)
Converts similar data into a GH_Time instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Time will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHString_Secondary(System.Object,Grasshopper.Kernel.Types.GH_String@)
Converts similar data into a GH_String instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_String will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHColour_Secondary(System.Object,Grasshopper.Kernel.Types.GH_Colour@)
Converts similar data into a GH_Colour instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Colour will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHGuid_Secondary(System.Object,Grasshopper.Kernel.Types.GH_Guid@)
Converts similar data into a GH_Guid instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Guid will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHInterval_Secondary(System.Object,Grasshopper.Kernel.Types.GH_Interval@)
Converts similar data into a GH_Interval instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Interval will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHInterval2D_Secondary(System.Object,Grasshopper.Kernel.Types.GH_Interval2D@)
Converts similar data into a GH_Interval2D instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Interval2D will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHMatrix_Secondary(System.Object,Grasshopper.Kernel.Types.GH_Matrix@)
Converts similar data into a GH_Matrix instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Matrix will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHVector_Secondary(System.Object,Grasshopper.Kernel.Types.GH_Vector@)
Converts similar data into a GH_Vector instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Vector will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHPoint_Secondary(System.Object,Grasshopper.Kernel.Types.GH_Point@)
Converts similar data into a GH_Point instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Point will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHPlane_Secondary(System.Object,Grasshopper.Kernel.Types.GH_Plane@)
Converts similar data into a GH_Plane instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Plane will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHBox_Secondary(System.Object,Grasshopper.Kernel.Types.GH_Box@)
Converts similar data into a GH_Box instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Box will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHRectangle_Secondary(System.Object,Grasshopper.Kernel.Types.GH_Rectangle@)
Converts similar data into a GH_Rectangle instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Rectangle will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHCircle_Secondary(System.Object,Grasshopper.Kernel.Types.GH_Circle@)
Converts similar data into a GH_Circle instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Circle will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHArc_Secondary(System.Object,Grasshopper.Kernel.Types.GH_Arc@)
Converts similar data into a GH_Arc instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Arc will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHLine_Secondary(System.Object,Grasshopper.Kernel.Types.GH_Line@)
Converts similar data into a GH_Line instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Line will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHCurve_Secondary(System.Object,Grasshopper.Kernel.Types.GH_Curve@)
Converts similar data into a GH_Curve instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Line will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHSurface_Secondary(System.Object,Grasshopper.Kernel.Types.GH_Surface@)
Converts similar data into a GH_Surface instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Surface will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHBrep_Secondary(System.Object,Grasshopper.Kernel.Types.GH_Brep@)
Converts similar data into a GH_Brep instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Brep will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHExtrusion_Secondary(System.Object,Grasshopper.Kernel.Types.GH_Extrusion@)
Converts similar data into a GH_Brep instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Brep will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHSubD_Secondary(System.Object,Grasshopper.Kernel.Types.GH_SubD@)
Converts similar data into a GH_SubD instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_SubD will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHMesh_Secondary(System.Object,Grasshopper.Kernel.Types.GH_Mesh@)
Converts similar data into a GH_Mesh instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Mesh will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHMeshFace_Secondary(System.Object,Grasshopper.Kernel.Types.GH_MeshFace@)
Converts similar data into a GH_MeshFace instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_MeshFace will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHPointCloud_Secondary(System.Object,Grasshopper.Kernel.Types.GH_PointCloud@)
Converts similar data into a GH_PointCloud instance.
Data is not quaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_PointCloud will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHHatch_Secondary(System.Object,Grasshopper.Kernel.Types.GH_Hatch@)
Converts similar data into a GH_Hatch instance.
Data is not guaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Hatch will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHTextDot_Secondary(System.Object,Grasshopper.Kernel.Types.GH_TextDot@)
Converts similar data into a GH_TextDot instance.
Data is not guaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_TextDot will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHTextEntity_Secondary(System.Object,Grasshopper.Kernel.Types.GH_TextEntity@)
Converts similar data into a GH_TextEntity instance.
Data is not guaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_TextEntity will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHLeader_Secondary(System.Object,Grasshopper.Kernel.Types.GH_Leader@)
Converts similar data into a GH_Leader instance.
Data is not guaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Leader will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHDimension_Secondary``2(System.Object,``0@)
Converts similar data into a GH_Dimension instance.
Data is not guaranteed to be duplicated.
data: Data to convert
target: Target instance.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHLinearDimension_Secondary(System.Object,Grasshopper.Kernel.Types.GH_LinearDimension@)
Converts similar data into a GH_LinearDimension instance.
Data is not guaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_LinearDimension will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHRadialDimension_Secondary(System.Object,Grasshopper.Kernel.Types.GH_RadialDimension@)
Converts similar data into a GH_RadialDimension instance.
Data is not guaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_RadialDimension will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHAngularDimension_Secondary(System.Object,Grasshopper.Kernel.Types.GH_AngularDimension@)
Converts similar data into a GH_AngularDimension instance.
Data is not guaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_AngularDimension will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHOrdinateDimension_Secondary(System.Object,Grasshopper.Kernel.Types.GH_OrdinateDimension@)
Converts similar data into a GH_OrdinateDimension instance.
Data is not guaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_OrdinateDimension will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHCentermark_Secondary(System.Object,Grasshopper.Kernel.Types.GH_Centermark@)
Converts similar data into a GH_Centermark instance.
Data is not guaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Centermark will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHInstanceReference_Secondary(System.Object,Grasshopper.Kernel.Types.GH_InstanceReference@)
Converts similar data into a GH_InstanceReference instance.
Data is not guaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_InstanceReference will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHLight_Secondary(System.Object,Grasshopper.Kernel.Types.GH_Light@)
Converts similar data into a GH_Light instance.
Data is not guaranteed to be duplicated.
data: Data to convert
target: Target instance. If null, a new GH_Light will be constructed.
If not null, the instance values will be set.
Returns: True on success, False on failure.

Grasshopper.Kernel.GH_Convert.ToGHBoolean(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Boolean@)
Convert data into GH_Boolean.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHInteger(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Integer@)
Convert data into GH_Integer.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHNumber(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Number@)
Convert data into GH_Number.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHComplexNumber(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_ComplexNumber@)
Convert data into GH_ComplexNumber.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHTime(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Time@)
Convert data into GH_Time.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHString(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_String@)
Convert data into GH_String.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHGuid(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Guid@)
Convert data into GH_Guid.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHColour(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Colour@)
Convert data into GH_Colour.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHInterval(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Interval@)
Convert data into GH_Intervals.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHInterval2D(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Interval2D@)
Convert data into GH_Interval2Ds.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHMatrix(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Matrix@)
Convert data into ToGHMatrix.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHPoint(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Point@)
Convert data into GH_Points.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHVector(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Vector@)
Convert data into GH_Vectors.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHPlane(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Plane@)
Convert data into GH_Planes.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHBox(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Box@)
Convert data into GH_Boxes.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHLine(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Line@)
Convert data into GH_Lines.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHRectangle(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Rectangle@)
Convert data into GH_Rectangles.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHCircle(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Circle@)
Convert data into GH_Circles.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHArc(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Arc@)
Convert data into GH_Arcs.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHCurve(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Curve@)
Convert data into GH_Curves.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHSurface(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Surface@)
Convert data into GH_Surfaces.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHBrep(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Brep@)
Convert data into GH_Breps.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHExtrusion(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Extrusion@)
Convert data into GH_Extrusion.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHSubD(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_SubD@)
Convert data into GH_SubDs.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHMesh(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Mesh@)
Convert data into GH_Meshs.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHMeshFace(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_MeshFace@)
Convert data into GH_MeshFaces.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHPointCloud(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_PointCloud@)
Convert data into GH_PointCloud.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHInstanceReference(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_InstanceReference@)
Convert data into GH_InstanceReference.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHHatch(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Hatch@)
Convert data into GH_Hatch.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHTextEntity(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_TextEntity@)
Convert data into GH_TextEntity.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHTextDot(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_TextDot@)
Convert data into GH_TextDot.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHLeader(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Leader@)
Convert data into GH_Leader.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHLinearDimension(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_LinearDimension@)
Convert data into GH_LinearDimension.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHRadialDimension(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_RadialDimension@)
Convert data into GH_RadialDimension.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHAngularDimension(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_AngularDimension@)
Convert data into GH_AngularDimension.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHOrdinateDimension(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_OrdinateDimension@)
Convert data into GH_OrdinateDimension.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHCentermark(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Centermark@)
Convert data into GH_Centermark.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHDimension(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Dimension@)
Convert data into GH_Dimension.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHAnnotationBase(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_AnnotationBase@)
Convert data into GH_AnnotationBase.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToGHLight(System.Object,Grasshopper.Kernel.GH_Conversion,Grasshopper.Kernel.Types.GH_Light@)
Convert data into GH_Light.
data: Data to convert
conversion_level: Level of conversion.
target: Destination of conversion. If Null, a new instance will be created.

Grasshopper.Kernel.GH_Convert.ToBoolean_Primary(System.Object,System.Boolean@)
Performs a direct cast from boolean or GH_Boolean.
data: Data to convert.
destination: Target for value assignment.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.ToInt32_Primary(System.Object,System.Int32@)
Performs a direct cast from Int32 or GH_Integer.
data: Data to convert.
destination: Target for value assignment.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.ToDouble_Primary(System.Object,System.Double@)
Performs a direct cast from Double or GH_Number.
data: Data to convert.
destination: Target for value assignment.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.ToComplex_Primary(System.Object,Grasshopper.Kernel.Types.Complex@)
Performs a direct cast from Complex or GH_ComplexNumber
data: Data to convert.
destination: Target for value assignment.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.ToDate_Primary(System.Object,System.DateTime@)
Performs a direct cast from DateTime or GH_DateTime.
data: Data to convert.
destination: Target for value assignment.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.ToGUID_Primary(System.Object,System.Guid@)
Performs a direct cast from Guid, GH_Guid, String and GH_String.
data: Data to convert.
destination: Target for value assignment.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.ToColor_Primary(System.Object,System.Drawing.Color@)
Performs a direct cast from Drawing.Color, GH_Color and OnColor.
data: Data to convert.
destination: Target for value assignment.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.ToCulture_Primary(System.Object,System.Globalization.CultureInfo@)
Performs a direct cast from System.Globalization.CultureInfo and GH_Culture.
data: Data to convert.
destination: Target for value assignment.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.ToString_Primary(System.Object,System.String@)
Performs a direct cast from String and GH_String.
data: Data to convert.
destination: Target for value assignment.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.ToBoolean_Secondary(System.Object,System.Boolean@)
Performs indirect casts from other data types into booleans.
data: Data to convert.
destination: Target for value assignment.
Returns: True on success, false on failure.
Remarks: This converted relies on ToInt32_Secondary()

Grasshopper.Kernel.GH_Convert.ToInt32_Secondary(System.Object,System.Int32@)
Performs indirect casts from other data types into Integers.
data: Data to convert.
destination: Target for value assignment.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.ToDouble_Secondary(System.Object,System.Double@)
Performs indirect casts from other data types into Doubles.
data: Data to convert.
destination: Target for value assignment.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.ToComplex_Secondary(System.Object,Grasshopper.Kernel.Types.Complex@)
Performs indirect casts from other data types into Complex.
data: Data to convert.
destination: Target for value assignment.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.ToDate_Secondary(System.Object,System.DateTime@)
Performs indirect casts from other data types into DateTime constructs.
data: Data to convert.
destination: Target for value assignment.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.ToGUID_Secondary(System.Object,System.Guid@)
Performs indirect casts from other data types into Guids.
data: Data to convert.
destination: Target for value assignment.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.ToColor_Secondary(System.Object,System.Drawing.Color@)
Performs indirect casts from other data types into Colors.
data: Data to convert.
destination: Target for value assignment.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.ToCulture_Secondary(System.Object,System.Globalization.CultureInfo@)
Performs indirect casts from other data types into CultureInfo.
data: Data to convert.
destination: Target for value assignment.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.CultureTable
Gets the cached culture table. Do not modify this dictionary unless you know what you are doing.

Grasshopper.Kernel.GH_Convert.StringToColor(System.String,System.Drawing.Color@)
Converts a String into a Colour.
The string must either be a named colour or a channel mesh-up
S: String to parse.
col: Colour result
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.StringToGuid(System.String)
Create a Guid based on SHA256 hashing of a string.
text: Text to hash.
Returns: A guid representing the string.

Grasshopper.Kernel.GH_Convert.ToString_Secondary(System.Object,System.String@)
Creates a String representation of an object by calling the ToString() function.
data: Data to convert.
destination: Target for value assignment.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.ToBoolean(System.Object,System.Boolean@,Grasshopper.Kernel.GH_Conversion)
Convert data into Booleans.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToInt32(System.Object,System.Int32@,Grasshopper.Kernel.GH_Conversion)
Convert data into Int32s.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToDouble(System.Object,System.Double@,Grasshopper.Kernel.GH_Conversion)
Convert data into Doubles.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToComplex(System.Object,Grasshopper.Kernel.Types.Complex@,Grasshopper.Kernel.GH_Conversion)
Convert data into Complex.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToDate(System.Object,System.DateTime@,Grasshopper.Kernel.GH_Conversion)
Convert data into Dates.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToGUID(System.Object,System.Guid@,Grasshopper.Kernel.GH_Conversion)
Convert data into Guids.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToColor(System.Object,System.Drawing.Color@,Grasshopper.Kernel.GH_Conversion)
Convert data into Colors.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToCulture(System.Object,System.Globalization.CultureInfo@,Grasshopper.Kernel.GH_Conversion)
Convert data into Colors.
data: Data to convert.
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToString(System.Object,System.String@,Grasshopper.Kernel.GH_Conversion)
Convert data into Colors.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToInterval_Primary(System.Object,Rhino.Geometry.Interval@)
Performs a direct cast from OnInterval or GH_Interval.
data: Data to convert
rc: [out] Interval cast.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.ToUVInterval_Primary(System.Object,Grasshopper.Kernel.Types.UVInterval@)
Performs a direct cast from UVInterval or GH_Interval2D.
data: Data to convert
rc: [out] Interval cast.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.ToMatrix_Primary(System.Object,Rhino.Geometry.Matrix@)
Performs a direct cast from Matrix or GH_Matrix.
data: Data to convert
rc: [out] Matrix cast.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.ToPoint3d_Primary(System.Object,Rhino.Geometry.Point3d@)
Performs a direct cast from On3dPoint or GH_Point.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An On3dPoint instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToVector3d_Primary(System.Object,Rhino.Geometry.Vector3d@)
Performs a direct cast from On3dVector or GH_Vector.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An On3dVector instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToPlane_Primary(System.Object,Rhino.Geometry.Plane@)
Performs a direct cast from OnPlane or GH_Plane.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An OnPlane instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToBoundingBox_Primary(System.Object,Rhino.Geometry.BoundingBox@)
Performs a direct cast from OnBoundingBox.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An OnBoundingBox instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToBox_Primary(System.Object,Rhino.Geometry.Box@)
Performs a direct cast from Box.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An OnBoundingBox instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToLine_Primary(System.Object,Rhino.Geometry.Line@)
Performs a direct cast from OnLine or GH_Line.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An OnLine instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToRectangle3d_Primary(System.Object,Rhino.Geometry.Rectangle3d@)
Performs a direct cast from Rectangle3d or GH_Rectangle.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: A Rectangle3d instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToCircle_Primary(System.Object,Rhino.Geometry.Circle@)
Performs a direct cast from OnCircle or GH_Circle.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An OnCircle instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToArc_Primary(System.Object,Rhino.Geometry.Arc@)
Performs a direct cast from OnArc or GH_Arc.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An OnArc instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToCurve_Primary(System.Object,Rhino.Geometry.Curve@)
Performs a direct cast from OnCurve or GH_Curve.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An OnCurve instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToSurface_Primary(System.Object,Rhino.Geometry.Surface@)
Performs a direct cast from OnSurface or GH_Surface.
Data is not quaranteed to be duplicated.
If data is of type GH_Surface, then trim curves are ignored.
data: Data to convert
Returns: An OnSurface instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToBrep_Primary(System.Object,Rhino.Geometry.Brep@)
Performs a direct cast from OnBrep or GH_Brep.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An OnBrep instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToExtrusion_Primary(System.Object,Rhino.Geometry.Extrusion@)
Performs a direct cast from Rhino.Geometry.Extrusion or GH_Extrusion.
Data is not quaranteed to be duplicated.
data: Data to convert
rc: Result of conversion
Returns: An Rhino.Geometry.Extrusion instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToSubD_Primary(System.Object,Rhino.Geometry.SubD@)
Performs a direct cast from OnSubD or GH_SubD.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An OnSubD instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToMesh_Primary(System.Object,Rhino.Geometry.Mesh@)
Performs a direct cast from Rhino.Geometry.Mesh or GH_Mesh.
Data is not guaranteed to be duplicated.
data: Data to convert
rc: Result of conversion
Returns: A Rhino.Geometry.Mesh instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToPointCloud_Primary(System.Object,Rhino.Geometry.PointCloud@)
Performs a direct cast from Rhino.Geometry.PointCloud or GH_PointCloud.
Data is not guaranteed to be duplicated.
data: Data to convert
rc: Result of conversion
Returns: A Rhino.Geometry.PointCloud instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToHatch_Primary(System.Object,Rhino.Geometry.Hatch@)
Performs a direct cast from Rhino.Geometry.Hatch or GH_Hatch.
Data is not guaranteed to be duplicated.
data: Data to convert
rc: Result of conversion
Returns: A Rhino.Geometry.Hatch instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToTextDot_Primary(System.Object,Rhino.Geometry.TextDot@)
Performs a direct cast from Rhino.Geometry.TextDot or GH_TextDot.
Data is not guaranteed to be duplicated.
data: Data to convert
rc: Result of conversion
Returns: A Rhino.Geometry.TextDot instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToTextEntity_Primary(System.Object,Rhino.Geometry.TextEntity@)
Performs a direct cast from Rhino.Geometry.TextEntity or GH_TextEntity.
Data is not guaranteed to be duplicated.
data: Data to convert
rc: Result of conversion
Returns: A Rhino.Geometry.TextEntity instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToLeader_Primary(System.Object,Rhino.Geometry.Leader@)
Performs a direct cast from Rhino.Geometry.Leader or GH_Leader.
Data is not guaranteed to be duplicated.
data: Data to convert
rc: Result of conversion
Returns: A Rhino.Geometry.Leader instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToDimension_Primary(System.Object,Rhino.Geometry.Dimension@)
Performs a direct cast from Rhino.Geometry.Dimension or GH_Dimension.
Data is not guaranteed to be duplicated.
data: Data to convert
rc: Result of conversion
Returns: A Rhino.Geometry.Dimension instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToAnnotationBase_Primary(System.Object,Rhino.Geometry.AnnotationBase@)
Performs a direct cast from Rhino.Geometry.AnnotationBase or GH_AnnotationBase.
Data is not guaranteed to be duplicated.
data: Data to convert
rc: Result of conversion
Returns: A Rhino.Geometry.AnnotationBase instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToInterval_Secondary(System.Object,Rhino.Geometry.Interval@)
Attempts to convert other data types into an Interval.
Data is not quaranteed to be duplicated.
data: Data to convert
rc: [out] Interval cast.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.TryParseIntervalString(System.String,Rhino.Geometry.Interval@)
Attempts to parse a string that is supposed to represent an interval.
This will work if the string is a valid numeric expression,
or if it's two numeric expressions separated by a semi-colon or " TO " string.
text: String to parse
dest: [out] Interval cast.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.ToUVInterval_Secondary(System.Object,Grasshopper.Kernel.Types.UVInterval@)
Attempts to convert other data types into a UVInterval.
Data is not quaranteed to be duplicated.
data: Data to convert
rc: [out] Interval cast.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.ToMatrix_Secondary(System.Object,Rhino.Geometry.Matrix@)
Attempts to convert other data types into a Matrix.
Data is not quaranteed to be duplicated.
data: Data to convert
rc: [out] Matrix cast.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.ToPoint3d_Secondary(System.Object,Rhino.Geometry.Point3d@)
Attempts to convert other data types into an Point.
Data is not quaranteed to be duplicated.
data: Data to convert
rc: [out] Point cast.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.ToVector3d_Secondary(System.Object,Rhino.Geometry.Vector3d@)
Attempts to convert other data types into a Vector.
Data is not quaranteed to be duplicated.
data: Data to convert
rc: [out] Vector cast.
Returns: True on success, false o failure.

Grasshopper.Kernel.GH_Convert.ToPlane_Secondary(System.Object,Rhino.Geometry.Plane@)
Attempts to convert other data types into an OnPlane.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An OnPlane instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToLine_Secondary(System.Object,Rhino.Geometry.Line@)
Attempts to convert other data types into an OnLine.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An OnLine instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToRectangle3d_Secondary(System.Object,Rhino.Geometry.Rectangle3d@)
Attempts to convert other data types into a Rectangle3d.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: A Rectangle3d instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToCircle_Secondary(System.Object,Rhino.Geometry.Circle@)
Attempts to convert other data types into an OnCircle.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An OnCircle instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToArc_Secondary(System.Object,Rhino.Geometry.Arc@)
Attempts to convert other data types into an OnArc.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An OnArc instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToCurve_Secondary(System.Object,Rhino.Geometry.Curve@)
Attempts to convert other data types into an IOnCurve.
Data is not quaranteed to be duplicated.
data: Data to convert.
rc:
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Convert.ToSurface_Secondary(System.Object,Rhino.Geometry.Surface@)
Attempts to convert other data types into an IOnSurface.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An IOnSurface instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToBrep_Secondary(System.Object,Rhino.Geometry.Brep@)
Attempts to convert other data types into an OnBrep.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An OnBrep instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToExtrusion_Secondary(System.Object,Rhino.Geometry.Extrusion@)
Attempts to convert other data types into a Extrusion.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: A Extrusion instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToSubD_Secondary(System.Object,Rhino.Geometry.SubD@)
Attempts to convert other data types into a Sub-D.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: A Sub-D instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToMesh_Secondary(System.Object,Rhino.Geometry.Mesh@)
Attempts to convert other data types into an OnMesh.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An OnMesh instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToPointCloud_Secondary(System.Object,Rhino.Geometry.PointCloud@)
Attempts to convert other data types into an Rhino.Geometry.PointCloud.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An Rhino.Geometry.PointCloud instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToHatch_Secondary(System.Object,Rhino.Geometry.Hatch@)
Attempts to convert other data types into an Rhino.Geometry.Hatch.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An Rhino.Geometry.Hatch instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToTextDot_Secondary(System.Object,Rhino.Geometry.TextDot@)
Attempts to convert other data types into an Rhino.Geometry.TextDot.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An Rhino.Geometry.TextDot instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToTextEntity_Secondary(System.Object,Rhino.Geometry.TextEntity@)
Attempts to convert other data types into an Rhino.Geometry.TextEntity.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An Rhino.Geometry.TextEntity instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToLeader_Secondary(System.Object,Rhino.Geometry.Leader@)
Attempts to convert other data types into an Rhino.Geometry.Leader.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An Rhino.Geometry.Leader instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToDimension_Secondary(System.Object,Rhino.Geometry.Dimension@)
Attempts to convert other data types into an Rhino.Geometry.Dimension.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An Rhino.Geometry.Dimension instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToAnnotationBase_Secondary(System.Object,Rhino.Geometry.AnnotationBase@)
Attempts to convert other data types into an Rhino.Geometry.AnnotationBase.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An Rhino.Geometry.AnnotationBase instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToLight_Secondary(System.Object,Rhino.Geometry.Light@)
Attempts to convert other data types into an Rhino.Geometry.Light.
Data is not quaranteed to be duplicated.
data: Data to convert
Returns: An Rhino.Geometry.Light instance if successful, or Nothing on failure.

Grasshopper.Kernel.GH_Convert.ToInterval(System.Object,Rhino.Geometry.Interval@,Grasshopper.Kernel.GH_Conversion)
Convert data into Rhino.Geometry.Interval.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToUVInterval(System.Object,Grasshopper.Kernel.Types.UVInterval@,Grasshopper.Kernel.GH_Conversion)
Convert data into Grasshopper.Kernel.Types.UVInterval.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToMatrix(System.Object,Rhino.Geometry.Matrix@,Grasshopper.Kernel.GH_Conversion)
Convert data into Rhino.Geometry.Matrix.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToPoint3d(System.Object,Rhino.Geometry.Point3d@,Grasshopper.Kernel.GH_Conversion)
Convert data into Rhino.Geometry.Point3d.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToVector3d(System.Object,Rhino.Geometry.Vector3d@,Grasshopper.Kernel.GH_Conversion)
Convert data into Rhino.Geometry.Vector3d.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToPlane(System.Object,Rhino.Geometry.Plane@,Grasshopper.Kernel.GH_Conversion)
Convert data into Rhino.Geometry.Plane.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToLine(System.Object,Rhino.Geometry.Line@,Grasshopper.Kernel.GH_Conversion)
Convert data into Rhino.Geometry.Line.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToRectangle3d(System.Object,Rhino.Geometry.Rectangle3d@,Grasshopper.Kernel.GH_Conversion)
Convert data into Rhino.Geometry.Line.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToCircle(System.Object,Rhino.Geometry.Circle@,Grasshopper.Kernel.GH_Conversion)
Convert data into Rhino.Geometry.Circle.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToArc(System.Object,Rhino.Geometry.Arc@,Grasshopper.Kernel.GH_Conversion)
Convert data into Rhino.Geometry.Arc.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToCurve(System.Object,Rhino.Geometry.Curve@,Grasshopper.Kernel.GH_Conversion)
Convert data into Rhino.Geometry.Curve.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToSurface(System.Object,Rhino.Geometry.Surface@,Grasshopper.Kernel.GH_Conversion)
Convert data into Rhino.Geometry.Surface.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToBrep(System.Object,Rhino.Geometry.Brep@,Grasshopper.Kernel.GH_Conversion)
Convert data into Rhino.Geometry.Brep.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToExtrusion(System.Object,Rhino.Geometry.Extrusion@,Grasshopper.Kernel.GH_Conversion)
Convert data into Rhino.Geometry.Brep.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToSubD(System.Object,Rhino.Geometry.SubD@,Grasshopper.Kernel.GH_Conversion)
Convert data into Rhino.Geometry.SubD.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToMesh(System.Object,Rhino.Geometry.Mesh@,Grasshopper.Kernel.GH_Conversion)
Convert data into Rhino.Geometry.Mesh.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToPointCloud(System.Object,Rhino.Geometry.PointCloud@,Grasshopper.Kernel.GH_Conversion)
Convert data into Rhino.Geometry.PointCloud.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToHatch(System.Object,Rhino.Geometry.Hatch@,Grasshopper.Kernel.GH_Conversion)
Convert data into Rhino.Geometry.Hatch.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToTextDot(System.Object,Rhino.Geometry.TextDot@,Grasshopper.Kernel.GH_Conversion)
Convert data into Rhino.Geometry.TextDot.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToTextEntity(System.Object,Rhino.Geometry.TextEntity@,Grasshopper.Kernel.GH_Conversion)
Convert data into Rhino.Geometry.TextEntity.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToLeader(System.Object,Rhino.Geometry.Leader@,Grasshopper.Kernel.GH_Conversion)
Convert data into Rhino.Geometry.Leader.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToDimension(System.Object,Rhino.Geometry.Dimension@,Grasshopper.Kernel.GH_Conversion)
Convert data into Rhino.Geometry.Dimension.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ToAnnotationBase(System.Object,Rhino.Geometry.AnnotationBase@,Grasshopper.Kernel.GH_Conversion)
Convert data into Rhino.Geometry.AnnotationBase.
data: Data to convert
conversion_level: Level of conversion.

Grasshopper.Kernel.GH_Convert.ParseExpression(System.String,System.Boolean)
Attempts to parse an expression.
exp: Expression to parse.
recursive: If True, and the result of the expression is a String,
the result is parsed again until the result is no longer a String or until the expression fails.
Returns: The result of the (recursive) expression.

Grasshopper.Kernel.GH_Convert.BackSolveExpression(System.String,System.String,System.Double,System.Double,System.Double,System.Int32,System.Double@,System.Double@)
Try and backsolve an expression
exp: Expression to back solve.
variable: Name of input variable.
target: Result to look for.
minimum: Lowest input to try.
maximum: Highest input to try.
steps: Number of steps per iteration.
t: Value for variable that closest approximates the target value.
v: Value of expression for the best approximation.
Returns: True on success, false on failure..

Grasshopper.Kernel.GH_Convert.PureDateTicks
Represents the total number of ticks past midnight that (by Grasshopper convention) identifies a pure date.

Grasshopper.Kernel.GH_Convert.PureTimeTicks
Represents the total number of ticks past a whole second that (by Grasshopper convention) identifies a pure time.

Grasshopper.Kernel.GH_Convert.IsPureDate(System.DateTime)
Tests whether a DateTime instance represents a pure date (i.e. that the time portion is undefined).
Pure dates are a Grasshopper convention, basically a pure date is 1 tick past midnight.
potentialDate: Date to test.
Returns: True if the date is considered pure.

Grasshopper.Kernel.GH_Convert.IsPureTime(System.DateTime)
Tests whether a DateTime instance represents a pure time (i.e. that the date portion is undefined).
Pure times are a Grasshopper convention, basically a pure time is 2 ticks past any second.
potentialTime: Date to test.
Returns: True if the time is considered undefined.

Grasshopper.Kernel.GH_Convert.GetTimeKind(System.DateTime)
Gets the kind of time implied by a System.DateTime value.
time: Time to evaluate.
Returns: GH_TimeKind.PureTime, GH_TimeKind.PureDate or GH_TimeKind.DateAndTime.

Grasshopper.Kernel.GH_Convert.GetTimeKind(System.DateTime,System.DateTime)
Gets the kind of time implied by two System.DateTime values.
A: First time to evaluate.
B: Second time to evaluate.
Returns: GH_TimeKind.PureTime, GH_TimeKind.PureDate or GH_TimeKind.DateAndTime if both kinds are the same.
GH_TimeKind.DateAndTime is one is a pure date and the other a DateAndTime value.
GH_TimeKind.Mixed is one is a pure time and the other one is not.

Grasshopper.Kernel.GH_Convert.CreatePureDate(System.DateTime)
Convert a datetime structure into a pure date, i.e. remove the time portion.
As per convention, this leaves 1 tick into the day in question intact.

Grasshopper.Kernel.GH_Convert.CreatePureTime(System.DateTime)
Convert a datetime structure into a pure time, i.e. remove the date portion.
As per convention, this means setting the year, month and day to 1.

Grasshopper.Kernel.GH_Convert.CreatePureTime(System.Int32,System.Int32,System.Int32)
Create a pure time instance. If the total number of hours, minutes and seconds exceeds a full year
then it is not possible to create a pure time and the largest possible pure time will be returned instead.

Grasshopper.Kernel.GH_Convert.CombineDateAndTime(System.DateTime,System.DateTime)
Combine a pure date and a pure time.
date: Must be a pure date instance.
time: Must be a pute time instance.
Returns: A combined date and time.

Grasshopper.Kernel.GH_Convert.StringToDate(System.String,System.DateTime@)
Convert a string representing a date into an actual date.
If a pure date is possible it will be returned. If the input is a pure time this method will fail,
you need to use StringToTime instead.
text: String to parse.
date: If the string could be parsed, the pure date will be returned here.
Returns: True if string was successfully parsed, false if not.

Grasshopper.Kernel.GH_Convert.ParseGrasshopperDateConstants(System.String,System.DateTime@)
Tests to see if a string represents one of the constants.

Grasshopper.Kernel.GH_Convert.ParseGrasshopperDateFormat(System.String,System.DateTime@)
Parses a string that adheres to the Grasshopper datetime formatting logic.
{dddd, dd MMMM yyyy (HH:mm:ss)}

Grasshopper.Kernel.GH_Convert.ParseFlexibleDateFormat(System.String,System.DateTime@)
Parses a string that adheres to the Grasshopper datetime formatting logic.
{dddd, dd MMMM yyyy (HH:mm:ss)}

Grasshopper.Kernel.GH_Convert.ParseDotNETDateFormat(System.String,System.DateTime@)
Parses a string that adheres to standard DotNET formatting rules. Parsing is attempted in
current culture and En-US.

Grasshopper.Kernel.GH_Convert.ExtractDateStrings(System.String)
Attempt to extract important parts of a Date/Time formatted string.
text: Text to parse.
Returns: An array of strings containing relevant parts of the text.

Grasshopper.Kernel.GH_Convert.TryParseDate(System.String,System.DateTime@)
Try and parse a string that contains only day, month and potentially year segments.
text: Text to parse.
date: On auccess, date will be returned here.
Returns: True if date could be parsed, false if not.

Grasshopper.Kernel.GH_Convert.StringToTime(System.String,System.DateTime@)
Convert a string representing a time into an pure time. Allowed separators of hour, minute and second
portions are colons, semi-colons, points and commas. Grasshopper itself uses colons when formatting times.
A PM or AM symbol is allowed provided it does not border on any alphabetical characters.
A time can be prefixed by a "X day[s] + " string which defines the total number of 24-hour periods to
include.
text: String to parse.
time: If the string could be parsed, the pure time will be returned here.
Returns: True if string was successfully parsed, false if not.

Grasshopper.Kernel.GH_Convert.FileToHash(System.String)
Create a hash of a file.
path: File to hash.
Returns: A hash of the file contents. File name and attributes are not taken into consideration.