Grasshopper.GUI.GH_FileRecoveryAction
Enumerates the possible actions to undertake in case of a recovery file.

Grasshopper.GUI.GH_FileRecoveryAction.None
Represents no action.

Grasshopper.GUI.GH_FileRecoveryAction.OpenRecoveryFile
Open the recovery file instead of the regular file.

Grasshopper.GUI.GH_FileRecoveryAction.SaveRecoveryFile
Save the recovery file under a different name.

Grasshopper.GUI.GH_FileRecoveryAction.DeleteRecoveryFile
Ignore the recovery file and open the regular file instead.