Grasshopper.Kernel.GH_ObjectChangedEventArgs
Event arguments passed during ObjectChanged events.

Grasshopper.Kernel.GH_ObjectChangedEventArgs.Sender
Gets the object which raised this event.

Grasshopper.Kernel.GH_ObjectChangedEventArgs.Tag
Gets the tag for this event.

Grasshopper.Kernel.GH_ObjectChangedEventArgs.Type
Gets the type of this event.

Grasshopper.Kernel.GH_ObjectChangedEventArgs.CustomType
Gets the customised type description of this event.
This field is only set when the Type is GH_ObjectEventType.Custom.