Grasshopper.Kernel.Types.IGH_FieldElement
Represents the basic interface for field elements.

Grasshopper.Kernel.Types.IGH_FieldElement.Duplicate
Create an exact copy of this element.

Grasshopper.Kernel.Types.IGH_FieldElement.Force(Rhino.Geometry.Point3d)
Compute the force at a given location.

Grasshopper.Kernel.Types.IGH_FieldElement.ElementGuid
Gets the element Guid for this element.

Grasshopper.Kernel.Types.IGH_FieldElement.BoundingBox
Gets the visual boundingbox of all the geometry used to represent this element in 3D.

Grasshopper.Kernel.Types.IGH_FieldElement.IsLimited
Gets or sets whether this element affects a limited region.

Grasshopper.Kernel.Types.IGH_FieldElement.Limits
Gets or sets the limits of this region. Unless IsLimited equals true,
the Limits property is ignored.

Grasshopper.Kernel.Types.IGH_FieldElement.IsCoincident(Rhino.Geometry.Point3d,System.Double)
Computes whether the point can be considered coincident with the element.
point: Point to test.
tolerance: Tolerance to use.
Returns: True if the point is coincident within tolerance.