Grasshopper.Kernel.Geometry.GH_CurveOffset
Utility class for computing curve offsets a la Grasshopper.

Grasshopper.Kernel.Geometry.GH_CurveOffset.#ctor(Rhino.Geometry.Curve,Rhino.Geometry.Plane)
Create a new instance of the Curve offsetter.
curve: Curve to offset.
offsetPlane: Plane for offset. The curve will be projected onto this plane.

Grasshopper.Kernel.Geometry.GH_CurveOffset.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.Plane)
Create a new instance of the Curve offsetter.
curves: Curves to offset.
offsetPlane: Plane for offset. The curve will be projected onto this plane.

Grasshopper.Kernel.Geometry.GH_CurveOffset.OffsetPlane
Gets the offset plane.

Grasshopper.Kernel.Geometry.GH_CurveOffset.OffsetSamples(System.Double)
Utility method for getting all offset samples.
distance: Offset distance.
Returns: A polyline containing all sampler per curve segment.

Grasshopper.Kernel.Geometry.GH_CurveOffset.Offset(System.Double,Grasshopper.Kernel.Geometry.GH_CurveOffsetCorner)
Offset the curve(s) and apply all trimming and joining logic.
distance: Offset distance. Note that distance is measured to the right of open curves and
outwards for closed curves.
corner: Corner type to use for G0 offsets.
Returns: List of offset results.