Grasshopper.GUI.GH_RotationalTuningData`1
Utility class for keeping track of rotational mouse events.
Basic type for initial conditions.

Grasshopper.GUI.GH_RotationalTuningData`1.#ctor(`0,System.Drawing.PointF)
Create a new instance of the rotational tuning data.
initialValue: Initial value to store. Whatever you want it to be.
pivot: Center of rotation.

Grasshopper.GUI.GH_RotationalTuningData`1.#ctor(`0,System.Drawing.PointF,System.Drawing.PointF)
Create a new instance of the rotational tuning data.
initialValue: Initial value to store. Whatever you want it to be.
pivot: Center of rotation.
initialPoint: First point of track.

Grasshopper.GUI.GH_RotationalTuningData`1.InitialValue
Gets the initial value.

Grasshopper.GUI.GH_RotationalTuningData`1.Pivot
Gets or sets the rotational pivot. You only need to set this if the pivot changes.

Grasshopper.GUI.GH_RotationalTuningData`1.FrameCount
Gets the total number of recorded frames.

Grasshopper.GUI.GH_RotationalTuningData`1.Frame(System.Int32)
Gets the frame at the given index.
index: Index of frame.

Grasshopper.GUI.GH_RotationalTuningData`1.AddFrame(System.Drawing.PointF)
Grow the tuning track by one point and compute the angle.
point: Point (in canvas coordinates) to record.

Grasshopper.GUI.GH_RotationalTuningData`1.TotalAngle
Compute the total angle from the first to the last frame.

Grasshopper.GUI.GH_RotationalTuningData`1.TotalTurns
Compute the total number of full turns from the first to the last frame.