Grasshopper.Kernel.GH_Process
Provides static (Shared) access to several basic Win Process properties.

Grasshopper.Kernel.GH_Process.#ctor
You cannot construct a new process instance.
Use the static (Shared in Visual Basic) methods on this class.

Grasshopper.Kernel.GH_Process.Handle
Gets the native handle for this instance of Rhino.

Grasshopper.Kernel.GH_Process.Name
Gets the name of Rhino's main module.

Grasshopper.Kernel.GH_Process.HasExited
Gets a value indicating whether this instance of Rhino has exited.

Grasshopper.Kernel.GH_Process.PrivateBytes
Gets the amount of private memory allocated for this instance of Rhino.

Grasshopper.Kernel.GH_Process.PeakPrivateBytes
Gets the maximum allowed working size for this instance of Rhino.

Grasshopper.Kernel.GH_Process.WorkingSet
Gets the amount of physical memory allocated for this instance of Rhino.

Grasshopper.Kernel.GH_Process.MaxWorkingSet
Gets the maximum allowed working size for this instance of Rhino.

Grasshopper.Kernel.GH_Process.HandleCount
Gets the number of handles defined in this process.