Grasshopper.Kernel.GH_WireTopologyDiagram
Represents any number of topological wires.

Grasshopper.Kernel.GH_WireTopologyDiagram.Add(Grasshopper.Kernel.GH_WireTopology,System.Boolean)
Add a new wire is it isn't part of the diagram already.
wire: Wire to add, cannot be null.
filter_duplicates: If true, and the wire is a duplicate of aother wire already in the diagram, the wire is not added.

Grasshopper.Kernel.GH_WireTopologyDiagram.AppendDiagram(Grasshopper.Kernel.GH_Document)
Create a wire topology diagram which describes the entire document.
doc: Document to parse

Grasshopper.Kernel.GH_WireTopologyDiagram.AppendDiagram(System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_DocumentObject})
Create a wire topology diagram which describes a set of objects.
objs: Document to parse

Grasshopper.Kernel.GH_WireTopologyDiagram.AppendDiagram(Grasshopper.Kernel.IGH_DocumentObject)
Create a wire topology diagram which describes a single object.
obj: Document to parse

Grasshopper.Kernel.GH_WireTopologyDiagram.EnsureConnections(Grasshopper.Kernel.GH_Document,System.Boolean)
Creates the topological connector wire if it doesn't already exist.
doc: Document which contains the source and parameter indices.

Grasshopper.Kernel.GH_WireTopologyDiagram.DestroyConnections(Grasshopper.Kernel.GH_Document,System.Boolean)
Destroys the topological connector wire if it exists.
doc: Document which contains the source and parameter indices.