Grasshopper.Kernel.GH_Filter
Enumerates all object Search filters.

Grasshopper.Kernel.GH_Filter.DontCare
Property is ignored.

Grasshopper.Kernel.GH_Filter.Include
Objects are requires to have this state in order to be included.

Grasshopper.Kernel.GH_Filter.Exclude
Objects are not allowed to have this state in order to be included.