Grasshopper.GUI.GH_MenuShortCutWrapper
Utility class for handling menu shortcuts in non-modal Windows.Forms dialogs.

Grasshopper.GUI.GH_MenuShortCutWrapper.#ctor
This class only exposes Shared (static) methods and cannot be constructed.

Grasshopper.GUI.GH_MenuShortCutWrapper.GenerateShortcutCommand(System.Windows.Forms.Keys,System.Windows.Forms.ToolStrip)
Call this function to test all menu items for short-cut matches.
If the shortcut key-combo in the keyCode enumeration can be matched to a menu item,
the PerformClick() method on that item will be called. Disabled and hidden items
will be skipped entirely.
keyCode: Short cut key code
menu: Any toolstrip containing menu items.
Returns: True if a menu item was activated, false otherwise.