Grasshopper.Kernel.Types.GH_Rectangle
Represents a 3D rectangle. GH_Rectangle re-implements the RhinoCommon Rectangle3d.

Grasshopper.Kernel.Types.GH_Rectangle.#ctor
Default constructor

Grasshopper.Kernel.Types.GH_Rectangle.#ctor(Rhino.Geometry.Rectangle3d)
Create a duplicate of another rectangle.
rec: Rectangle to copy. If null, a default rectangle will be created.

Grasshopper.Kernel.Types.GH_Rectangle.#ctor(Grasshopper.Kernel.Types.GH_Rectangle)
Create a duplicate of another circle.
other: Circle to mimic.

Grasshopper.Kernel.Types.GH_Rectangle.DuplicateGeometry
Create a duplicate of this rectangle.

Grasshopper.Kernel.Types.GH_Rectangle.DuplicateRectangle
Create a duplicate of this rectangle.

Grasshopper.Kernel.Types.GH_Rectangle.IsValid
Gets the validity of this instance.

Grasshopper.Kernel.Types.GH_Rectangle.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Kernel.Types.GH_Rectangle.Boundingbox
Gets the boundingbox for this geometry.
Returns: The boundingbox for this piece of geometry or
Boundingbox.Empty if the geometry is null or invalid.

Grasshopper.Kernel.Types.GH_Rectangle.ToString
Format the circle using default grasshopper formatting logic.

Grasshopper.Kernel.Types.GH_Rectangle.CastFrom(System.Object)
Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_Rectangle.CastTo``1(``0@)
Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_Rectangle.EmitProxy
Returns a proxy that represents this rectangle. Do not call this function unless you're