Grasshopper.GUI.Base.GH_ScrollBarVerticalBase
Provides basic vertical scroll bar logic.

Grasshopper.GUI.Base.GH_ScrollBarVerticalBase.Minimum
Gets or sets the minimum height of the scrollbar.

Grasshopper.GUI.Base.GH_ScrollBarVerticalBase.Content
Gets or sets the height of the content

Grasshopper.GUI.Base.GH_ScrollBarVerticalBase.Display
Gets or sets the height of the display area.

Grasshopper.GUI.Base.GH_ScrollBarVerticalBase.Offset
Gets the offset of the scroller.

Grasshopper.GUI.Base.GH_ScrollBarVerticalBase.OffsetNormalised
Gets or sets the normalised offset of the scroller.

Grasshopper.GUI.Base.GH_ScrollBarVerticalBase.ContentOffset
Gets the vertical offset (in pixels) of the scrolled content.

Grasshopper.GUI.Base.GH_ScrollBarVerticalBase.ScrollBar(System.Drawing.Rectangle)
Compute the size and position of the scroll bar in the scroll rail.
rail: Rail for scroll bar to move around in.
Returns: A rectangle describing the location and extends of the scroll bar.

Grasshopper.GUI.Base.GH_ScrollBarVerticalBase.ScrollBar(System.Drawing.RectangleF)
Compute the size and position of the scroll bar in the scroll rail.
rail: Rail for scroll bar to move around in.
Returns: A rectangle describing the location and extends of the scroll bar.

Grasshopper.GUI.Base.GH_ScrollBarVerticalBase.BeginDrag(System.Drawing.RectangleF,System.Double)
Start a new drag operation.
region: Scroll bar region (the rectangle in which the scroll bar is allowed to move).
start: Vertical offset of scroll drag.

Grasshopper.GUI.Base.GH_ScrollBarVerticalBase.ContinueDrag(System.Double)
Continue a drag operation.
position: New offset hint.
Returns: True if the drag resulted in an offset change, false if not.