Grasshopper.GUI.IGH_FileDropTarget
Implement this interface in your IGH_DocumentObject if you want to participate in Drag+Drop events.

Grasshopper.GUI.IGH_FileDropTarget.AcceptableFile(System.String)
Gets a value indicating whether or not the path can be handled by the local object.
path: Path to file in question.
Returns: True if the file can be handled, false if otherwise.

Grasshopper.GUI.IGH_FileDropTarget.HandleDrop(System.String,System.Drawing.PointF)
Handle a file drop.
path: Path of file to handle.
mouse_pt: Point at which the drop occured.
Returns: True on success, false on failure.