Grasshopper.Kernel.GH_DocumentEventServer
RhinoCommon only event server.

Grasshopper.Kernel.GH_DocumentEventServer.#ctor(Grasshopper.Kernel.GH_Document)
Create and register a new event server.
document: Document that owns this event server.

Grasshopper.Kernel.GH_DocumentEventServer.Enabled
Gets or sets the enabled state flag for this event watcher.
Returns:
Remarks:

Grasshopper.Kernel.GH_DocumentEventServer.ExpireAllObjects
Expire all the objects in the table.

Grasshopper.Kernel.GH_DocumentEventServer.ExpireObjects(System.Guid)
Expire all the objects that are associated with the given Rhino Object Id.

Grasshopper.Kernel.GH_DocumentEventServer.ScheduleSolution
Trigger the NewSolution method and reset the update flag if and only if the document is enabled.

Grasshopper.Kernel.GH_DocumentEventServer.GuidTableRefCount
Gets the number of stored ids in the Guid Table.

Grasshopper.Kernel.GH_DocumentEventServer.ClearGuidTable
Clear the entire ID table.

Grasshopper.Kernel.GH_DocumentEventServer.CreateGuidTable
Create the entire ID table from scratch.

Grasshopper.Kernel.GH_DocumentEventServer.EnsureGuidTable
Create the entire ID table if it doesn't exist yet.