Grasshopper.Kernel.GH_ConnectivityDisparity
Maintains two connectivity diagrams, one of which is a subset of the other.

Grasshopper.Kernel.GH_ConnectivityDisparity.#ctor(Grasshopper.Kernel.GH_ConnectivityDiagram,Grasshopper.Kernel.GH_ConnectivityDiagram)
Create a new instance of the Connectivity Disparity utility class.
topset: Overarching connectivity diagram.
subset: Partial connectivity diagram.

Grasshopper.Kernel.GH_ConnectivityDisparity.TopSet
Gets a pointer to the complete diagram stored in this disparity class.

Grasshopper.Kernel.GH_ConnectivityDisparity.SubSet
Gets a pointer to the subset diagram stored in this disparity class.

Grasshopper.Kernel.GH_ConnectivityDisparity.TopNodes
Gets a proxy for all the Nodes in the Top Level diagram.

Grasshopper.Kernel.GH_ConnectivityDisparity.SubNodes
Gets a proxy for all the Nodes in the Subset diagram.

Grasshopper.Kernel.GH_ConnectivityDisparity.ExternalInputs(System.Guid)
Find all external sources for a given id in the subset.
id: ID of parameter.
Returns: A list containing all sources that are not present in the subset topology.

Grasshopper.Kernel.GH_ConnectivityDisparity.InternalInputs(System.Guid)
Find all internal sources for a given id in the subset.
id: ID of parameter.
Returns: A list containing all sources that are present in the subset topology.

Grasshopper.Kernel.GH_ConnectivityDisparity.ExternalOutputs(System.Guid)
Find all external recipients for a given id in the subset.
id: ID of parameter.
Returns: A list containing all recipients that are not present in the subset topology.

Grasshopper.Kernel.GH_ConnectivityDisparity.InternalOutputs(System.Guid)
Find all external recipients for a given id in the subset.
id: ID of parameter.
Returns: A list containing all recipients that are present in the subset topology.