Grasshopper.Kernel.Types.GH_LonLatCoordinate.Latitude
Gets or sets the longitude (in degrees) of the location.

Grasshopper.Kernel.Types.GH_LonLatCoordinate.Longitude
Gets or sets the longitude (in degrees) of the location.

Grasshopper.Kernel.Types.GH_LonLatCoordinate.SphereUParameter
Gets the spherical U parameter.

Grasshopper.Kernel.Types.GH_LonLatCoordinate.SphereVParameter
Gets the spherical V parameter.