Grasshopper.GUI.GH_Label
Label control that inherits from System.Windows.Forms.Label but incorporates
forced ClearType rendering.

Grasshopper.GUI.GH_Label.Text
Gets or sets the text to be displayed on this panel.

Grasshopper.GUI.GH_Label.TextAlign
Gets or sets the alignment for text.

Grasshopper.GUI.GH_Label.Image
Gets or sets the image to be displayed.

Grasshopper.GUI.GH_Label.ImageAlign
Gets or sets the alignment for the image.