Grasshopper.GUI.Ribbon.GH_RibbonTab


Grasshopper.GUI.Ribbon.GH_RibbonTab.#ctor(Grasshopper.GUI.Ribbon.GH_Ribbon,System.String)
Default constructor.
owner: Owner control, can be NULL, but you must set it prior to calling any UI methods.
name: Name of the tab.

Grasshopper.GUI.Ribbon.GH_RibbonTab.Owner
Gets the owner control for this tab.
The GH_RibbonControl owner
Remarks: If you supply a NULL value, you cannot call any interface methods

Grasshopper.GUI.Ribbon.GH_RibbonTab.NameFull
Gets the full name of the tab.

Grasshopper.GUI.Ribbon.GH_RibbonTab.NameShort
Gets the abbreviated name of the tab.

Grasshopper.GUI.Ribbon.GH_RibbonTab.NameSymbol
Gets the single char name of the tab.

Grasshopper.GUI.Ribbon.GH_RibbonTab.Icon
Gets the tab icon (might not exist)

Grasshopper.GUI.Ribbon.GH_RibbonTab.HasIcon
Gets whether this tab has an icon associated with it.

Grasshopper.GUI.Ribbon.GH_RibbonTab.DisplayStyle
Gets or sets the display style of a tab.
This style is set by the ribbon control during layout,
do not set it yourself.

Grasshopper.GUI.Ribbon.GH_RibbonTab.ComputeTabSize(System.Drawing.Font)
Compute the tab size using the current DisplayStyle.
font: Font to use.
Returns: A size structure which is big enough to contain the entire tab grip.

Grasshopper.GUI.Ribbon.GH_RibbonTab.ComputeTabSize(System.Drawing.Font,Grasshopper.GUI.Ribbon.GH_TabDisplay)
Compute the tab size using a custom DisplayStyle.
font: Font to use.
display: Display style override.
Returns: A size structure which is big enough to contain the entire tab grip.

Grasshopper.GUI.Ribbon.GH_RibbonTab.Grip
Gets or sets the grip region for this tab.
Remarks: The grip region is the clickable region around the name.

Grasshopper.GUI.Ribbon.GH_RibbonTab.Panels
Gets the internal collection of panels.

Grasshopper.GUI.Ribbon.GH_RibbonTab.EnsurePanel(System.String)
Ensures a panel with a certain name exists.

Grasshopper.GUI.Ribbon.GH_RibbonTab.PerformLayout
Performs layout logic of all panels

Grasshopper.GUI.Ribbon.GH_RibbonTab.StackPanelsLeftToRight
Stacks all the panels. Panel height is adjusted to match the tab client height.
The PerformLayout() function is called on each panel as well.

Grasshopper.GUI.Ribbon.GH_RibbonTab.TotalPanelWidth
Computes the total width taken up by all panels

Grasshopper.GUI.Ribbon.GH_RibbonTab.LargestPanel
Returns the index of the widest panel
Returns:
Remarks: If there are multiple widest panels, the rightmost one is returned

Grasshopper.GUI.Ribbon.GH_RibbonTab.SmallestPanel
Returns the index of the thinnest panel
Returns:
Remarks: If there are multiple thinnest panels, the leftmost one is returned