Grasshopper.My.Resources.Res_MaterialEditor
A strongly-typed resource class, for looking up localized strings, etc.

Grasshopper.My.Resources.Res_MaterialEditor.ResourceManager
Returns the cached ResourceManager instance used by this class.

Grasshopper.My.Resources.Res_MaterialEditor.Culture
Overrides the current thread's CurrentUICulture property for all
resource lookups using this strongly typed resource class.

Grasshopper.My.Resources.Res_MaterialEditor.BackEdges_100x100
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MaterialEditor.BackGround_100x100
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MaterialEditor.ConstantGrey
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MaterialEditor.FrontEdges_100x100
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MaterialEditor.GroundShadow_100x100
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MaterialEditor.Highlight_100x100
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MaterialEditor.SelfShadow_100x100
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MaterialEditor.SphereShading_100x100
Looks up a localized resource of type System.Drawing.Bitmap.