Grasshopper.GUI.Script.GH_CodeBlock
Represents a collection of lines of code in the GH_ScriptEditor window.

Grasshopper.GUI.Script.GH_CodeBlock.Lines
Gets or sets the line of code.

Grasshopper.GUI.Script.GH_CodeBlock.ReadOnly
Gets or sets the readonly state of the code.