Grasshopper.Kernel.GH_RelevantObjectFilter
Enumerates the possible filters to use in relevant object searches.

Grasshopper.Kernel.GH_RelevantObjectFilter.None
Blank filter. When combined with another filter it is ignored.

Grasshopper.Kernel.GH_RelevantObjectFilter.Groups
Include group objects in the search.

Grasshopper.Kernel.GH_RelevantObjectFilter.InputGrips
Include input grips in the search.

Grasshopper.Kernel.GH_RelevantObjectFilter.OutputGrips
Include output grips in the search.

Grasshopper.Kernel.GH_RelevantObjectFilter.Grips
Include both input and outpu grips in the search.

Grasshopper.Kernel.GH_RelevantObjectFilter.Attributes
Include attribute bounds in the search.

Grasshopper.Kernel.GH_RelevantObjectFilter.Wires
Include wires (currently not yet supported)

Grasshopper.Kernel.GH_RelevantObjectFilter.All
Search all possible objects.