Grasshopper.Kernel.IRcpAwareObject
Implement this interface in a parameter or component if you want to be publishable on the remote control panel.

Grasshopper.Kernel.IRcpAwareObject.PublishRcpItem
Emit a new object to be inserted on a Remote Control Panel.