Grasshopper.Kernel.Data.GH_Structure`1.ConversionDelegate`2
Represents a conversion between two types of IGH_Goo.
Type to convert from.
Type to convert to.
data: Data to convert.
Returns: Convered data.