Grasshopper.GUI.Canvas.GH_NamedView
Named views are used both to store named views but also to allow smooth programmatic canvas navigation.

Grasshopper.GUI.Canvas.GH_NamedView.#ctor
Create a default named view.

Grasshopper.GUI.Canvas.GH_NamedView.#ctor(System.String,System.Drawing.PointF,System.Single,Grasshopper.GUI.Canvas.GH_NamedViewType)
Create a new named view.
view_name: Name of view.
view_point: Anchor point of named view.
view_zoom: Zoom factor of named view.
view_type: The type of named view.

Grasshopper.GUI.Canvas.GH_NamedView.#ctor(System.Drawing.Rectangle,System.Drawing.RectangleF)
Create a new view useful for box-fit transitions.
view_box: The dimensions of the area into which we want to display something in control coordinates. For example, the Visible area in a Viewport.
target_box: The dimensions of the area we want to display in viewport coordinates. For example, the bounding box of some objects.

Grasshopper.GUI.Canvas.GH_NamedView.#ctor(Grasshopper.GUI.Canvas.GH_Viewport,System.Drawing.Rectangle,System.Drawing.PointF)
Create a new view useful for point inclusion transitions.
view: Viewport this transition is supposed to work in.
region: Region into which the target is supposed to be visible in control coordinates.
For example, the contents of the viewport.
target: Point to ensure.

Grasshopper.GUI.Canvas.GH_NamedView.#ctor(Grasshopper.GUI.Canvas.GH_Viewport,System.Drawing.Point,System.Drawing.PointF)
Create a new view useful for point match transitions.
view: Viewport this transition is supposed to work in.
point: Point in control coordinates that is supposed to be matched.
target: Point in canvas coordinates that will be matched.

Grasshopper.GUI.Canvas.GH_NamedView.Name
Gets or sets the name of the view.

Grasshopper.GUI.Canvas.GH_NamedView.Zoom
Gets or sets the zoom factor of the named view.

Grasshopper.GUI.Canvas.GH_NamedView.Point
Gets or sets the anchor point of the named view.

Grasshopper.GUI.Canvas.GH_NamedView.Type
Gets or sets a value indicating whether the anchor point represents the target or the center.

Grasshopper.GUI.Canvas.GH_NamedView.LoadFromViewport(Grasshopper.GUI.Canvas.GH_Viewport,Grasshopper.GUI.Canvas.GH_NamedViewType)
Create a named view from a viewport.
vp: Viewport to mimic.
view_type: Type of named view to create.

Grasshopper.GUI.Canvas.GH_NamedView.SetToViewport(Grasshopper.GUI.Canvas.GH_Canvas)
Set the named view to the canvas viewport and redraw the canvas.
cv: Canvas to set

Grasshopper.GUI.Canvas.GH_NamedView.SetToViewport(Grasshopper.GUI.Canvas.GH_Viewport)
Set the named view to a viewport.
vp: Viewport to set.

Grasshopper.GUI.Canvas.GH_NamedView.SetToViewport(Grasshopper.GUI.Canvas.GH_Canvas,System.Int32)
Animates a view transition.
cv: Canvas to apply the transition to.
length: Length (in milliseconds) of the transition.

Grasshopper.GUI.Canvas.GH_NamedView.SmoothFrame
This event is raised during smooth animations.

Grasshopper.GUI.Canvas.GH_NamedView.Blend(System.Single,System.Single,System.Single)
Interpolate between A and B.
A: First value
B: Second value
t: Interpolation parameter.

Grasshopper.GUI.Canvas.GH_NamedView.BlendExponential(System.Single,System.Single,System.Single)
Interpolate exponentially between A and B.
A: First value, cannot be zero.
B: Second value, cannot be zero.
t: Interpolation parameter.