Grasshopper.Kernel.GH_MarkovPattern
Represents a Markov chain pattern and associated outcomes.

Grasshopper.Kernel.GH_MarkovPattern.Depth
Gets the depth this pattern as implied by the pattern length.

Grasshopper.Kernel.GH_MarkovPattern.MaximumValence
Gets the highest outcome valence in this pattern.
Returns:

Grasshopper.Kernel.GH_MarkovPattern.Pattern
Gets the pattern of GUIDs.

Grasshopper.Kernel.GH_MarkovPattern.Outcomes
Gets all the outcomes associated with this pattern.

Grasshopper.Kernel.GH_MarkovPattern.IsInsignificant
Gets a value indicating whether or not this pattern is insignificant in the grand scheme of things.

Grasshopper.Kernel.GH_MarkovPattern.RemoveInsignificantOutcomes
Remove all insignificant outcomes from this pattern.

Grasshopper.Kernel.GH_MarkovPattern.AppendOutcome(System.Guid)
Append a new outcome to this pattern or increment an existing outcome.
id: ID of outcome to increment or append.

Grasshopper.Kernel.GH_MarkovPattern.AppendOutcome(Grasshopper.Kernel.GH_MarkovOutcome)
Append a new outcome to this pattern or increment an existing outcome.
outcome: Outcome to increment or append.

Grasshopper.Kernel.GH_MarkovPattern.Simplify
Simplify this pattern by removing the least significant outcomes.