Grasshopper.My.Resources.Res_WheelMenu
A strongly-typed resource class, for looking up localized strings, etc.

Grasshopper.My.Resources.Res_WheelMenu.ResourceManager
Returns the cached ResourceManager instance used by this class.

Grasshopper.My.Resources.Res_WheelMenu.Culture
Overrides the current thread's CurrentUICulture property for all
resource lookups using this strongly typed resource class.

Grasshopper.My.Resources.Res_WheelMenu.Bake_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_WheelMenu.Cluster_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_WheelMenu.EnabledOff_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_WheelMenu.EnabledOn_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_WheelMenu.Find_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_WheelMenu.Group_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_WheelMenu.Navigate_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_WheelMenu.Preferences_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_WheelMenu.PreviewOff_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_WheelMenu.PreviewOn_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_WheelMenu.Recompute_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_WheelMenu.SolverOff_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_WheelMenu.SolverOn_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_WheelMenu.Zoom_24x24
Looks up a localized resource of type System.Drawing.Bitmap.