Grasshopper.GUI.Base.GH_DigitAlign
Enumerates the possible alignments for digits inside the GH_DigitScroller control.

Grasshopper.GUI.Base.GH_DigitAlign.Justify
Digits expand to fill out the entire free space.

Grasshopper.GUI.Base.GH_DigitAlign.Left
Digits are stacked against the left side of the control.

Grasshopper.GUI.Base.GH_DigitAlign.Center
Digits are stacked together in the center of the control.

Grasshopper.GUI.Base.GH_DigitAlign.Right
Digits are stacked against the right side of the control.