Grasshopper.Kernel.IGH_EventConsumer
Implement this interface if you want to inter-operate with a GH_EventServer.

Grasshopper.Kernel.IGH_EventConsumer.IsRelevantEvent(Rhino.DocObjects.RhinoObject)
Whenever a new object event is handled, this function will be called to determine whether it will cause an update.
obj: Object that is the pivot of the event.
Returns: True if the object should cause an update, false if not.

Grasshopper.Kernel.IGH_EventConsumer.PartialExpiration(Grasshopper.Kernel.GH_CustomEventServer)
This method will be called by the GH_CustomEventServer to indicate one or more
interesting object events can now be processed.
server: Server that called this method.

Grasshopper.Kernel.IGH_EventConsumer.TotalExpiration(Grasshopper.Kernel.GH_CustomEventServer)
This method will be called by the GH_CustomEventServer to indicate all
interesting object events can now be processed.
server: Server that called this method.