Grasshopper.My.Resources.Res_CanvasToolbar
A strongly-typed resource class, for looking up localized strings, etc.

Grasshopper.My.Resources.Res_CanvasToolbar.ResourceManager
Returns the cached ResourceManager instance used by this class.

Grasshopper.My.Resources.Res_CanvasToolbar.Culture
Overrides the current thread's CurrentUICulture property for all
resource lookups using this strongly typed resource class.

Grasshopper.My.Resources.Res_CanvasToolbar.Add_Group_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.Add_Label_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.Add_Separator_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.AddDataItem_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.AddPathItem_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.AutoUpdate_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.BeforeAfterSolveInstance_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.BlackYellowBands_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.BracketClose_24x10
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.BracketOpen_24x10
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.DeleteDataItem_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.Edit_Mode_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.EditDataAsText_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.Focus_LowerLeft_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.Focus_LowerRight_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.Focus_UpperLeft_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.Focus_UpperRight_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.NamedView_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.OpenFile_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.Preview_Boundary_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.Preview_BumpZBuffer_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.Preview_Gumballs_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.Preview_MeshEdges_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.Preview_Off_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.Preview_PreviewMeshCoarse_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.Preview_PreviewMeshCustom_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.Preview_PreviewMeshDocument_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.Preview_PreviewMeshNone_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.Preview_PreviewMeshSmooth_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.Preview_Selected_Filter_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.Preview_Settings_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.Preview_Shaded_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.Preview_Wireframe_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.SaveFile_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.ShrinkWindow_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.Sketch_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.Target_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.TargetInactive_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.ZoomAllObjects_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_CanvasToolbar.ZoomSelectedObjects_20x20
Looks up a localized resource of type System.Drawing.Bitmap.