Grasshopper.GUI.GH_SamplingSphere
Represents a coloured sphere that can be sampled at various rotations.

Grasshopper.GUI.GH_SamplingSphere.Size
Gets the size of this sample grid.

Grasshopper.GUI.GH_SamplingSphere.SampleCount
Gets the total number of samples contained in this sampling grid.

Grasshopper.GUI.GH_SamplingSphere.SampleSphere(Rhino.Geometry.Sphere)
Sample the UV locations of a sphere. The sphere should be centered on the world origin.
sphere: Sphere to sample.
Returns: A two-dimensional array of Sphere UV locations, one for each sample point.

Grasshopper.GUI.GH_SamplingSphere.SampleSphere(Rhino.Geometry.Sphere,Grasshopper.Kernel.GH_MemoryBitmap)
Sample a sphere with a UV texture and return a bitmap of sampled values.
sphere: Sphere to sample, it should be centered on the world origin.
texture: Texture to sample, the texture will not be modified.
Returns: A bitmap of Size x Size pixels.