Grasshopper.Kernel.Types.GH_Transform
Represents a collection of transformations.

Grasshopper.Kernel.Types.GH_Transform.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Kernel.Types.GH_Transform.CompoundTransforms
Gets the internal set of transforms. If you modify the compound transformations, you
must call ClearCaches().

Grasshopper.Kernel.Types.GH_Transform.ClearCaches
Erase the compound transformation caches.

Grasshopper.Kernel.Types.GH_Transform.EmitProxy
Returns a proxy that represents this transform. Do not call this function unless you're