Grasshopper.Kernel.Types.GH_Extrusion
Represents a 3D extrusion. GH_Extrusion wraps the functionality of the OpenNURBS OnExtrusion class.

Grasshopper.Kernel.Types.GH_Extrusion.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.