Grasshopper.Kernel.GH_DocEnabledEventArgs
These arguments are passed along with SettingsChanged events on GH_Document.

Grasshopper.Kernel.GH_DocEnabledEventArgs.Document
Gets the document that raised the event.

Grasshopper.Kernel.GH_DocEnabledEventArgs.Enabled
Gets the value of the document Enabled flag at the time the event was raised,
it may have been changed in between by other event handlers.