Grasshopper.GUI.GH_CanvasMouseEvent
Class used in Canvas UI events.

Grasshopper.GUI.GH_CanvasMouseEvent.m_control_location
The location of the cursor in control pixel coordinates.

Grasshopper.GUI.GH_CanvasMouseEvent.m_canvas_location
The location of the cursor in canvas coordinates.

Grasshopper.GUI.GH_CanvasMouseEvent.m_button
A value indicating which buttons were pressed when this event was raised.

Grasshopper.GUI.GH_CanvasMouseEvent.m_clicks
Represents the number of times the buttons were pressed and released.

Grasshopper.GUI.GH_CanvasMouseEvent.m_delta
Represents a signed count of the number of detents the mouse wheel has rotated.
A detent is one notch of the mouse wheel.

Grasshopper.GUI.GH_CanvasMouseEvent.#ctor(Grasshopper.GUI.Canvas.GH_Viewport,System.Windows.Forms.MouseEventArgs)
Constructor.
vp: The current canvas viewport state.
e_args: Original mouse event args.

Grasshopper.GUI.GH_CanvasMouseEvent.#ctor(System.Drawing.Point,System.Drawing.PointF,System.Windows.Forms.MouseButtons,System.Int32,System.Int32)
Constructor.
pt_control: Cursor location in control pixel coordinates.
pt_canvas: Cursor location in canvas unit coordinates.
mButton: Currently pressed mouse buttons.
iClicks: Number of times the buttons were pressed and released.
iDelta: A signed count of the number of detents the mouse wheel has rotated.

Grasshopper.GUI.GH_CanvasMouseEvent.#ctor
Blank constructor.

Grasshopper.GUI.GH_CanvasMouseEvent.ControlLocation
Gets the location of the cursor in control pixel coordinates.

Grasshopper.GUI.GH_CanvasMouseEvent.CanvasLocation
Gets the location of the cursor in canvas unit coordinates.

Grasshopper.GUI.GH_CanvasMouseEvent.ControlX
Gets the x-coordinate of the cursor location in control pixel coordinates.

Grasshopper.GUI.GH_CanvasMouseEvent.ControlY
Gets the y-coordinate of the cursor location in control pixel coordinates.

Grasshopper.GUI.GH_CanvasMouseEvent.CanvasX
Gets the x-coordinate of the cursor location in canvas unit coordinates.

Grasshopper.GUI.GH_CanvasMouseEvent.CanvasY
Gets the y-coordinate of the cursor location in canvas unit coordinates.

Grasshopper.GUI.GH_CanvasMouseEvent.Button
Gets which mouse button was pressed.

Grasshopper.GUI.GH_CanvasMouseEvent.Clicks
Gets the number of times the mouse button was pressed and released.

Grasshopper.GUI.GH_CanvasMouseEvent.Delta
Gets a signed count of the number of detents the mouse wheel has rotated. A detent is one notch of the mouse wheel.

Grasshopper.GUI.GH_CanvasMouseEvent.WinFormsEventArgs
Downcast this data into a Windows.Forms.MouseEventArgs instance.