Grasshopper.Kernel.GH_RelevantObjectData
Contains information about relevant objects at a specific canvas location.

Grasshopper.Kernel.GH_RelevantObjectData.#ctor(System.Drawing.PointF)
Construct a new instance.
pt: Point for relevant data aquisition.

Grasshopper.Kernel.GH_RelevantObjectData.Point
Gets the point for which this GH_RelevantObjectData has been made.

Grasshopper.Kernel.GH_RelevantObjectData.ObjectType
Gets the type of object indicated by this data.

Grasshopper.Kernel.GH_RelevantObjectData.Attributes
Gets the attributes that belong to the object.

Grasshopper.Kernel.GH_RelevantObjectData.Object
Gets the raw object cached in this data instance.

Grasshopper.Kernel.GH_RelevantObjectData.TopLevelObject
Gets the top-level object.

Grasshopper.Kernel.GH_RelevantObjectData.IsTopLevelObject
Gets a value indicating whether or not the Object is a top-level object.

Grasshopper.Kernel.GH_RelevantObjectData.Parameter
Gets the cast of the DocObject to IGH_Param.
If the DocObject is not of type IGH_Param, the
attributes of the object will be perused to find a
nested IGH_Param at the point.

Grasshopper.Kernel.GH_RelevantObjectData.Group
Gets the cast of the DocObject to GH_Group.