Grasshopper.Kernel.GH_FileWatcherEvents
Enumerates all possible file watcher events. These can be combined.

Grasshopper.Kernel.GH_FileWatcherEvents.None
No events are specified.

Grasshopper.Kernel.GH_FileWatcherEvents.Changed
The file is changed.

Grasshopper.Kernel.GH_FileWatcherEvents.Renamed
The file is renamed.

Grasshopper.Kernel.GH_FileWatcherEvents.Created
A file is created.

Grasshopper.Kernel.GH_FileWatcherEvents.Deleted
A file is deleted.

Grasshopper.Kernel.GH_FileWatcherEvents.All
Represents all possible events.