Grasshopper.Kernel.Geometry.GH_SanityXForm.CreateSanityXForms(Rhino.Geometry.BoundingBox)
Create xform modifiers to scale / translate geometry to a sane unit system.
box: Bounding box describing geometry.
Returns: True if geometry is insane.