Grasshopper.GUI.GH_IconPicker
Provides a standard icon selection interface.

Grasshopper.GUI.GH_IconPicker.Icon
Gets or sets the icon to be displayed in this picker.

Grasshopper.GUI.GH_IconPicker.IconChanged
Gets a value indicating whether or not the icon has been changed.