Grasshopper.Rhinoceros.Display.ModelView
Represents a 3D view frustum. Wraps the functionality of the Rhino.DocObjects.ViewportInfo type.

Grasshopper.Rhinoceros.Display.ModelView.#ctor(System.Guid)
Create a new referenced view that references a Rhino.Display.RhinoView or NamedView object with the specified ref_guid.
ref_guid: ID of viewport object to reference.

Grasshopper.Rhinoceros.Display.ModelView.ClearCaches
Clears all volatile caches for this instance. The boundingbox is cleared, and if the view is referenced,
the local instance of the view is erased.

Grasshopper.Rhinoceros.Display.ModelView.IsGeometryLoaded
Gets the load state of this view object. The view is considered to be loaded when the local view instance is not null.

Grasshopper.Rhinoceros.Display.ModelView.LoadGeometry(Rhino.RhinoDoc)
If the view is referenced and not yet loaded, attempts to load the view.
Returns: True if the view is loaded (or if it was already loaded), False on failure.