Grasshopper.GUI.GH_DocumentEditor.TutorialPanel.FilePath
Gets the filename associated with this panel.

Grasshopper.GUI.GH_DocumentEditor.TutorialPanel.Thumbnail
Gets the thumbnail image associated with this panel.

Grasshopper.GUI.GH_DocumentEditor.TutorialPanel.PanelClick(System.Object,System.EventArgs)
Close the form, then load the file.