Grasshopper.Kernel.GH_LineParser
Provides basic functionality for the custom ReadFile component script parsing.

Grasshopper.Kernel.GH_LineParser.ParseLine(System.String,Grasshopper.Kernel.GH_LineParserAction@)
Parse a line of text and convert it to custom data.
line: Line to parse.
action: Set the action to take after this function returns. The default is Include.
Returns: The data represented by the line.