Grasshopper.Kernel.Special.GH_ValueTracker


Grasshopper.Kernel.Special.GH_ValueTracker.Period
Gets or sets the number of seconds of the recording.

Grasshopper.Kernel.Special.GH_ValueTracker.UpdateFrequency
Gets or sets the AutoUpdate frequency.
Frequencies of zero or less means no autoupdate.

Grasshopper.Kernel.Special.GH_ValueTracker.Domain
Gets or sets the forced vertical domain of the graph.

Grasshopper.Kernel.Special.GH_ValueTracker.AutoDomain
Gets or sets a value that indicates whether or not the vertical
domain is automatically adjusted to fit the graphs.

Grasshopper.Kernel.Special.GH_ValueTracker.GraphColour
Gets or sets the Graph colour for the right hand side edge.

Grasshopper.Kernel.Special.GH_ValueTracker.Recording
Gets the current recording.

Grasshopper.Kernel.Special.GH_ValueTracker.CleanRecording
Remove all recorded frames that are too old to be shown.