Grasshopper.GUI.Canvas.GH_Painter
This class performs most of the drawing operations required for Grasshopper Canvas controls.

Grasshopper.GUI.Canvas.GH_Painter.#ctor(Grasshopper.GUI.Canvas.GH_Canvas)
Constructor.
owner: Canvas that owns this painter object.

Grasshopper.GUI.Canvas.GH_Painter.DetermineWireType(Grasshopper.Kernel.Data.IGH_Structure)
Utility method for determining wire display types.
target: Pointer to transfer data.

Grasshopper.GUI.Canvas.GH_Painter.ConnectionVisible(System.Drawing.PointF,System.Drawing.PointF)
Test whether a wire ought to be drawn at all.
a: Start point of wire.
b: End point of wire.
Returns: True if the wire is visible and ought to be drawn.