Grasshopper.GUI.GH_AsynchFileData.FileState.#ctor(System.String)
Create a new FileData instance.
uri: Path to examine.

Grasshopper.GUI.GH_AsynchFileData.FileState.Path
Gets the URI of this file.

Grasshopper.GUI.GH_AsynchFileData.FileState.Exists
Gets whether this file exists at all.

Grasshopper.GUI.GH_AsynchFileData.FileState.Size
Gets the file byte-size.
Returns:

Grasshopper.GUI.GH_AsynchFileData.FileState.DateCreated
Gets or sets the creation date for this file.

Grasshopper.GUI.GH_AsynchFileData.FileState.DateChanged
Gets or sets the most recently changed date for this file.