Grasshopper.Kernel.GH_IconDisplayMode
Lists all display modes that individual objects can have.

Grasshopper.Kernel.GH_IconDisplayMode.application
Inherit the mode from the application setting. This is the default setting.

Grasshopper.Kernel.GH_IconDisplayMode.icon
Always display the icon.

Grasshopper.Kernel.GH_IconDisplayMode.name
Always display the nickname.