Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1
Basic node in a Tree3d structure. Nodes in tree structures maintain a local region and
either a list of content indices or a list of up to 8 child nodes.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.#ctor(Grasshopper.Kernel.Geometry.SpatialTrees.Coordinates3d{`0},Rhino.Geometry.BoundingBox)
Create a new spatial tree root.
converter: Converter delegate.
region: Bounding box for this node. The region should be big enough to contain all items you're going to insert.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.#ctor(Grasshopper.Kernel.Geometry.SpatialTrees.Coordinates3d{`0},Rhino.Geometry.BoundingBox,System.Int32)
Create a new spatial tree root.
converter: Converter delegate.
region: Bounding box for this node. The region should be big enough to contain all items you're going to insert.
limit: Node subdivision limit.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.MemoryConsumption
Gets the estimated memory consumption of the (sub)tree structure.
Items inside the global list are not included in this estimate.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.Region
Gets the spatial region of this node.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.Center
Gets the center of the spatial region of this node.
If the node contains no children the center is always in the middle of the Region.
If the node does contain child-nodes, the center may be anywhere within the region.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.ContentAverage
Returns the average coordinate of all items in this node.
If this node does not contain any items, Point3d.Unset is returned.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.ContentBoundingBox
Returns the boundingbox of all items in this node.
If this node does not contain any items, BoundingBox.Empty is returned.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.Limit
Gets the subdivision limit for this tree.
This limit can only be set once when you create a new tree.
It is fixed forever after.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.NodeDepth
Gets the recursive depth of this node. The tree root is at depth zero.
The first subdivision is at depth one, and so on and so forth.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.WeightedSubdivision
Gets or sets whether subdivision is weighted based on content averages.
Setting this value will only affect future subdivisions, not existing ones.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.IsMutable
Gets whether this tree is mutable. You can only add items to mutable trees.
We don't recommend removing items from unmutable trees, though that shouldn't necessarily lead to problems.
Trees become unmutable after a call to ShrinkRegions(), CollapseNodes() or OptimizeTree().

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.IsLeaf
Gets whether this node is a leaf node. Leaf nodes have no child nodes.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.IsTwig
Gets whether this node is a twig node. Twig nodes have both parents and at
least one child.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.IsRoot
Gets whether this node is a root node. Root nodes have no parent node and depth zero.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.RootNode
Gets the ultimate root node for this tree.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.ParentNode
Gets the immediate parent of this node.
Root nodes have no parent.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.NodeIndex
Gets the index sequence from the root of the tree to this node.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.NextNode
Gets the logical neighbour to the right of this node.
There is no spatial relationships between logical neighbours,
this is purely an iteration aid.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.GetFirstChild
Gets the first non-null child of this node.
Returns: The first non-null child node or nothing if no such node can be found.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.GetFirstLeaf
Gets the ultimate node starting from this node.
The ultimate node is the first non-null node that no longer has any children.
Returns: The first non-null leaf node in the subtree or this node.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.ChildCount
Gets the number of defined child nodes. Leaf nodes have no children.
Root and twig nodes can have anywhere between 1 and 8 children.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.ChildNode(System.Int32)
Gets the child node at the given index.
index: Index of child node to retrieve. Valid indices are from 0 to 7 inclusive.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.ItemsGlobal
Gets the list of all items stored inside this entire tree.
Do not modify this collection unless you know what you are doing.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.ItemsLocal
Gets a list of all the items stored directly in this node.
This list is constructed every time you access this property, so keep it down to a minimum.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.ItemCount
Gets the total number of items stored directly in this node.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.IndicesLocal
Gets the list of item indices that are contained within this node.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.IndicesRecursive
Gets the list of item indices that are contained within this node and any child nodes.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.SubTree(System.Boolean)
Gets an iterator for all nodes in this (sub)tree.
omitStructuralNodes: If true, nodes that contain other nodes will be skipped. Only nodes containing items will be included.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.ShrinkRegions
Shrink the region for this node and all child nodes. Do not use this method if you intend
to add more items later as it creates spatial gaps in the tree structure. You can shrink nodes
if you're done adding items and want to start searching the tree.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.CollapseNodes
Collapse the (sub)tree rooted at this node. Collapsing happens when a node only has a single child,
in which case the child usurps the position previously held by the parent.
Do not collapse a (sub)tree if you still plan to add items later.
Returns: The new root for this (sub)tree. May well be an instance of this node if it cannot be collapsed.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.TrimExcess
Trim the excess space on all index lists. You can call this method to reduce memory usage.
It will not modify the tree in any functional way.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.OptimizeTree
Optimize this tree for fast searches. Do not call this method if you still plan to add items in the future.
You can no longer modify this tree once it has been optimized.
Returns: The new root of the optimized tree. If the root could not be optimized an instance of this node will be returned.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.SubDivide
Create new child nodes and move all items in this node to those children.
This method destroys the local point list and any pre-existing children.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.Rebuild
Aggregate all points in this node and re-build it.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.ChildIndex(System.Double,System.Double,System.Double)
Find the child index that is associated with a given coordinate.
Returns: Index of twig that would contain the point.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.ChildRegion(System.Int32)
Compute the region of a specific child node.
index: Index of twig to compute.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.Add(`0)
Insert another item into the tree.
The item should be within the region of this node.
item: Item to insert.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.AddRange(System.Collections.Generic.IEnumerable{`0})
Insert a collection of items into the tree. The items should all be within the region of this node.
items: Items to add.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.InsertRecursive(`0,System.Int32)
Insert a new element into this node structure.
element: Element to insert, should be within the node region.
index: Index of element to be inserted.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.InsertRecursive(`0,System.Double,System.Double,System.Double,System.Int32)
Insert a new element into this node structure.
element: Element to insert.
x: X coordinate of element.
y: Y coordinate of element.
z: Z coordinate of element.
index: Index of element.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.Remove(System.Int32)
Remove the item with the given index from the entire tree.
It doesn't matter on which node you call this function, it is a tree-wide operation.
index: Index of item to remove.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.Remove(Grasshopper.Kernel.Geometry.SpatialTrees.Index3d{`0})
Remove the item with the given index from the entire tree.
It doesn't matter on which node you call this function, it is a tree-wide operation.
index: Index of item to remove.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.RemoveIndexRecursive(System.Int32)
Adjust this node and all child nodes to cater for the removal of a single index.
If a node contains the specified index, that item will be removed entirely.
index: Index to remove.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.InsertIndexRecursive(System.Int32)
Adust this node and all child nodes for the insertion of a single index.
index: Index to insert.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.SqrtDoubleMaxValue
Represents the square root of the Double.MaxValue field.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.SearchTolerance
Represents the tolerance of the near search. Any two elements closer than SearchTolerance are considered to be coincident.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.IdealNearSearchOrder(System.Double,System.Double,System.Double)
Gets the ideal iteration order of child nodes for a proximity search.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.IdealFarSearchOrder(System.Double,System.Double,System.Double)
Gets the ideal iteration order of child nodes for a remoteness search.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.NearestItem(`0)
Find the nearest item.
locus: Location to search from.
Returns: The index of the nearest item or null if no nearest item could be found.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.NearestItem(Rhino.Geometry.Point3d)
Find the nearest item.
locus: Location to search from.
Returns: The index of the nearest item or null if no nearest item could be found.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.NearestItem(System.Double,System.Double,System.Double)
Find the nearest item.
x: x coordinate to search from.
y: y coordinate to search from.
z: z coordinate to search from.
Returns: The index of the nearest item or null if no nearest item could be found.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.NearestItem(`0,System.Double,System.Double)
Find the nearest item.
locus: Location to search from.
minimumDistance: Minimum distance for nearest item. Items closer than minimumDistance will be ignored.
maximumDistance: Maximum distance for nearest item. Items further than maximumDistance will be ignored.
Returns: The index of the nearest item or null if no nearest item could be found.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.NearestItem(Rhino.Geometry.Point3d,System.Double,System.Double)
Find the nearest item.
locus: Location to search from.
minimumDistance: Minimum distance for nearest item. Items closer than minimumDistance will be ignored.
maximumDistance: Maximum distance for nearest item. Items further than maximumDistance will be ignored.
Returns: The index of the nearest item or null if no nearest item could be found.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.NearestItem(System.Double,System.Double,System.Double,System.Double,System.Double)
Find the nearest item.
x: x coordinate to search from.
y: y coordinate to search from.
z: z coordinate to search from.
minimumDistance: Minimum distance for nearest item. Items closer than minimumDistance will be ignored.
maximumDistance: Maximum distance for nearest item. Items further than maximumDistance will be ignored.
Returns: The index of the nearest item or null if no nearest item could be found.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.NearestItem(System.Double,System.Double,System.Double,Grasshopper.Kernel.Geometry.SpatialTrees.Validation3d{`0})
Find the nearest item using custom validation criteria.
x: x coordinate to search from.
y: y coordinate to search from.
z: z coordinate to search from.
validationDelegate: Item validation delegate.
Returns: The index of the nearest item or null if no nearest item could be found.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.NearestItems(`0,System.Int32)
Find the N nearest items.
locus: Search locus.
groupSize: Number of nearest items to return.
Returns: A list of nearest items, sorted from nearest to furthest.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.NearestItems(`0,System.Int32,System.Double,System.Double)
Find the N nearest items.
locus: Search locus.
minimumDistance: Minimum distance for nearest items. Items closer than minimumDistance will be ignored.
maximumDistance: Maximum distance for nearest items. Items further than maximumDistance will be ignored.
groupSize: Number of nearest items to return.
Returns: A list of nearest items, sorted from nearest to furthest.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.NearestItems(System.Double,System.Double,System.Double,System.Int32)
Find the N nearest items.
x: x coordinate to search from.
y: y coordinate to search from.
z: z coordinate to search from.
groupSize: Number of nearest items to return.
Returns: A list of nearest items, sorted from nearest to furthest.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.NearestItems(System.Double,System.Double,System.Double,System.Int32,System.Double,System.Double)
Find the N nearest items.
x: x coordinate to search from.
y: y coordinate to search from.
z: z coordinate to search from.
minimumDistance: Minimum distance for nearest items. Items closer than minimumDistance will be ignored.
maximumDistance: Maximum distance for nearest items. Items further than maximumDistance will be ignored.
groupSize: Number of nearest items to return.
Returns: A list of nearest items, sorted from nearest to furthest.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.NearSearch(System.Double,System.Double,System.Double,System.Double,System.Double,System.Collections.Generic.List{`0},Grasshopper.Kernel.Geometry.SpatialTrees.Node3d{`0}.PartialSearchResult)
Internal search algorithm for individual nodes.
locusX: Locus x.
locusY: Locus y.
locusZ: Locus z.
minimum: The square of the minimum distance.
maximum: The square of the maximum distance.
globalList: Global list of items.
result: Shared partial result.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.NearSearch(System.Double,System.Double,System.Double,Grasshopper.Kernel.Geometry.SpatialTrees.Validation3d{`0},System.Collections.Generic.List{`0},Grasshopper.Kernel.Geometry.SpatialTrees.Node3d{`0}.PartialSearchResult)
Internal search algorithm for individual nodes.
locusX: Locus x.
locusY: Locus y.
locusZ: Locus z.
validator: Item validator.
globalList: Global list of items.
result: Shared partial result.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.NearSearch(System.Double,System.Double,System.Double,System.Double,System.Double,System.Collections.Generic.List{`0},Grasshopper.Kernel.Geometry.SpatialTrees.Node3d{`0}.PartialGroupSearchResult)
Internal search algorithm for groups of nodes.
locusX: Locus x.
locusY: Locus y.
locusZ: Locus z.
minimum: The square of the minimum distance.
maximum: The square of the maximum distance.
globalList: Global list of items.
group: Shared partial results.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.FurthestItem(`0)
Find the furtest item.
locus: Location to search from.
Returns: The index of the furtest item or null if no furtest item could be found.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.FurthestItem(Rhino.Geometry.Point3d)
Find the furtest item.
locus: Location to search from.
Returns: The index of the furtest item or null if no furtest item could be found.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.FurthestItem(System.Double,System.Double,System.Double)
Find the furtest item.
x: x coordinate to search from.
y: y coordinate to search from.
z: z coordinate to search from.
Returns: The index of the furtest item or null if no furtest item could be found.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.FurthestItem(`0,System.Double,System.Double)
Find the furtest item.
locus: Location to search from.
minimumDistance: Minimum distance for furtest item. Items closer than minimumDistance will be ignored.
maximumDistance: Maximum distance for furtest item. Items further than maximumDistance will be ignored.
Returns: The index of the furtest item or null if no furtest item could be found.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.FurthestItem(Rhino.Geometry.Point3d,System.Double,System.Double)
Find the furtest item.
locus: Location to search from.
minimumDistance: Minimum distance for furtest item. Items closer than minimumDistance will be ignored.
maximumDistance: Maximum distance for furtest item. Items further than maximumDistance will be ignored.
Returns: The index of the furtest item or null if no furtest item could be found.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.FurthestItem(System.Double,System.Double,System.Double,System.Double,System.Double)
Find the furtest item.
x: x coordinate to search from.
y: y coordinate to search from.
z: z coordinate to search from.
minimumDistance: Minimum distance for furtest item. Items closer than minimumDistance will be ignored.
maximumDistance: Maximum distance for furtest item. Items further than maximumDistance will be ignored.
Returns: The index of the furtest item or null if no furtest item could be found.

Grasshopper.Kernel.Geometry.SpatialTrees.Node3d`1.FarSearch(System.Double,System.Double,System.Double,System.Double,System.Double,System.Collections.Generic.List{`0},Grasshopper.Kernel.Geometry.SpatialTrees.Node3d{`0}.PartialSearchResult)
Internal search algorithm for individual nodes.
locusX: Locus x.
locusY: Locus y.
locusZ: Locus z.
minimum: The square of the minimum distance.
maximum: The square of the maximum distance.
globalList: Global list of items.
result: Shared partial result.