Grasshopper.Kernel.GH_FontServer
Maintains a collection of standard fonts and mays to measure them.

Grasshopper.Kernel.GH_FontServer.NewFont(System.String,System.Single,System.Drawing.FontStyle)
High level function for Font creation. We've ran into loads of trouble in the past with missing Fonts.
Never create a font directly via GDI+, always use this method.
family: Font Family Name. If a font is found with the exact name, it will be loaded.
size: Size of font.
style: Font style, if the requested family does not support the requested style, the style flags will be ignored.
Returns: A font that might or might not be what you asked for.

Grasshopper.Kernel.GH_FontServer.NewFont(System.Drawing.Font,System.Single)
Safe font constructor.
font: Base font.
size: New size (points)

Grasshopper.Kernel.GH_FontServer.NewFont(System.Drawing.Font,System.Drawing.FontStyle)
Safe font constructor.
font: Base font.
style: New style.

Grasshopper.Kernel.GH_FontServer.NewFont(System.Drawing.Font,System.Single,System.Drawing.FontStyle)
Safe font constructor.
font: Base font.
size: New size (points)
style: New style.

Grasshopper.Kernel.GH_FontServer.NewFont(System.Drawing.FontFamily,System.Single)
Safe font constructor.
family: Font family.
size: Size (in points).

Grasshopper.Kernel.GH_FontServer.NewFont(System.Drawing.FontFamily,System.Single,System.Drawing.FontStyle)
Safe font constructor.
family: Font family.
size: Size (in points).
style: Style (if available).

Grasshopper.Kernel.GH_FontServer.FontToString(System.Drawing.Font)
Convert a font to a string.
font: Font to convert.
Returns: Strig representing the font family, size, bold and italic flags.

Grasshopper.Kernel.GH_FontServer.StringToFont(System.String)
Convert a font description string back into a font.
text: Text to parse.
Returns: Font represented by the text, or null if no font could be created.

Grasshopper.Kernel.GH_FontServer.FamilyScript
Gets or sets the FontFamily used for scripted fonts in Grasshopper.

Grasshopper.Kernel.GH_FontServer.FamilyStandard
Gets or sets the FontFamily used for standard fonts in Grasshopper.

Grasshopper.Kernel.GH_FontServer.FamilyConsole
Gets or sets the FontFamily used for monospaced fonts in Grasshopper.

Grasshopper.Kernel.GH_FontServer.ScriptFamilyChanged
Raised whenever the ScriptFamily is changed.

Grasshopper.Kernel.GH_FontServer.StandardFamilyChanged
Raised whenever the StandardFamily is changed.

Grasshopper.Kernel.GH_FontServer.ConsoleFamilyChanged
Raised whenever the MonospacedFamily is changed.

Grasshopper.Kernel.GH_FontServer.Script
FontFamily.GenericSansSerif, 10pt, italic

Grasshopper.Kernel.GH_FontServer.ScriptSmall
FontFamily.GenericSansSerif, 8pt, italic

Grasshopper.Kernel.GH_FontServer.Console
FontFamily.GenericMonospace, 10pt, regular

Grasshopper.Kernel.GH_FontServer.ConsoleSmall
FontFamily.GenericMonospace, 8pt, regular

Grasshopper.Kernel.GH_FontServer.ConsoleAdjusted
FontFamily.GenericMonospace, 10pt, regular, adjusted to counter UI scaling.

Grasshopper.Kernel.GH_FontServer.ConsoleSmallAdjusted
FontFamily.GenericMonospace, 8pt, regular, adjusted to counter UI scaling.

Grasshopper.Kernel.GH_FontServer.Small
SystemFonts.CaptionFont, 6pt, regular

Grasshopper.Kernel.GH_FontServer.Standard
SystemFonts.CaptionFont, 8pt, regular

Grasshopper.Kernel.GH_FontServer.StandardBold
SystemFonts.CaptionFont, 8pt, bold

Grasshopper.Kernel.GH_FontServer.StandardItalic
SystemFonts.CaptionFont, 8pt, italic

Grasshopper.Kernel.GH_FontServer.Large
SystemFonts.CaptionFont, 10pt, bold

Grasshopper.Kernel.GH_FontServer.StandardAdjusted
SystemFonts.CaptionFont, 8pt, regular, adjusted for logical pixel size.

Grasshopper.Kernel.GH_FontServer.LargeAdjusted
SystemFonts.CaptionFont, 10pt, bold, adjusted for logical pixel size.

Grasshopper.Kernel.GH_FontServer.MeasureString(System.String,System.Drawing.Font)
Measure the size of a string
text: The string to measure
font: The font to measure with

Grasshopper.Kernel.GH_FontServer.MeasureString(System.String,System.Drawing.Font,System.Single)
Measure the size of a string
text: The string to measure
font: The font to measure with
maxwidth: The maximum width (in pixels) for the layout

Grasshopper.Kernel.GH_FontServer.MeasureString(System.String,System.Drawing.Font,System.Drawing.SizeF)
Measure the size of a string
text: The string to measure
font: The font to measure with
iLayout: The layout rectangle

Grasshopper.Kernel.GH_FontServer.StringWidth(System.String,System.Drawing.Font)
Measure the width of a string in pixels
text: The string to measure
font: The font to measure with

Grasshopper.Kernel.GH_FontServer.StringWidth(System.Collections.Generic.IEnumerable{System.String},System.Drawing.Font)
Measure the maximum width of a collection of strings
text: The strings to measure
font: The font to measure with