Grasshopper.Kernel.GH_CustomEventServer
RhinoCommon only event server.

Grasshopper.Kernel.GH_CustomEventServer.#ctor(Grasshopper.Kernel.IGH_EventConsumer)
Create and register a new event server.
consumer: Consumer object that owns this event server.

Grasshopper.Kernel.GH_CustomEventServer.Enabled
Gets or sets the enabled state flag for this event watcher.
Returns:
Remarks:

Grasshopper.Kernel.GH_CustomEventServer.GuidTableCount
Gets the number of stored ids in the Guid Table.

Grasshopper.Kernel.GH_CustomEventServer.GuidTable
Gets direct access to the internal guid table.
The table contains pairs of object Ids and runtime serial numbers.