Grasshopper.Kernel.GH_BitmapChannel
Lists all possible channels for 24 and 32 bit bitmaps.

Grasshopper.Kernel.GH_BitmapChannel.A
Alpha channel, not all bitmaps support this.

Grasshopper.Kernel.GH_BitmapChannel.R
Red channel.

Grasshopper.Kernel.GH_BitmapChannel.G
Green channel.

Grasshopper.Kernel.GH_BitmapChannel.B
Blue channel.

Grasshopper.Kernel.GH_BitmapChannel.RGB
Red, Green and Blue channel mashup.

Grasshopper.Kernel.GH_BitmapChannel.ARGB
Alpha, Red, Green and Blue channel mashup.