Grasshopper.GUI.GH_SourceCodeEditor
Default VB and C# editor for Grasshopper.

Grasshopper.GUI.GH_SourceCodeEditor.CreateManagedEditor(System.Guid)
Create a new editor that is known by the manager.
id: ID of editor
Returns: Returns a new blank editor or NULL if the id is already registered.

Grasshopper.GUI.GH_SourceCodeEditor.DestroyManagedEditor(System.Guid)
Close, dispose and remove the editor with the given ID
id: ID to dispose of.

Grasshopper.GUI.GH_SourceCodeEditor.GetManagedEditor(System.Guid)
Retrieve the editor from the manager that is linked to the given ID.
id: The ID of the editor to retrieve
Returns: The editor for the given ID, or NULL if the ID is unknown

Grasshopper.GUI.GH_SourceCodeEditor.IsManagedEditor(System.Guid)
Tests to see if a given ID is already defined.
id: ID to test for.

Grasshopper.GUI.GH_SourceCodeEditor.CollapseAll(System.Int32)
Collapse all code blocks.
line_index: Index of line for collapse prevention, or negative if all lines are to be collapsed

Grasshopper.GUI.GH_SourceCodeEditor.CustomPanel
Gets the custom panel. If you want to add extra controls to this form,
this is where I suggest you put them.

Grasshopper.GUI.GH_SourceCodeEditor.SC_Lines
Gets a list representing all the source code lines in this editor.