Grasshopper.Plugin.GH_RhinoScriptInterface
Plugin Interface object that is exposed via the RhinoScript layer.

Grasshopper.Plugin.GH_RhinoScriptInterface.IsEditorLoaded
Returns the loaded state of the Grasshopper Main window.
Returns: True if the Main Grasshopper Window has been loaded.
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
Dim GH
Set GH = Rhino.GetPlugInObject("Grasshopper")
Call Rhino.Print("Grasshopper Editor Loaded: " & GH.IsEditorLoaded())
Set GH = Nothing
End Sub

Grasshopper.Plugin.GH_RhinoScriptInterface.IsEditorVisible
Returns the visible state of the Grasshopper Main window.
Returns: True if the Main Grasshopper Window has been loaded and is visible.
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
Dim GH
Set GH = Rhino.GetPlugInObject("Grasshopper")
Call Rhino.Print("Grasshopper Editor Visible: " & GH.IsEditorVisible())
Set GH = Nothing
End Sub

Grasshopper.Plugin.GH_RhinoScriptInterface.LoadEditor
Load the main Grasshopper Editor.
If the editor has already been loaded nothing will happen.
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
Dim GH
Set GH = Rhino.GetPlugInObject("Grasshopper")
Call GH.LoadEditor()
Set GH = Nothing
End Sub

Grasshopper.Plugin.GH_RhinoScriptInterface.ShowEditor
Show the main Grasshopper Editor.
The editor will be loaded first if needed.
If the Editor is already on screen, nothing will happen.
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
Dim GH
Set GH = Rhino.GetPlugInObject("Grasshopper")
Call GH.ShowEditor()
Set GH = Nothing
End Sub

Grasshopper.Plugin.GH_RhinoScriptInterface.HideEditor
Hide the main Grasshopper Editor.
If the editor hasn't been loaded or if the Editor is already hidden, nothing will happen.
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
Dim GH
Set GH = Rhino.GetPlugInObject("Grasshopper")
Call GH.HideEditor()
Set GH = Nothing
End Sub

Grasshopper.Plugin.GH_RhinoScriptInterface.EnableBanner
Enables the display of the Grasshopper banner during Component loading.
The banner is typically only shown once during a Grasshopper session,
namely when the Editor is first loaded.
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
Dim GH
Set GH = Rhino.GetPlugInObject("Grasshopper")
Call GH.EnableBanner()
Call GH.ShowEditor()
Set GH = Nothing
End Sub

Grasshopper.Plugin.GH_RhinoScriptInterface.DisableBanner
Disables the display of the Grasshopper banner during Component loading.
The banner is typically only shown once during a Grasshopper session,
namely when the Editor is first loaded.
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
Dim GH
Set GH = Rhino.GetPlugInObject("Grasshopper")
Call GH.DisableBanner()
Call GH.ShowEditor()
Set GH = Nothing
End Sub

Grasshopper.Plugin.GH_RhinoScriptInterface.IsSolverEnabled
Returns the state of the Grasshopper Solver.
Returns: True if the Grasshopper Solver is enabled.
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
Dim GH
Set GH = Rhino.GetPlugInObject("Grasshopper")
Call Rhino.Print("Grasshopper Solver Enabled: " & GH.IsSolverEnabled())
Set GH = Nothing
End Sub

Grasshopper.Plugin.GH_RhinoScriptInterface.EnableSolver
Enables the Grasshopper Solver. If the Solver is enabled,
expired components and parameter will be recomputed.
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
Dim GH
Set GH = Rhino.GetPlugInObject("Grasshopper")
Call GH.EnableSolver()
Set GH = Nothing
End Sub

Grasshopper.Plugin.GH_RhinoScriptInterface.DisableSolver
Disables the Grasshopper Solver. If the Solver is disabled,
expired components and parameter will not be recomputed,
though any existing solution will remain intact.
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
Dim GH
Set GH = Rhino.GetPlugInObject("Grasshopper")
Call GH.DisableSolver()
Set GH = Nothing
End Sub

Grasshopper.Plugin.GH_RhinoScriptInterface.RunSolver(System.Boolean)
Runs the solver once, even if the global solver lock is on.
expireAllObjects: If true, will expire all objects in the current document.

Grasshopper.Plugin.GH_RhinoScriptInterface.OpenDocument(System.String)
Open a Grasshopper document.
The editor will be loaded if necessary,
but it will not be automatically shown.
filename: Path of file to open (must be a *.gh or *.ghx extension).
Returns: True on success, false on failure.
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
Dim GH
Set GH = Rhino.GetPlugInObject("Grasshopper")
Call GH.OpenDocument("C:\ExampleFile.ghx")
Set GH = Nothing
End Sub

Grasshopper.Plugin.GH_RhinoScriptInterface.CloseDocument
Close the currently active Grasshopper document.
If there is not active document, nothing will happen.
Returns: True on success, false on failure.
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
Dim GH
Set GH = Rhino.GetPlugInObject("Grasshopper")
Call GH.CloseDocument()
Set GH = Nothing
End Sub

Grasshopper.Plugin.GH_RhinoScriptInterface.CloseAllDocuments
Close all Grasshopper documents.
Returns: True on success, false on failure.
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
Dim GH
Set GH = Rhino.GetPlugInObject("Grasshopper")
Call GH.CloseAllDocuments()
Set GH = Nothing
End Sub

Grasshopper.Plugin.GH_RhinoScriptInterface.SaveDocument
Save the currently active Grasshopper document.
If the active document has never been saved, a Save... dialog will be shown.
If there is no active document, nothing will happen.
Returns: True on success, false on failure.
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
Dim GH
Set GH = Rhino.GetPlugInObject("Grasshopper")
Call GH.SaveDocument()
Set GH = Nothing
End Sub

Grasshopper.Plugin.GH_RhinoScriptInterface.SaveDocumentAs(System.String)
Save the currently active Grasshopper document in a specific location.
If there is no active document, nothing will happen.
filename: Path of file to save to (must be a *.gh or *ghx extension).
Returns: True on success, false on failure.
Call GrasshopperExampleScript()
Sub GrasshopperExampleScript()
Dim GH
Set GH = Rhino.GetPlugInObject("Grasshopper")
Call GH.SaveDocumentAs("C:\GrasshopperBackup\[" & Hour(Now()) & "][" & Minute(Now()) & "][" & Second(Now()) & "].ghx")
Set GH = Nothing
End Sub

Grasshopper.Plugin.GH_RhinoScriptInterface.AssignDataToParameter(System.String,System.Object)
Find a parameter and assign some persistent data.
parameterID: Instance ID of parameter or parameter name.
data: Data to assign.
Returns: True on success, false on failure.

Grasshopper.Plugin.GH_RhinoScriptInterface.SetSliderValue(System.String,System.Double)
Find a slider and assign a new value.
sliderID: Slider ID.
value: New value. If the value exceeds the limits, it will be clipped.
Returns: True on success, false on failure.

Grasshopper.Plugin.GH_RhinoScriptInterface.SetSliderRangeAndValue(System.String,System.Double,System.Double,System.Double)
Find a slider and assign a new value.
sliderID: Slider ID.
value: New value. If the value exceeds the limits, it will be clipped.
minimum: New slider minimum.
maximum: New slider maximum.
Returns: True on success, false on failure.

Grasshopper.Plugin.GH_RhinoScriptInterface.BakeDataInObject(System.String)
Find an object and bake all geometry inside of it.
objectID: Object InstanceID or name.
Returns: An array of Rhino object IDs, or null on failure.