Grasshopper.Kernel.Special.GH_QuickGraphFrame
Combines a set of useful target frame properties and methods.

Grasshopper.Kernel.Special.GH_QuickGraphFrame.Zoom
Gets the zoom factor.

Grasshopper.Kernel.Special.GH_QuickGraphFrame.Frame
Gets the frame dimensions.

Grasshopper.Kernel.Special.GH_QuickGraphFrame.Minimum
Gets the lowest y value in the frame.

Grasshopper.Kernel.Special.GH_QuickGraphFrame.Maximum
Gets the highest y value in the frame.

Grasshopper.Kernel.Special.GH_QuickGraphFrame.MapX(System.Single)
Map a normalised parameter onto frame coordinates.
parameter: Normalised parameter.
Returns: Frame coordinate.

Grasshopper.Kernel.Special.GH_QuickGraphFrame.MapY(System.Single)
Map a normalised parameter onto frame coordinates.
parameter: Normalised parameter.
Returns: Frame coordinate.

Grasshopper.Kernel.Special.GH_QuickGraphFrame.Map(System.Drawing.PointF)
Map a normalised point into frame coordinates.

Grasshopper.Kernel.Special.GH_QuickGraphFrame.EvaluateY(System.Single)
Convert a normalised Y parameter back to actual values.

Grasshopper.Kernel.Special.GH_QuickGraphFrame.UnevaluateY(System.Double)
Convert a Y value back to a normalised parameter.