Grasshopper.Kernel.GH_Document.LayoutNode.DocObject
Gets the document object associated with this node.
Returns:

Grasshopper.Kernel.GH_Document.LayoutNode.Children
Gets the list of children.

Grasshopper.Kernel.GH_Document.LayoutNode.Id
Instance ID of doc object.

Grasshopper.Kernel.GH_Document.LayoutNode.IsRoot
Gets whether this object is a root node.

Grasshopper.Kernel.GH_Document.LayoutNode.AdjustedX
Gets whether an object has been adjusted along X at least once during this layout.

Grasshopper.Kernel.GH_Document.LayoutNode.AdjustedY
Gets whether an object has been adjusted along Y at least once during this layout.

Grasshopper.Kernel.GH_Document.LayoutNode.Bounds
Gets or sets the bounds of the object.

Grasshopper.Kernel.GH_Document.LayoutNode.#ctor(Grasshopper.Kernel.IGH_ActiveObject)
Create a new node.
obj: