Grasshopper.Kernel.Geometry.ConvexHull.Solver


Grasshopper.Kernel.Geometry.ConvexHull.Solver.#ctor
You cannot construct this class, use the shader functions directly.

Grasshopper.Kernel.Geometry.ConvexHull.Solver.Compute(Grasshopper.Kernel.Geometry.Node2List,System.Collections.Generic.List{System.Int32})
Compute the convex hull of list of nodes.
nodes: Nodes to wrap. May not contain null references.
hull: Index list describing the convex hull (closing segment not included)