Grasshopper.GUI.Theme.GH_BackgroundStyle
Enumerates the pre-defined canvas background themes.

Grasshopper.GUI.Theme.GH_BackgroundStyle.Solid
Canvas background will be a single, solid colour.

Grasshopper.GUI.Theme.GH_BackgroundStyle.Hatch
Canvas background will be a GDI hatch brush.
Remarks:

Grasshopper.GUI.Theme.GH_BackgroundStyle.GradientLeftRight
Canvas background will be a linear horizontal gradient.

Grasshopper.GUI.Theme.GH_BackgroundStyle.GradientTopBottom
Canvas background will be a linear vertical gradient.