Grasshopper.Kernel.GH_DocSettingsEventArgs
These arguments are passed along with SettingsChanged events on GH_Document.

Grasshopper.Kernel.GH_DocSettingsEventArgs.Document
Gets the document that raised the event.

Grasshopper.Kernel.GH_DocSettingsEventArgs.Kind
Gets the type of setting that was changed.