Grasshopper.GUI.Theme.GH_ObjectSettings.GroupColour
Gets or sets the default fill colour for group objects.

Grasshopper.GUI.Theme.GH_ObjectSettings.PanelColour
Gets or sets the default fill colour for panel objects.

Grasshopper.GUI.Theme.GH_ObjectSettings.ZuiFillColour
Gets or sets the fill colour for ZUI elements.

Grasshopper.GUI.Theme.GH_ObjectSettings.ZuiEdgeColour
Gets or sets the edge colour for ZUI elements.