Grasshopper.Kernel.Graphs.GH_GraphContainer


Grasshopper.Kernel.Graphs.GH_GraphContainer.GraphChanged
This event is raised whenever the underlying graph changes.
bIntermediate: If bIntermediate is True, more events are expected in the near future.

Grasshopper.Kernel.Graphs.GH_GraphContainer.NearestGrip(System.Drawing.PointF,System.Double)
Returns the grip closest to the sample point.
pt: Point in graph region coordinates.
max_search: Maximum search radius in graph region units.
Returns: The index of the nearest grip, or -1 if no grip was found within the search radius.

Grasshopper.Kernel.Graphs.GH_GraphContainer.DisplayScale
Gets or sets the display scale for this graph.

Grasshopper.Kernel.Graphs.GH_GraphContainer.Render_GraphBackground(System.Drawing.Graphics,System.Drawing.RectangleF,System.Boolean)
Renders the default Graph background.
G: Graphics object to render with
region: The region of the graph.
bActive: If true, a slightly less transparent background colour is used.
Remarks:

Grasshopper.Kernel.Graphs.GH_GraphContainer.Render_GraphGrid(System.Drawing.Graphics,System.Drawing.RectangleF)
Renders the default Grah grid.
The default grid is a division od 10x10 cells along the graph region
irregardless of domain ranges

Grasshopper.Kernel.Graphs.GH_GraphContainer.Render_GuidePen
Gets the default pen used to draw grip guides.
The default pen is Red with a 2.0f/2.0f dash pattern.
This function returns a NEW instance of that pen, it is safe to dispose it.

Grasshopper.Kernel.Graphs.GH_GraphContainer.Render_GraphPen
Gets the default pen used to draw graph curves.

Grasshopper.Kernel.Graphs.GH_GraphContainer.ToX(System.Double)
Remaps a normalized value (0.0~1.0) onto the x-domain
t_unit: The normalized factor to remap

Grasshopper.Kernel.Graphs.GH_GraphContainer.ToY(System.Double)
Remaps a normalized value (0.0~1.0) onto the y-range
t_unit: The normalized value to remap

Grasshopper.Kernel.Graphs.GH_GraphContainer.FromX(System.Double)
Remaps a domain value onto the unit-domain
t: The factor to remap

Grasshopper.Kernel.Graphs.GH_GraphContainer.FromY(System.Double)
Remaps a domain value onto the unit-range
t: The factor to remap

Grasshopper.Kernel.Graphs.GH_GraphContainer.ToUnitBox(System.Drawing.PointF)
Remap a point in Region coordinates onto the Unit box.
pt: Point to map

Grasshopper.Kernel.Graphs.GH_GraphContainer.ToRegionBox(System.Drawing.PointF)
Remap a point in Unit box coordinates onto the Region box
pt: Point to map

Grasshopper.Kernel.Graphs.GH_GraphContainer.ToRegionBox_x(System.Double)
Remap an x coordinate from the unit domain onto the region x domain

Grasshopper.Kernel.Graphs.GH_GraphContainer.ToRegionBox_y(System.Double)
Remap an y coordinate from the unit domain onto the region y domain

Grasshopper.Kernel.Graphs.GH_GraphContainer.ValueAt(System.Double)
Evaluates a single parameter.
t: the parameter to evaluate

Grasshopper.Kernel.Graphs.GH_GraphContainer.TryValueAt(System.Double)
Attempts to evaluate a single parameter.
t: the parameter to evaluate
Returns: The solution, or NaN if an exception was thrown during solution.