Grasshopper.GUI.GH_Constraint
Constraints used during UI dragging operations.

Grasshopper.GUI.GH_Constraint.None
No constraint is placed on drag direction.

Grasshopper.GUI.GH_Constraint.Vertical
Dragging is constrainted to the vertical direction.

Grasshopper.GUI.GH_Constraint.Horizontal
Dragging is constrainted to the horizontal direction.