Grasshopper.GUI.GH_PasswordBox


Grasshopper.GUI.GH_PasswordBox.Password
Gets or sets the password.

Grasshopper.GUI.GH_PasswordBox.Key
Gets or sets the key to test against.

Grasshopper.GUI.GH_PasswordBox.ValidPasswordEntered
Raised whenever a valid password has been entered.