Grasshopper.Kernel.Special.GH_ClusterFile
Maintains information about a cluster file.

Grasshopper.Kernel.Special.GH_ClusterFile.Path
Gets or sets the path.

Grasshopper.Kernel.Special.GH_ClusterFile.IsPath
Gets whether a path has been defined.

Grasshopper.Kernel.Special.GH_ClusterFile.PathType
Gets the referenced file type.

Grasshopper.Kernel.Special.GH_ClusterFile.Hash
Gets the file hash representing the latest load event.

Grasshopper.Kernel.Special.GH_ClusterFile.Synchronization
Gets the current synchronisation state.

Grasshopper.Kernel.Special.GH_ClusterFile.UpdateToCurrentFile
Set the hash and synchronisation values to the current state of the file.
Only call this function if you're certain the cluster is up-to-date.

Grasshopper.Kernel.Special.GH_ClusterFile.FileChanged
Raised whenever the target file is changed in a significant way.

Grasshopper.Kernel.Special.GH_ClusterFile.Clear
Reset all values.

Grasshopper.Kernel.Special.GH_ClusterFile.Write(GH_IO.Serialization.GH_IWriter)
Serialize this GH_ClusterFile instance
writer: Writer object.
Returns: True on success, false on failure.

Grasshopper.Kernel.Special.GH_ClusterFile.Read(GH_IO.Serialization.GH_IReader)
Deserialize this GH_ClusterFile instance from an archive.
reader: Reader object.
Returns: True on success, false on failure.