Grasshopper.Kernel.GH_PreviewWireArgs
This class is passed to objects that implement IGH_PreviewData during wire drawing operations.

Grasshopper.Kernel.GH_PreviewWireArgs.Viewport
Gets the Viewport in which we're currently drawing.

Grasshopper.Kernel.GH_PreviewWireArgs.Pipeline
Gets the Display Pipeline we're currently drawing with.

Grasshopper.Kernel.GH_PreviewWireArgs.Color
Gets the color in which wires ought to be drawn.

Grasshopper.Kernel.GH_PreviewWireArgs.Thickness
Gets the thickness in which wires ought to be drawn.