Grasshopper.GUI.StringDisplay.GH_FormattedListItem
Advanced implementation of IGH_ListItem

Grasshopper.GUI.StringDisplay.GH_FormattedListItem.Font
Gets or sets the Font to use while drawing this item.
It is the responsibility of the owner to dispose Fonts.

Grasshopper.GUI.StringDisplay.GH_FormattedListItem.Type
Gets or sets the generic type code for the item.
This code is not used by the String List classes but
it allows implementers to easily keep track of different
items in case special drawing actions are required.

Grasshopper.GUI.StringDisplay.GH_FormattedListItem.Wrap
Gets or sets whether this item is wrapped.