Grasshopper.Kernel.Data.IGH_Rule
Interface for individual pattern elements.

Grasshopper.Kernel.Data.IGH_Rule.Kind
Gets the type of rule.

Grasshopper.Kernel.Data.IGH_Rule.Notation
Gets the string notation (representation) for this rule.

Grasshopper.Kernel.Data.IGH_Rule.Apply(System.Int32)
Applies this rule to an integer.
number: Integer to match.
Returns: True if the integer passes the rule test.