Grasshopper.GUI.Base.GH_ColourSpace
Enumerates the different colour spaces supported by the GH_ColourPickerBase class.
Remarks:

Grasshopper.GUI.Base.GH_ColourSpace.None
Unset value. Do not use. Seriously. Stay away.

Grasshopper.GUI.Base.GH_ColourSpace.RGB
Colour picker operates in RGB mode.

Grasshopper.GUI.Base.GH_ColourSpace.HSV
Colour picker operates in HSV mode.