Grasshopper.Kernel.GH_PreviewBoundary
A closed boundary for filtering previewed objects.

Grasshopper.Kernel.GH_PreviewBoundary.#ctor(System.Drawing.PointF[])
Create a new preview boundary.
points: Points on boundary.

Grasshopper.Kernel.GH_PreviewBoundary.Points
Gets the array of points this boundary was made from.

Grasshopper.Kernel.GH_PreviewBoundary.Boundary
Gets the boundary region.

Grasshopper.Kernel.GH_PreviewBoundary.Limits
Gets the limits of the boundary.

Grasshopper.Kernel.GH_PreviewBoundary.IsVisible(Grasshopper.Kernel.IGH_DocumentObject)
Gets whether a specific object is visible within this boundary.