Grasshopper.GUI.Base.GH_DigitScrollerBase
Provides Numeric digit scrolling GUI not tied to a control-handle.

Grasshopper.GUI.Base.GH_DigitScrollerBase.SetupScroller(System.Decimal,System.Decimal,System.Decimal)
Set the minimum, maximum and value fields simultaneously.

Grasshopper.GUI.Base.GH_DigitScrollerBase.Value
Gets or sets the value displayed in this scroller.

Grasshopper.GUI.Base.GH_DigitScrollerBase.Epsilon
Gets the smallest possible change in the value.

Grasshopper.GUI.Base.GH_DigitScrollerBase.Digits
Gets or sets the number of digits available in this scroller.

Grasshopper.GUI.Base.GH_DigitScrollerBase.Radix
Gets or sets the radix index of this scroller.

Grasshopper.GUI.Base.GH_DigitScrollerBase.DecimalPlaces
Gets or sets the number of decimal places available in this scroller.
Unlike Radix, this property maintains the decimal position of the value represented by this scroller.

Grasshopper.GUI.Base.GH_DigitScrollerBase.MinimumValue
Gets or sets the lower bound of the scroll value.

Grasshopper.GUI.Base.GH_DigitScrollerBase.MaximumValue
Gets or sets the upper bound of the scroll value.

Grasshopper.GUI.Base.GH_DigitScrollerBase.EdgeColour
Gets or sets the edge colour of the control.

Grasshopper.GUI.Base.GH_DigitScrollerBase.TopColour
Gets or sets the colour used along the top edge of the control.

Grasshopper.GUI.Base.GH_DigitScrollerBase.BottomColour
Gets or sets the colour used along the bottom edge of the control.

Grasshopper.GUI.Base.GH_DigitScrollerBase.TextColour
Gets or sets the colour used for the text inside the scrolls.

Grasshopper.GUI.Base.GH_DigitScrollerBase.RailColour
Gets or sets the colour used for the rail line.

Grasshopper.GUI.Base.GH_DigitScrollerBase.ShadowColour
Gets or sets the colour used for the shadows.

Grasshopper.GUI.Base.GH_DigitScrollerBase.ShadowSize
Gets or sets the size of the drop shadow along all four edges.

Grasshopper.GUI.Base.GH_DigitScrollerBase.BackgroundGradient
Gets or sets the background Gradient. If the gradient is not null,
it overrides the background colours.

Grasshopper.GUI.Base.GH_DigitScrollerBase.DrawBorder
Gets or sets whether the border is drawn in this control.

Grasshopper.GUI.Base.GH_DigitScrollerBase.DrawShadows
Gets or sets whether shadows are drawn in this control.

Grasshopper.GUI.Base.GH_DigitScrollerBase.DrawBackground
Gets or sets whether the background is drawn in this control.

Grasshopper.GUI.Base.GH_DigitScrollerBase.AmplifyMotion
Gets or sets a value indicating whether vertical mouse drags should be amplified
as the mouse moves further and further.

Grasshopper.GUI.Base.GH_DigitScrollerBase.AllowRadixDrag
Gets or sets a value indicating whether the radix is allowed to be dragged around.

Grasshopper.GUI.Base.GH_DigitScrollerBase.AllowTextInput
Gets or sets whether text input is allowed by double click.

Grasshopper.GUI.Base.GH_DigitScrollerBase.Font
Gets or sets the Font for this scroller.

Grasshopper.GUI.Base.GH_DigitScrollerBase.Bounds
Gets or sets the Bounds for this scroller.

Grasshopper.GUI.Base.GH_DigitScrollerBase.DigitAlign
Gets or sets the digit align mode.

Grasshopper.GUI.Base.GH_DigitScrollerBase.Prefix
Gets or sets the prefix text to be displayed on the scroller.

Grasshopper.GUI.Base.GH_DigitScrollerBase.Suffix
Gets or sets the suffix text to be displayed on the scroller.

Grasshopper.GUI.Base.GH_DigitScrollerBase.ScrollBoxes
Gets all scroll boxes (from left to right) for this control, not including the radix box.

Grasshopper.GUI.Base.GH_DigitScrollerBase.RadixBox
Gets the Radix box for this control, if there is no radix box, Rectangle.Empty will be returned.

Grasshopper.GUI.Base.GH_DigitScrollerBase.SignBox
Gets the Sign box for this control.

Grasshopper.GUI.Base.GH_DigitScrollerBase.PrefixBox
Gets the box containing the prefix string. If there is no prefix the PrefixBox will be Rectangle.Empty

Grasshopper.GUI.Base.GH_DigitScrollerBase.SuffixBox
Gets the box containing the suffix string. If there is no suffix the PrefixBox will have zero width

Grasshopper.GUI.Base.GH_DigitScrollerBase.RaiseEvents
Gets or sets whether this scroller raises the ValueChanged event.

Grasshopper.GUI.Base.GH_DigitScrollerBase.Invalidated
Raised whenever the display of this scroller is changed, but not the value.
sender: GH_DigitScrollerBase that raised the event.
e: Arguments for this event.

Grasshopper.GUI.Base.GH_DigitScrollerBase.OnInvalidated
Raise the Invalidated event.

Grasshopper.GUI.Base.GH_DigitScrollerBase.ValueChanged
Raised whenever the value of this scroller is changed due to User-Interface methods.
sender: GH_DigitScrollerBase that raised the event.
e: Arguments for this event.

Grasshopper.GUI.Base.GH_DigitScrollerBase.OnValueChanged(System.Boolean)
Raise the ValueChanged event.
intermediate: Set the intermediate state of the event arguments.

Grasshopper.GUI.Base.GH_DigitScrollerBase.MouseDown(System.Windows.Forms.MouseEventArgs,System.Drawing.PointF)
Respond to mouse-down events.
args: Mouse Event arguments.
pt: Mouse cursor position in floating point accuracy.
Returns: True if a Drag operation was started, false if the event went unnoticed.

Grasshopper.GUI.Base.GH_DigitScrollerBase.MouseMove(System.Windows.Forms.MouseEventArgs,System.Drawing.PointF)
Respond to mouse-move events.
args: Mouse Event arguments.
pt: Mouse cursor position in floating point accuracy.
Returns: True if a Drag operation was performed, false if the event went unnoticed.

Grasshopper.GUI.Base.GH_DigitScrollerBase.MouseUp(System.Windows.Forms.MouseEventArgs,System.Drawing.PointF)
Respond to mouse-up events.
args: Mouse Event arguments.
pt: Mouse cursor position in floating point accuracy.
Returns: True if a Drag operation was terminated, false if the event went unnoticed.

Grasshopper.GUI.Base.GH_DigitScrollerBase.PrimaryDigitBox(System.Int32)
Gets the rectangle which contains the primary digit at the given index.

Grasshopper.GUI.Base.GH_DigitScrollerBase.SecondaryDigitBox(System.Int32)
Gets the rectangle which contains the primary digit at the given index.

Grasshopper.GUI.Base.GH_DigitScrollerBase.PrimarySignBox
Gets the rectangle which contains the primary sign

Grasshopper.GUI.Base.GH_DigitScrollerBase.SecondarySignBox
Gets the rectangle which contains the secondary sign

Grasshopper.GUI.Base.GH_DigitScrollerBase.Render(System.Drawing.Graphics)
Render all UI elements.
G: Graphics object to draw with.