Grasshopper.Plugin.GH_PluginUtil
Grasshopper plugin utility class. This class exports some static (Shared in VB)
methods to do with plugin loading and unloading.

Grasshopper.Plugin.GH_PluginUtil.#ctor
Prevent construction.

Grasshopper.Plugin.GH_PluginUtil.LoadGrasshopper(System.String@)
Performs all steps required during Grasshopper loading.
If this function returns false, the plugin should not be allowed to load.
Returns: True on success, false on failure.

Grasshopper.Plugin.GH_PluginUtil.UnloadGrasshopper
Performs all steps required during Grasshopper unloading.
Returns: True on success, false on failure.

Grasshopper.Plugin.GH_PluginUtil.SaveSettings
Forces all runtime settings to be saved to the disk.

Grasshopper.Plugin.GH_PluginUtil.FocusOnRhino
Set the focus to the Rhino command line.

Grasshopper.Plugin.GH_PluginUtil.BringRhinoToTop
Bring the Rhino window to the top of the stack.

Grasshopper.Plugin.GH_PluginUtil.SendKeyCodeToRhino(System.Int32)
Send a key-code to the Rhino command line.
key: Key code.

Grasshopper.Plugin.GH_PluginUtil.SendKeyCodeToRhino(System.Char)
Send a key-code to the Rhino command line.
key: Key char.

Grasshopper.Plugin.GH_PluginUtil.SendKeyCodeToRhino(System.String)
Send a string of characters to the Rhino command line.
key: String