Grasshopper.Kernel.GDL.GH_GDLParser
Provided functionality for parsing and writing Grasshopper Descriptor Language text.

Grasshopper.Kernel.GDL.GH_GDLParser.#ctor
This class only provides static methods and cannot be constructed.

Grasshopper.Kernel.GDL.GH_GDLParser.ParseGDL(System.String[],System.String[]@)
Convert a GDL text into an actual document.
lines: Lines to parse.
messages: Messages encountered.
Returns: A document on success or null on failure.