Grasshopper.Kernel.Undo.GH_UndoRecord
Represents a single undo/redo record. A single record may contain any number of undo actions.

Grasshopper.Kernel.Undo.GH_UndoRecord.Name
Gets or sets the name of the undo record (as displayed in the menu)

Grasshopper.Kernel.Undo.GH_UndoRecord.Guid
Gets the ID of this undo item. Every undo record has a unique ID.

Grasshopper.Kernel.Undo.GH_UndoRecord.Time
Gets the time at which this record was created.

Grasshopper.Kernel.Undo.GH_UndoRecord.State
Gets the undo state of this record. The state dictates which action are legal.

Grasshopper.Kernel.Undo.GH_UndoRecord.ActionCount
Gets the number of actions stored in this record.

Grasshopper.Kernel.Undo.GH_UndoRecord.ExpiresDisplay
Gets the display expiration flag for this event. If True, the Rhino viewports will be redrawn
once the entire undo record has been completed.
If ExpiresSolution is set to true, ExpriresDisplay is implied.

Grasshopper.Kernel.Undo.GH_UndoRecord.ExpiresSolution
Gets the solution expiration flag for this event.
If True, the solution needs to be recalculated once the entire undo record has been completed.

Grasshopper.Kernel.Undo.GH_UndoRecord.ResetTime
Reset the time flag for this record.

Grasshopper.Kernel.Undo.GH_UndoRecord.Actions
Gets or sets the actions inside this record.

Grasshopper.Kernel.Undo.GH_UndoRecord.AddAction(Grasshopper.Kernel.Undo.IGH_UndoAction)
Append an undo action to this record. You should only do this prior to calling undo for the first time.
action: Action to append.