Grasshopper.Kernel.GH_LoadingInstruction
Enumerates all external GHA loading process instructions.

Grasshopper.Kernel.GH_LoadingInstruction.Proceed
Proceed with GHA loading.

Grasshopper.Kernel.GH_LoadingInstruction.Abort
Abort the GHA loading, all your components will be skipped.