Grasshopper.GUI.GH_AsynchFileData
This class provides asynchronous methods to keep tabs on a file.

Grasshopper.GUI.GH_AsynchFileData.FilePath
Gets the location this instance is watching.

Grasshopper.GUI.GH_AsynchFileData.IsLocal
Gets whether Grasshopper thinks the file it is watching is on a local machine.

Grasshopper.GUI.GH_AsynchFileData.#ctor(System.String,System.Boolean,Grasshopper.GUI.GH_AsynchFileData.FileChangedDelegate)
Asynchronous constructor. File properties will be loaded asychronously.
filePath: Location of file
harvestThumbnail: If true, thumbnail data will be loaded.
callback: Callback delegate for file changes.

Grasshopper.GUI.GH_AsynchFileData.UpdateProperties
Updates all file properties on the thread on which this method is called.

Grasshopper.GUI.GH_AsynchFileData.HarvestThumbnail
Gets or sets whether the thumbnail ought to be parsed.
At the moment this only makes sense for GH/GHX files.

Grasshopper.GUI.GH_AsynchFileData.Callback
Gets or sets the callback delegate to be used when properties are updated.

Grasshopper.GUI.GH_AsynchFileData.IsFileData
Gets whether the data has been retrieved at least once.

Grasshopper.GUI.GH_AsynchFileData.FileSize
Gets the size of the file.

Grasshopper.GUI.GH_AsynchFileData.FileExists
Gets whether the file exists.
Note that this property returns false if DataExists=False, regardless of whether the file exists.

Grasshopper.GUI.GH_AsynchFileData.FileCreated
Gets the date at which the file was created.

Grasshopper.GUI.GH_AsynchFileData.FileLastChanged
Gets the date at which the file was last changed.

Grasshopper.GUI.GH_AsynchFileData.FileThumbnail
Gets the thumbnail bitmap associated with the file.