Grasshopper.Kernel.GH_RuntimeMessageLevel
Indicates the severity of a runtime message.

Grasshopper.Kernel.GH_RuntimeMessageLevel.Blank
No warnings or errors were recorded during solver-time processes

Grasshopper.Kernel.GH_RuntimeMessageLevel.Remark
One of more messages (but no warnings and no errors) were recorded during solver-time processes.

Grasshopper.Kernel.GH_RuntimeMessageLevel.Warning
One or more warnings (but no errors) were recorded during solver-time processes

Grasshopper.Kernel.GH_RuntimeMessageLevel.Error
One or more errors (and possibly any number of warnings) were recorded during solver-time processes.