Grasshopper.Kernel.GH_Document
Represents a single Grasshopper document.

Grasshopper.Kernel.GH_Document.ActiveDoc
Gets or sets a value indicating that this document was last active in a multi-doc aware Rhino.
true if this was the last active document; otherwise, false.

Grasshopper.Kernel.GH_Document.#ctor
Constructor for GH_Document. Makes sure all important members are initialized.

Grasshopper.Kernel.GH_Document.DuplicateDocument(Grasshopper.Kernel.GH_Document)
Attempt to duplicate a document.
doc: Document to copy.
Returns: A document similar to the input on success, or nothing on failure.

Grasshopper.Kernel.GH_Document.Dispose
When you discard documents you must call Dispose or the Viewport Display event handlers will not be disconnected.

Grasshopper.Kernel.GH_Document.ToString
A document serializes itself using the filename of the current path.
This is useful for sorting purposes and ListBoxes.

Grasshopper.Kernel.GH_Document.EventServer
Gets the event server that belongs to this document.
The Event server may be in an inactive state, but it is never null.

Grasshopper.Kernel.GH_Document.ClearReferenceTable
Destroys the Referenced object table in the Rhino event watcher.
You must call this function if you either add or remove a reference
to a Rhino object.

Grasshopper.Kernel.GH_Document.StateServer
Gets the list of stored states in this document

Grasshopper.Kernel.GH_Document.RemotePanelLayout
Gets the Remote Control Panel layout for this document.

Grasshopper.Kernel.GH_Document.ConstantServer
Gets the dictionary of constants defined in this document.

Grasshopper.Kernel.GH_Document.DefineConstant(System.String,Grasshopper.Kernel.Expressions.GH_Variant)
Add a new constant to the document. Constants are not case-sensitive,
when you define a constant with an existing name, the old one will be replaced.
Note: constants are as of yet unused. Eventually they are supposed to become accessible
to all expressions running inside a document.
name: Name of constant.
value: Value of constant.

Grasshopper.Kernel.GH_Document.CreateExpressionParser
Create a new Expression Solver preloaded with the constants defined in this document.

Grasshopper.Kernel.GH_Document.Thumbnail
Gets or sets the thumbnail bitmap for this document.

Grasshopper.Kernel.GH_Document.UndoServer
Gets the UndoServer instance that belongs to this document.

Grasshopper.Kernel.GH_Document.UndoUtil
Gets a temporary undo utility instance that allows you to easily create standard undo events.
Returns: A new instance of GH_UndoUtil set up to work with this document.
Do not hang on to this object, ask for a new one every time you need it.

Grasshopper.Kernel.GH_Document.Undo
Perform the first undo event.
Returns: True on success, false on no undo event or invalid undo event.

Grasshopper.Kernel.GH_Document.Redo
Perform the first redo event.
Returns: True on success, false on no redo event or invalid redo event.

Grasshopper.Kernel.GH_Document.AutoSaveFileName(System.String)
Computes the autosave filename for a full grasshopper filepath.
filename: Full path of Grasshopper file, including directories and extension.
Returns: The autosave filename (but not including the autosave directory).

Grasshopper.Kernel.GH_Document.AutoSave(Grasshopper.Kernel.GH_AutoSaveTrigger)
Creates a new autosave file on the disk. The previous autosave file (assuming it exists)
will be temporarily renamed and eventually deleted entirely.
Note: AutoSave is only possible on Documents that have TopLevel Rank and a valid FilePath.
trigger: Reason for autosave. User can choose to ignore certain autosave reasons.

Grasshopper.Kernel.GH_Document.AutoSave(Grasshopper.Kernel.GH_AutoSaveTrigger,System.Guid)
Creates a new autosave file on the disk. The previous autosave file (assuming it exists)
will be temporarily renamed and eventually deleted entirely.
Note: AutoSave is only possible on Documents that have TopLevel Rank and a valid FilePath.
trigger: Reason for autosave. User can choose to ignore certain autosave reasons.
id: Guid of autosave operation, consecutive calls to autosave with the same Guid will be ignored.

Grasshopper.Kernel.GH_Document.DestroyAutoSaveFiles
Destroys all autosave files and backup files that are associated with this document.
Only call this function when you are certain that the document has been properly
saved and no changes have occured since.

Grasshopper.Kernel.GH_Document.Profiler
Gets or sets the profiler mode used in this document.

Grasshopper.Kernel.GH_Document.Owner
Gets or sets the owner of this document. A document is typically owned
when it is subsidiary to some object, such as a cluster.

Grasshopper.Kernel.GH_Document.Nested
Gets or sets whether this document is nested.
A nested document is always part of some other document
and is therefore unknown to the DocumentServer and the Canvas.

Grasshopper.Kernel.GH_Document.Enabled
Gets or sets the enabled state for this document.
Enabled documents respond to events and display their previews in the Rhino viewport.

Grasshopper.Kernel.GH_Document.RunningAsCommand
When the document is being solved inside the context of an executing
Rhino command, this function will return the command instance. Under
normal operation of Grasshopper in the traditional sense, this function
will return null. The document executes as a command when inside of the
grasshopper player or as a compiled grasshopper player based command.
The way to run a GH_Document as a command is to call the
GH_RhinoScriptInterface.RunAsCommand function
Returns:
executing command when running as a command; otherwise null

Grasshopper.Kernel.GH_Document.Context
Gets or sets the context for this document. Note that the context is not a state so much as an action.
Therefore it is not particularly useful to read the context after the fact, rather,
context is mostly intended to be a setter, not a getter.
When you set the context, all top-level document objects will be informed and the ContextChanged event will be raised.

Grasshopper.Kernel.GH_Document.RuntimeID
Gets the runtime ID of this document. RuntimeID is assigned once and never changed.
It is also not deserialized so every document will always have a unique ID when loaded.

Grasshopper.Kernel.GH_Document.DocumentID
Gets the document Id. The Id is assigned at construction and never changed.
Note: clusters may choose to modify the Id of their internal documents.

Grasshopper.Kernel.GH_Document.SetDocumentID(System.Guid)
Assign a new document Id to this document.
Expert user function, ask David before calling this function.
id: Id to set.

Grasshopper.Kernel.GH_Document.CompareTo(Grasshopper.Kernel.GH_Document)
Compare two documents. This function does not compare document content.
other: Document to compare to.
Returns: Comparison key.

Grasshopper.Kernel.GH_Document.PreviewMode
Gets or sets the preview display mode and makes sure the conduit instance of this class is set to match.

Grasshopper.Kernel.GH_Document.PreviewFilter
Gets or set the preview filter.

Grasshopper.Kernel.GH_Document.Properties
The properties of this document

Grasshopper.Kernel.GH_Document.Author
Gets the author details associated with this document.

Grasshopper.Kernel.GH_Document.ValueTable
Gets the value table associated with this document.

Grasshopper.Kernel.GH_Document.m_objects
m_objects is never null. m_objCache and m_attCache can be recmoputed from the m_objects instance.

Grasshopper.Kernel.GH_Document.CreateConnectivityDiagram
Gets the connectivity diagram for the current state of this document.
Returns: The connectivity diagram of the current state.
Once objects/wires are added or removed the diagram will not update
and you must request a new one.

Grasshopper.Kernel.GH_Document.ObjectCount
Returns the total number of top-level objects in the document.

Grasshopper.Kernel.GH_Document.Objects
Returns a list of all normal, top-level objects.

Grasshopper.Kernel.GH_Document.AttributeCount
Returns the total number of attributes in the document. Both Normal and Hidden ones

Grasshopper.Kernel.GH_Document.Attributes
Returns a list of all the attributes in this document. This includes attributes
for nested objects such as input or output parameters.
Remarks: If the attribute cache is empty, it will be rebuild. Hence, this could be quite an expensive call to make.

Grasshopper.Kernel.GH_Document.DestroyAttributeCache
Destroys the Attribute cache. Call this function whenever you do something which might affect attributes.

Grasshopper.Kernel.GH_Document.GetAllInstanceIDs(System.Boolean)
Get a sorted list of all the IGH_DocumentObject instance IDs in this document.
topLevelOnly: If true, only top level objects are considered.
Returns: A sorted fictionary of IDs and Integers. The integers represent the indices
of the top-level objects that contained the ids. Since the object list inside a GH_Document
is not static, these indices will not remain valid.

Grasshopper.Kernel.GH_Document.MutateAllIds
Change all the instance UUIDs of all objects in the document.
Be sure to resolve all proxy sources before mutating IDs.
This function will ensure all groups are updated appropriately.

Grasshopper.Kernel.GH_Document.MutateAllGUIDs


Grasshopper.Kernel.GH_Document.ConvertNickNamesToFullNames
Convert all nicknames to full names, if they are equal to the default nickname.
There will be no undo record associated with this operation.

Grasshopper.Kernel.GH_Document.ConvertFullNamesToNickNames
Convert all nicknames to original nicknames if they are equal to the default full name.
There will be no undo record associated with this operation.

Grasshopper.Kernel.GH_Document.ContainsCustomPreviewObjects
Gets whether this document contains *any* custom preview objects.

Grasshopper.Kernel.GH_Document.ContainsCustomRenderObjects
Gets whether this document contains custom preview objects which
are both ENABLED and included in RENDERING.

Grasshopper.Kernel.GH_Document.CustomRenderObjects
Enumerate over all enabled, rendering, non-empty custom preview objects.

Grasshopper.Kernel.GH_Document.CustomPreviewObjects
Enumerate over all custom preview capable objects.
Since: 8.0

Grasshopper.Kernel.GH_Document.DestroyObjectTable
Erase the Object fast lookup table. You must call this whenever you add or remove
objects to or from the document while circumventing the regular channels.

Grasshopper.Kernel.GH_Document.RebuildObjectTable
Destroy and rebuild the Object fast lookup table.

Grasshopper.Kernel.GH_Document.InternalAddObject(Grasshopper.Kernel.IGH_DocumentObject,System.Int32)
Perform basic operations required to add an object to this document.
No events are raised, no updates are triggered.
docObject: Object to add.
index: Index of object, will be clipped to the valid range automatically.

Grasshopper.Kernel.GH_Document.InternalRemoveObject(System.Int32)
Perform basic operations required to remove the object at the given index from this document.
No events are raised, no update is triggered.
index: Index of object to remove.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Document.AddObject(Grasshopper.Kernel.IGH_DocumentObject,System.Boolean,System.Int32)
Add a new object to the document. If the object is already contained, nothing will happen
docObject: The object to add.
index: Index at which object will be inserted.
update: If True, a new solution will be triggered afterwards, regardless of event response settings.

Grasshopper.Kernel.GH_Document.RemoveObject(Grasshopper.Kernel.IGH_Attributes,System.Boolean)
Remove the top-level object in the attribute tree from the document.
This method does not add an Undo event, that is the responsibility of the caller.

Grasshopper.Kernel.GH_Document.RemoveObject(Grasshopper.Kernel.IGH_DocumentObject,System.Boolean)
Remove the object from the document. This removal is the precursor to object deletion.
Do not call this function if you intend to transfer the object to another GH_Document.
This method does not add an Undo event, that is the responsibility of the caller.
docObject: Object to remove.

Grasshopper.Kernel.GH_Document.RemoveObjects(System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_DocumentObject},System.Boolean)
Remove the specified objects from the document. This removal is the precursor to object deletion.
Do not call this function if you intend to transfer the objects to another GH_Document.
This method does not add an Undo event, that is the responsibility of the caller.
objectList: Objects to remove from this document.
update: If True, the solution will be recomputed.
Returns: The number of objects actually deleted.

Grasshopper.Kernel.GH_Document.MergeDocument(Grasshopper.Kernel.GH_Document)
Hoist all objects from another document into this one.
other: The other document. Cannot be Null or
Remarks: The objects will be moved, not copied. The other document ends up being empty since objects can only belong to one document at a time.

Grasshopper.Kernel.GH_Document.MergeDocument(Grasshopper.Kernel.GH_Document,System.Boolean)
Hoist all objects from another document into this one.
other: The other document. Cannot be Null or
resolveProxies: If True, an attempt is made to repair proxy sources after insertion.
Remarks: The objects will be moved, not copied. The other document ends up being empty since objects can only belong to one document at a time.

Grasshopper.Kernel.GH_Document.MergeDocument(Grasshopper.Kernel.GH_Document,System.Boolean,System.Boolean)
Hoist all objects from another document into this one.
other: The other document. Cannot be null.
resolveProxies: If True, an attempt is made to repair proxy sources after insertion.
removeProxies: If True, all remaining proxies will be deleted.
Remarks: The objects will be moved, not copied. The other document ends up being empty since objects can only belong to one document at a time.

Grasshopper.Kernel.GH_Document.ExpireGroups
Expire the caches of all the groups contained in this document.

Grasshopper.Kernel.GH_Document.ExpireGroups(System.Guid)
Expire the caches of all the groups contained in this document.
If at least one of them contains the object id in question.
id: If this ID is contained within even a single group, all groups are expired.

Grasshopper.Kernel.GH_Document.ExpireGroups(System.Collections.Generic.IEnumerable{System.Guid})
Expire the caches of all the groups contained in this document.
If at least one of them contains the object id in question.
ids: If any of the ids is contained within even a single group, all groups are expired.

Grasshopper.Kernel.GH_Document.RepairProxySources
Attempts to resolve all proxy sources in the document.
Returns: False if one or more proxies could not be resolved

Grasshopper.Kernel.GH_Document.RepairProxySources(System.Int32@,System.Int32@)
Attempts to resolve all proxy sources in the document.
solved: The number of successfully resolved proxies.
unsolved: The number of failed resolved proxies.

Grasshopper.Kernel.GH_Document.DestroyProxySources
Remove all remaining proxy sources from the document.

Grasshopper.Kernel.GH_Document.ReplaceProxySources
Replace all remaining proxy sources in the document with UnresolvedProxy Objects.

Grasshopper.Kernel.GH_Document.FindObjects(System.Collections.Generic.List{System.String},System.Int32)
Find the objects in the document that match the search term.
Top level object names and nicknames are searched, as well as descriptions.
Some objects are special cased to allow for more targeted searches.
Data descriptions are not searched.

Grasshopper.Kernel.GH_Document.IsFilePathDefined
Returns True if the filename flag of this document has been set

Grasshopper.Kernel.GH_Document.FilePath
Gets or sets the file path of this document. If the file path is not set Nothing is returned.

Grasshopper.Kernel.GH_Document.DisplayName
Gets the display name for this document. The display name is highly context sensitive and is
only supposed to give the user a good idea of which document this is and whether it has been modified.

Grasshopper.Kernel.GH_Document.FileNameProxy


Grasshopper.Kernel.GH_Document.AssociateWithRhinoDocument
Associate this GH_Document with the currently active Rhino document.
This only works if both the 3dm and the ghx file have been saved at least once.

Grasshopper.Kernel.GH_Document.IsModified
Gets or sets the modified flag. If the new value differs from the old value, the ModifiedChanged() event is raised.

Grasshopper.Kernel.GH_Document.ModifiedSubsidiaries
Gets the number of modified subsidiary documents.
Returns: The number of modified subsidiary documents.

Grasshopper.Kernel.GH_Document.Modified
Sets the modified flag of this document.

Grasshopper.Kernel.GH_Document.CloseAllSubsidiaries
Iterate over all subsidiary documents and close them all without saving.
Returns: The number of subsidiary documents that was closed.

Grasshopper.Kernel.GH_Document.UpdateAllSubsidiaries
Iterate over all subsidiary documents and update them with their respective owners.
If a subsidiary hasn't been modified, it will not be updated and it will not be counted.
Returns: The number of subsidiary documents updated.

Grasshopper.Kernel.GH_Document.ConstructDocumentTree
Create a hierarchical document tree of ownership with this document as the root.
Returns: A tree of all documents owned directly or indirectly by this document.

Grasshopper.Kernel.GH_Document.Write(GH_IO.Serialization.GH_IWriter)
Standard archiving function. Will serialize the entire document.

Grasshopper.Kernel.GH_Document.Write(GH_IO.Serialization.GH_IWriter,System.Collections.Generic.IList{Grasshopper.Kernel.IGH_DocumentObject})
Special function that allows writing of a custom object list.
This function is used when partial documents need to be serialized
such as when exporting or during clipboard operations.
writer: Writer to serialize with.
objList: Object list override

Grasshopper.Kernel.GH_Document.WritePreviewBoundary(GH_IO.Serialization.GH_IWriter)
Serialize the preview boundary, if it is defined.

Grasshopper.Kernel.GH_Document.WriteDocumentHeader(GH_IO.Serialization.GH_IWriter)
Serialize the properties of this document.

Grasshopper.Kernel.GH_Document.WriteObjectList(GH_IO.Serialization.GH_IWriter,System.Collections.Generic.IList{Grasshopper.Kernel.IGH_DocumentObject},System.String)
Serialize a list of IGH_DocumentObjects

Grasshopper.Kernel.GH_Document.WriteLibraryList(GH_IO.Serialization.GH_IWriter,System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_DocumentObject})
Write a bunch of library information so that we can
tell people WHICH plugins they need to install.

Grasshopper.Kernel.GH_Document.Read(GH_IO.Serialization.GH_IReader)
Standard archiving function. Will deserialize the entire document.

Grasshopper.Kernel.GH_Document.ReadPreviewBoundary(GH_IO.Serialization.GH_IReader)
Deserialize the preview boundary, if it is defined.

Grasshopper.Kernel.GH_Document.ReadDocumentHeader(GH_IO.Serialization.GH_IReader)
Deserialize the properties of this document.

Grasshopper.Kernel.GH_Document.ReadObjectList(GH_IO.Serialization.GH_IReader,System.String,System.Collections.Generic.List{Grasshopper.Kernel.GH_Document.PluginInfo})
Deserialize a list of IGH_DocumentObjects

Grasshopper.Kernel.GH_Document.IgnoredUnknowns
A collection of missing component IDs to ignore during file load operations.
Erase this cache to re-enable all the load warnings.

Grasshopper.Kernel.GH_Document.AppendToDebugLog(Grasshopper.Kernel.GH_DebugDescriptionWriter)
Useful for creating textual representations of this document for debugging purposes.

Grasshopper.Kernel.GH_Document.ClusterInstanceCount(System.Guid)
Counts the number of instances of a specific cluster document ID.
id: The cluster document id to search for.
Returns: The number of instances of a specific cluster.

Grasshopper.Kernel.GH_Document.FindClusters(System.Guid)
Find all the clusters that have a matching ID.
id: Cluster DocumentID to search for.
Returns: A list of all the clusters that match the ID.

Grasshopper.Kernel.GH_Document.FindClusters(System.String)
Find all the clusters that have a matching filepath.
filepath: Cluster FilePath to search for.
Returns: A list of all the clusters that match the filepath.

Grasshopper.Kernel.GH_Document.ClusterInputHooks
Gets a sorted list of all the cluster input hooks.
Returns: A list of hooks in the proper order (from top to bottom, left to right).

Grasshopper.Kernel.GH_Document.ClusterOutputHooks
Gets a sorted list of all the cluster output hooks.
Returns: A list of hooks in the proper order (from top to bottom, left to right).

Grasshopper.Kernel.GH_Document.ContainsClusterHooks
Tests whether this document contains at least one cluster hook.

Grasshopper.Kernel.GH_Document.CreateAutomaticClusterHooks
Add an input hook for every non-optional input parameter
with no persistent data and no sources. Then add an output hook for
every floating parameter without recipients, and for every
first component output parameter where the parent component has no recipients.
Remarks:

Grasshopper.Kernel.GH_Document.CreateAutomaticInputHooks
Add an input hook for every non-optional input parameter
with no persistent data and no sources.
Returns: A list of all added hooks.

Grasshopper.Kernel.GH_Document.CreateAutomaticOutputHooks
Add an output hook for every floating parameter without recipients, and for every
first component output parameter where the parent component has no recipients.
Returns: A list of all added hooks.

Grasshopper.Kernel.GH_Document.RaiseEvents
If RaiseEvents is set to false, all the On....() methods of this document will stop raising events.

Grasshopper.Kernel.GH_Document.SettingsChanged
Some settings of the document were changed.
sender: Document that raised the event.
e: Arguments with further details about the event.

Grasshopper.Kernel.GH_Document.EnabledChanged
The Enabled state was changed on this document.
sender: Document that raised the event.
e: Arguments with further details about the event.

Grasshopper.Kernel.GH_Document.ContextChanged
The context for this document was changed.
sender: Document that raised the event.
e: Arguments with further details about the event.

Grasshopper.Kernel.GH_Document.ModifiedChanged
The modified flag on the document was changed.
sender: Document that raised the event.
e: Arguments with further details about the event.

Grasshopper.Kernel.GH_Document.ObjectsAdded
Raised after a collection of objects was added to the document.
sender: Document that raised the event.
e: Arguments with further details about the event.

Grasshopper.Kernel.GH_Document.ObjectsDeleted
Raised after a collection of objects was removed from the document.
At this point, the objects still exist, but they no longer belong to this document.
sender: Document that raised the event.
e: Arguments with further details about the event.

Grasshopper.Kernel.GH_Document.UndoStateChanged
Raised whenever there is a change to the document undo/redo stack.
sender: Document that raised the event.
e: Arguments with further details about the event.

Grasshopper.Kernel.GH_Document.FilePathChanged
Raised whenever the FilePath of the document is modified.

Grasshopper.Kernel.GH_Document.OnSettingsChanged(Grasshopper.Kernel.GH_DocumentSettings)
Raise the SettingsChanged event.

Grasshopper.Kernel.GH_Document.OnEnabledChanged
Raise the EnabledChanged event.

Grasshopper.Kernel.GH_Document.OnContextChanged
Raise the ContextChanged event.

Grasshopper.Kernel.GH_Document.OnModifiedChanged
Raise the ModifiedChanged event
Remarks:

Grasshopper.Kernel.GH_Document.OnObjectAdded(Grasshopper.Kernel.IGH_DocumentObject)
Raise the ObjectsAdded event.
doc_object: Object that was added.

Grasshopper.Kernel.GH_Document.OnObjectsAdded(System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_DocumentObject})
Raise the ObjectsAdded event.
doc_objects: Objects that were added.

Grasshopper.Kernel.GH_Document.OnObjectDeleted(Grasshopper.Kernel.IGH_DocumentObject)
Raise the ObjectsDeleted event.
doc_object: Object that was deleted.

Grasshopper.Kernel.GH_Document.OnObjectsDeleted(System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_DocumentObject})
Raise the ObjectsDeleted event.
doc_objects: Objects that were deleted.

Grasshopper.Kernel.GH_Document.OnUndoStateChanged(Grasshopper.Kernel.GH_UndoOperation,Grasshopper.Kernel.Undo.GH_UndoRecord)
Raise the UndoStateChanged event.
op: Type of undo operation to provide with the Event arguments.
rec: Record to provide in the Event arguments.

Grasshopper.Kernel.GH_Document.OnFilePathChanged(System.String,System.String)
Raise the FilePathChanged event.
old: Old filepath.
new: New filepath.

Grasshopper.Kernel.GH_Document.FilterObjects(System.Collections.Generic.List{Grasshopper.Kernel.IGH_DocumentObject},Grasshopper.Kernel.GH_Filter,Grasshopper.Kernel.GH_Filter,Grasshopper.Kernel.GH_Filter)
Filter a list of objects using several filters at once
in: The set to filter
bSelectedObjects: Filter (non)selected objects only
bEnabledObjects: Filter (non)enabled objects only
bActiveObjects: Filter (non)active objects only
Returns: A list with all objects that pass all filters

Grasshopper.Kernel.GH_Document.FilterSelected(System.Collections.Generic.List{Grasshopper.Kernel.IGH_DocumentObject})
Filter a list of objects.
in: The object list to filter
Returns: A list containing only the selected objects
Remarks:

Grasshopper.Kernel.GH_Document.FilterUnselected(System.Collections.Generic.List{Grasshopper.Kernel.IGH_DocumentObject})
Filter a list of objects.
in: The object list to filter
Returns: A list containing only the unselected objects
Remarks:

Grasshopper.Kernel.GH_Document.FilterEnabled(System.Collections.Generic.List{Grasshopper.Kernel.IGH_DocumentObject})
Filter a list of objects.
in: The object list to filter
Returns: A list containing only the enabled objects
Remarks:

Grasshopper.Kernel.GH_Document.FilterDisabled(System.Collections.Generic.List{Grasshopper.Kernel.IGH_DocumentObject})
Filter a list of objects.
in: The object list to filter
Returns: A list containing only the disabled objects
Remarks:

Grasshopper.Kernel.GH_Document.FilterActive(System.Collections.Generic.List{Grasshopper.Kernel.IGH_DocumentObject})
Filter a list of objects.
in: The object list to filter
Returns: A list containing only the objects that implement the IGH_ActiveObject interface
Remarks:

Grasshopper.Kernel.GH_Document.FilterInactive(System.Collections.Generic.List{Grasshopper.Kernel.IGH_DocumentObject})
Filter a list of objects.
in: The object list to filter
Returns: A list containing only the objects that don't implement the IGH_ActiveObject interface
Remarks:

Grasshopper.Kernel.GH_Document.NullFilter(Grasshopper.Kernel.IGH_ActiveObject)
This delegate can be used in the FindAllDownstreamObjects(...) methods. Includes all objects.

Grasshopper.Kernel.GH_Document.NonBlankFilter(Grasshopper.Kernel.IGH_ActiveObject)
This delegate can be used in the FindAllDownstreamObjects(...) methods. Only includes objects that are non-blank and non-failed.

Grasshopper.Kernel.GH_Document.FilterObjects(Grasshopper.Kernel.GH_Filter,Grasshopper.Kernel.GH_Filter,Grasshopper.Kernel.GH_Filter)
Returns all objects in the document that pass the filter specification

Grasshopper.Kernel.GH_Document.SelectedObjects
Returns all selected objects in the document
Returns:

Grasshopper.Kernel.GH_Document.SelectedCount
Gets the number of selected objects

Grasshopper.Kernel.GH_Document.SelectionTopology
Gets the selection topology of the document.

Grasshopper.Kernel.GH_Document.IsConcaveSelection(Grasshopper.Kernel.IGH_DocumentObject,System.Collections.Generic.SortedDictionary{System.Guid,System.Boolean},System.Boolean)
Recursively search uphill for concave selections.
object: Object to search from.
map: Dictionary of all traversed objects.
inSelection: Boolean indicating whether the current node is within the primary selection group.
Returns: True if selection is concave.

Grasshopper.Kernel.GH_Document.UnselectedObjects
Returns all unselected objects in the document
Returns:

Grasshopper.Kernel.GH_Document.EnabledObjects
Returns all enabled objects in the document
Returns:

Grasshopper.Kernel.GH_Document.DisabledObjects
Returns all disabled objects in the document
Returns:

Grasshopper.Kernel.GH_Document.ActiveObjects
Returns all normal objects in the document that implement the IGH_ActiveObject interface
Returns:

Grasshopper.Kernel.GH_Document.InactiveObjects
Returns all objects in the document that don't implement the IGH_ActiveObject interface
Returns:

Grasshopper.Kernel.GH_Document.FindObject(System.Guid,System.Boolean)
Find the object that matches the ID.
id: The ID to search for.
topLevelOnly: If True, only top-level objects are included. If False, the entire object attribute tree is recursed

Grasshopper.Kernel.GH_Document.FindObject``1(System.Guid,System.Boolean)
Find the object that matches the ID.
Object type constraint.
id: The ID to search for.
topLevelOnly: If True, only top-level objects are included. If False, the entire object attribute tree is recursed

Grasshopper.Kernel.GH_Document.FindObject(System.Drawing.PointF,System.Single)
Find the topmost object that is closest to the point
pt: Canvas coordinates for object lookup
radius: Radius, (in canvas units) for search.

Grasshopper.Kernel.GH_Document.FindParameter(System.Guid)
Search for parameters using an ID filter
id: ID to search for
Returns: The parameter with the ID, or Null if no parameter could be found
Remarks:

Grasshopper.Kernel.GH_Document.FindComponent(System.Guid)
Search for components using an ID filter
id: ID to search for
Returns: The component with the ID, or Null if no component could be found
Remarks:

Grasshopper.Kernel.GH_Document.FindComponent(System.Drawing.Point)
Search for components that contain the locus
pt: The point to search for

Grasshopper.Kernel.GH_Document.FindAttribute(System.Drawing.PointF,System.Boolean)
Search for attributes that contain a certain point.
pt: The point in Canvas coordinates
topLevelOnly: If true, child attributes will be skipped.

Grasshopper.Kernel.GH_Document.FindAttribute(System.Guid)
Find the object that matches the ID
id: the ID to search for

Grasshopper.Kernel.GH_Document.FindAttributeByGrip(System.Drawing.PointF,System.Boolean,System.Int32)
Search for attributes that contain grips near the search locus
pt: Pixel for search start
bLimitToOutside: If true, grips are ignored if the pt is on the 'inside' side.
SearchRadius: Radius of search

Grasshopper.Kernel.GH_Document.FindAttributeByGrip(System.Drawing.PointF,System.Boolean,System.Boolean,System.Boolean,System.Int32)
Search for attributes that contain grips near the search locus
pt: Pixel for search start
bLimitToOutside: If true, grips are ignored if the pt is on the 'inside' side.
SearchRadius: Radius of search

Grasshopper.Kernel.GH_Document.FindFloatingParameter(System.Drawing.Point)
Search for floating parameters that contain the locus
pt: Point for search start

Grasshopper.Kernel.GH_Document.FindOutputParameter(System.Drawing.Point)
Search for output (downstream) parameters that contain the locus
pt: Point for search start

Grasshopper.Kernel.GH_Document.FindInputParameter(System.Drawing.Point)
Search for input (upstream) parameters that contain the locus
pt: Point for search start

Grasshopper.Kernel.GH_Document.FindAllDownstreamObjects(Grasshopper.Kernel.IGH_ActiveObject)
Find all objects that depend in some way on the Source.
from: Object to start searching from.

Grasshopper.Kernel.GH_Document.FindAllDownstreamObjects(Grasshopper.Kernel.IGH_ActiveObject,Grasshopper.Kernel.GH_Document.GH_ActiveObjectFilter)
Find all objects that depend in some way on the Source.
from: Object to start searching from.
filter: The inclusion delegate

Grasshopper.Kernel.GH_Document.FindAllDownstreamObjects(System.Collections.Generic.List{Grasshopper.Kernel.IGH_ActiveObject})
Find all objects that depend in some way on the Source collection
from: Objects to start searching from.

Grasshopper.Kernel.GH_Document.FindAllDownstreamObjects(System.Collections.Generic.List{Grasshopper.Kernel.IGH_ActiveObject},Grasshopper.Kernel.GH_Document.GH_ActiveObjectFilter)
Find all objects that depend in some way on the Source collection
from: Objects to start searching from.
filter: The inclusion delegate

Grasshopper.Kernel.GH_Document.BoundingBox(System.Boolean)
Returns the boundingbox of all the normal attributes. If the document contains no
normal attributes an Empty RectangleF structure is returned.
limitToSelection: If true, only selected attributes are included in the boundingbox computation.
Returns: The boundingbox of the requested objects or RectangleF.Empty if no objects could be found.

Grasshopper.Kernel.GH_Document.AutoLayoutComponents(System.Boolean)
Perform automatic layout on this document.
limitToSelection: If true, only selected objects will be considered.

Grasshopper.Kernel.GH_Document.AutoLayoutComponents(System.Collections.Generic.IList{Grasshopper.Kernel.IGH_DocumentObject})
Perform automatic layout on this document.
objects: Objects to consider.

Grasshopper.Kernel.GH_Document.MoveBoxes(System.Collections.Generic.List{System.Drawing.Rectangle})
Move all currently colliding boxes.
boxes: Boxes to move.
Returns: True if boxes were moved.

Grasshopper.Kernel.GH_Document.DefaultPreviewColourChanged
This even is raised whenever the global default for Normal preview colour is changed.
colour: the new colour assigned as default to new Documents.

Grasshopper.Kernel.GH_Document.DefaultSelectedPreviewColourChanged
This even is raised whenever the global default for Selected preview colour is changed.
colour: the new colour assigned as default to new Documents.

Grasshopper.Kernel.GH_Document.DefaultPreviewColour
Gets or sets the default preview colour for normal objects.

Grasshopper.Kernel.GH_Document.DefaultSelectedPreviewColour
Gets or sets the default preview colour for normal objects.

Grasshopper.Kernel.GH_Document.PreviewColour
Gets or sets the colour of unselected preview geometry.

Grasshopper.Kernel.GH_Document.PreviewColourSelected
Gets or sets the colour of selected preview geometry.

Grasshopper.Kernel.GH_Document.PreviewMeshType
Gets or sets the preview mesh type for this document.

Grasshopper.Kernel.GH_Document.PreviewCustomMeshParameters
Gets or sets the Custom Meshing Parameters for this document,
these are only used when PreviewMeshType = GH_PreviewMesh.Custom

Grasshopper.Kernel.GH_Document.PreviewBoundingBox
Gets the boundingbox used for previews.

Grasshopper.Kernel.GH_Document.PreviewCurrentMeshParameters
Gets the currently relevant meshing parameters (do not modify the instance as it may be shared).

Grasshopper.Kernel.GH_Document.DestroyPreviewMeshes
Attempts to destroy all the preview meshes in this document.
It might not work for all objects, but this is still your best bet.

Grasshopper.Kernel.GH_Document.ShowPreviewSettings
Display the Preview settings dialog.

Grasshopper.Kernel.GH_Document.DestroyPreviewCaches
Wipe all caches for Viewport Preview logic.

Grasshopper.Kernel.GH_Document.CreatePreviewCaches
Recompute all caches for Viewport Preview logic.

Grasshopper.Kernel.GH_Document.IsRenderMeshPipelineViewport(Rhino.Display.DisplayPipeline)
Test to see whether a pipeline should have custom render meshes vs. previews.
pipeline: Display pipeline.
Returns: True if custom meshes ought to be used rather than previews.

Grasshopper.Kernel.GH_Document.ShouldDrawPreview
Determine whether previews are drawn in a viewport.
This only happens if the document is currently loaded in the active canvas,
or the remote control panel is active.

Grasshopper.Kernel.GH_Document.ForcePreview(System.Boolean)
If true, the document will draw viewport previews regardless of other
conditions. Typically a document only previews if it is loaded in the canvas
or when it has an RCP.

Grasshopper.Kernel.GH_Document.PreviewBoundary
Gets or sets the preview boundary applied to this document.
If a boundary has been set, only those objects which are inside
the boundary will be previewed.

Grasshopper.Kernel.GH_Document.CreateBiasXForm(Rhino.Display.RhinoViewport,System.Double,System.Double)
Compute a Display Model transform that will "pull" geometry towards the camera.
viewport: Viewport context for transform.
bias: Bias indicated linear motion towards the camera.
factor: Factor indicates linear scaling towards the camera.
Returns: A Display Transform matrix which can be assigned to a DisplayPipeline ModelTransform.

Grasshopper.Kernel.GH_Document.RelevantObjectAtPoint(System.Drawing.PointF)
Find the most relevant object at a given canvas location.
The most relevant object might be a regular Object (Component or Parameter),
it might be an attribute grip, an attribute balloon, a wire or a group.
pt: The point to test.
Returns: Information about the most relevant object or Null if no
relevant object could be found at the given point.

Grasshopper.Kernel.GH_Document.RelevantObjectAtPoint(System.Drawing.PointF,Grasshopper.Kernel.GH_RelevantObjectFilter)
Find the most relevant object at a given canvas location.
The most relevant object might be a regular Object (Component or Parameter),
it might be an attribute grip, an attribute balloon, a wire or a group.
pt: The point to test.
Returns: Information about the most relevant object or Null if no
relevant object could be found at the given point.

Grasshopper.Kernel.GH_Document.Select(Grasshopper.Kernel.GH_RelevantObjectData)
Default pick selection behaviour. (looks at current Shift + Control modifier states to determine addition/removal)
obj_dat: Information regarding the object to be selected.

Grasshopper.Kernel.GH_Document.Select(Grasshopper.Kernel.GH_RelevantObjectData,System.Boolean,System.Boolean)
Default pick selection behaviour
obj_dat: Information regarding the object to be selected.
bAdd: If True, it will add the topmost unselected object that contains pt to the selection set.
If False, the selection set will be cleared when an unselected object is picked
bRemove: If True, it will remove the topmost selected object that contains pt from the selection set.

Grasshopper.Kernel.GH_Document.SpeciesFilter(System.Object,Grasshopper.Kernel.GH_ObjectSpecies)
Determines whether an object passes a species filter.
obj: Object to filter. If object is null this function always returns False.
species: Species filter.
Returns: True if obj passes the species filter.

Grasshopper.Kernel.GH_Document.SelectAll
Select all top-level attributes.

Grasshopper.Kernel.GH_Document.DeselectAll
Deselect all top-level attributes.

Grasshopper.Kernel.GH_Document.InvertSelection
Invert the selected state of all top-level attributes.

Grasshopper.Kernel.GH_Document.ExpandSelection(System.Boolean,System.Boolean,System.Boolean)
Grow or shift the selection set based on source and recipient links
Upstream: If True, the selection will grow/shift upstream
Downstream: If True, the selection will grow/shift downstream
GrowSelection: If True, the current selection set is retained.
If False, the current selection set is discarded

Grasshopper.Kernel.GH_Document.RemoveSelection(System.Boolean)
Delete all the objects in the selection set.
This method does not record an Undo event, that is the responsibility of the caller.
update: If True, the solution will be recomputed.

Grasshopper.Kernel.GH_Document.FindWireAt(System.Drawing.PointF,System.Single,Grasshopper.Kernel.IGH_Param@,Grasshopper.Kernel.IGH_Param@)
Find the wire at or near the given coordinate.
point: Search locus.
radius: Search radius.
source: Source parameter of wire (if found).
target: Target parameter of wire (if found).
Returns: True if a wire was found.

Grasshopper.Kernel.GH_Document.DistanceToWire(System.Drawing.PointF,System.Single,System.Drawing.PointF,System.Drawing.PointF)
Measure the distance from a point to a wire bezier.
locus: Search locus.
radius: Search radius.
source: Wire source.
target: Wire target.
Returns: Distance from locus to wire.

Grasshopper.Kernel.GH_Document.BringSelectionToTop
Move the selection set to the top of the visible stack

Grasshopper.Kernel.GH_Document.ArrangeObject(Grasshopper.Kernel.IGH_DocumentObject,Grasshopper.Kernel.GH_Arrange)
Rearrange the stack order of the object.
obj: Object to move.
motion: Direction to move in.

Grasshopper.Kernel.GH_Document.ArrangeObjects(System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_DocumentObject},Grasshopper.Kernel.GH_Arrange)
Rearrange the stack order of a collection of objects.
objs: Objects to move.
motion: Direction to move in.

Grasshopper.Kernel.GH_Document.AlignObjects(Grasshopper.GUI.Alignment.GH_Align,Grasshopper.GUI.Alignment.GH_Distribute)
Perform alignment and distribution logic on all selected objects.

Grasshopper.Kernel.GH_Document.AlignObjects(Grasshopper.GUI.Alignment.GH_Align,Grasshopper.GUI.Alignment.GH_Distribute,System.Collections.Generic.List{Grasshopper.Kernel.IGH_DocumentObject})
Perform alignment and distribution logic on a set of objects.

Grasshopper.Kernel.GH_Document.TranslateObjects(System.Drawing.Size,System.Boolean)
Offset objects by a certain distance in X and Y
trXForm: Translation vector
bLimitToSelection: If True, only selected objects are affected

Grasshopper.Kernel.GH_Document.SetPreviewFlags(System.Boolean)
Set the preview flags of all selected objects to true or false

Grasshopper.Kernel.GH_Document.SetPreviewFlags(System.Collections.Generic.List{Grasshopper.Kernel.IGH_DocumentObject},System.Boolean)
Set the preview flags of all specified objects to true or false

Grasshopper.Kernel.GH_Document.TogglePreviewFlags
Toggle the preview flags of all selected objects

Grasshopper.Kernel.GH_Document.TogglePreviewFlags(System.Collections.Generic.List{Grasshopper.Kernel.IGH_DocumentObject})
Toggle the preview flags of all specified objects

Grasshopper.Kernel.GH_Document.SetEnabledFlags(System.Boolean)
Set the enabled flags of all selected objects to true or false

Grasshopper.Kernel.GH_Document.SetEnabledFlags(System.Collections.Generic.List{Grasshopper.Kernel.IGH_DocumentObject},System.Boolean)
Set the enabled flags of all specified objects to true or false

Grasshopper.Kernel.GH_Document.ToggleEnabledFlags
Toggle the enabled flags of all selected objects

Grasshopper.Kernel.GH_Document.ToggleEnabledFlags(System.Collections.Generic.List{Grasshopper.Kernel.IGH_DocumentObject})
Toggle the enabled flags of all specified objects

Grasshopper.Kernel.GH_Document.SolutionStart
This event is raised whenever a new solution is requested.
Even if the document is locked.

Grasshopper.Kernel.GH_Document.SolutionEnd
This event is raised whenever a new solution request has been handled.
Even if the document is locked.

Grasshopper.Kernel.GH_Document.SolutionState
Gets the state of this document.

Grasshopper.Kernel.GH_Document.SolutionSpan
Gets the timespan for the most recent solution.

Grasshopper.Kernel.GH_Document.SolutionHistory
Gets a list of the last 1000 solution timespans, from oldest to youngest.

Grasshopper.Kernel.GH_Document.ObjectSpan
Gets the total timespan for all objects.

Grasshopper.Kernel.GH_Document.SolutionProgress(System.Int32@,System.Int32@)
Returns the progress of the current solution.
objectIndex: The index of the object currently being solved.
maximumIndex: The highest index.
Returns: Percentage of solution as a number between 1 and 99 inclusive.

Grasshopper.Kernel.GH_Document.ExpireSolution
Expire the entire solution. This will blank all objects.

Grasshopper.Kernel.GH_Document.ExpirePreview(System.Boolean)
Expires the preview caches of the conduit.

Grasshopper.Kernel.GH_Document.RequestAbortSolution
Set the requestabort flag. The solution will be aborted whenever the current active object is completed.
It is also possible that active objects themselves implement an abortion mechanism, in which case abortion
might occur even sooner.

Grasshopper.Kernel.GH_Document.AbortRequested
Gets the abortrequested flag state.

Grasshopper.Kernel.GH_Document.SolutionDepth
Gets the number of nested solutions currently running.
If no solutions are running, the depth should be zero.
If one solution is runnnig, the depth should be one.
Higher depths are only possible if a new solution was
scheduled from within an existing solution with delay=0ms.

Grasshopper.Kernel.GH_Document.NewSolution(System.Boolean)
Start a new solution.
expireAllObjects: If True, all objects will be recalculated.
If False, only already expired objects will be recalculated.

Grasshopper.Kernel.GH_Document.NewSolution(System.Boolean,Grasshopper.Kernel.GH_SolutionMode)
Start a new solution.
expireAllObjects: If True, all objects will be recalculated.
If False, only already expired objects will be recalculated.
mode: Solution mode. Only use CommandLine or Silent if your solution runs in the background.

Grasshopper.Kernel.GH_Document.SolveAllObjects(Grasshopper.Kernel.GH_SolutionMode)
Iterate over the object list and solve the gaps.

Grasshopper.Kernel.GH_Document.IsEscapeKeyDown
Gets whether the escape key was pressed since the last time this function was called.
Though in reality the actual escape state is checked no more than once every
50 milliseconds or so, which should be sufficient for a smooth user experience.
Remarks: If GetAsyncKeyState is called by some other application, it will mess
with the value returned here, as GetAsyncKeyState is a system wide static method.
Returns: True if escape was/is pressed, false if otherwise.

Grasshopper.Kernel.GH_Document.IgnoredCount
Returns the total numbers of components currently in the Object Exception Ignore List.

Grasshopper.Kernel.GH_Document.ClearIgnoreList
Clears the Object Exception Ignore List.

Grasshopper.Kernel.GH_Document.EnableSolutionsChanged
Raised whenever the Shared EnabledSolutions property is changed.
state: New enabled state, True if solutions are now allowed.

Grasshopper.Kernel.GH_Document.EnableSolutions
Gets or sets a global variable that indicates whether solutions are allowed to be recomputed.
When this flag is off, the solver will be disabled and the event watchers should be silent.

Grasshopper.Kernel.GH_Document.ScheduleInactive
Defined the delay used to indicate the absence of a schedule.

Grasshopper.Kernel.GH_Document.ScheduleRecursive
Defines the delay used to indicate the schedule should be immedate and recursive.

Grasshopper.Kernel.GH_Document.ScheduleCallDelegates
Trigger all callbacks. The callback list will be wiped once the callbacks are complete.

Grasshopper.Kernel.GH_Document.ScheduleDelay
Gets the delay for the next scheduled solution.
If there is no solution scheduled the delay will be negative.

Grasshopper.Kernel.GH_Document.ScheduleSolution(System.Int32)
Schedule a new solution after a specified time interval. The schedule is erased if another solution
is triggered before the schedule is executed. Tight schedules override loose schedules.
If this method is called during a solution, the schedule will be started
after the current solution completes.
delay: The delay (in milliseconds) between the completion of this solution
and the start of the scheduled solution. If the delay is 1ms or more, a timer will be used
to trigger a new solution sometime in the future. If a delay of 0ms is used, then the
next solution will run recursively within the current solution. You should not use a delay of
zero milliseconds too often as it will cause the Rhino process to run out of stack-space.
The SolutionDepth property can be used to see how deeply recursive the solution currently is.

Grasshopper.Kernel.GH_Document.ScheduleSolution(System.Int32,Grasshopper.Kernel.GH_Document.GH_ScheduleDelegate)
Schedule a new solution after a specified time interval. The schedule is erased if another solution
is triggered before the schedule is executed. Tight schedules override loose schedules.
If this method is called during a solution, the schedule will be started
after the current solution completes.
delay: The delay (in milliseconds) between the completion of this solution
and the start of the scheduled solution. If the delay is 1ms or more, a timer will be used
to trigger a new solution sometime in the future. If a delay of 0ms is used, then the
next solution will run recursively within the current solution. You should not use a delay of
zero milliseconds too often as it will cause the Rhino process to run out of stack-space.
The SolutionDepth property can be used to see how deeply recursive the solution currently is.
callback: If not null, the callback will be called before the scheduled solution
is triggered.

Grasshopper.Kernel.GH_Document.ScheduleTimerTick(System.Object)
This method is called from the timer thread.
state: state is always null.

Grasshopper.Kernel.GH_Document.ScheduleTimerTickThreadSafe
This method is invoked from the timer thread via the main editor UI thread.

Grasshopper.Kernel.GH_Document.StartSchedule
If there's a schedule, start the timer.