Grasshopper.Kernel.GH_AutoSaveTrigger
Different types of events that can cause an AutoSave.

Grasshopper.Kernel.GH_AutoSaveTrigger.undefined
Generic autosave trigger, this flag is not filtered.

Grasshopper.Kernel.GH_AutoSaveTrigger.doc_unload
Autosave was triggered by a document being unloaded from a Canvas Context.

Grasshopper.Kernel.GH_AutoSaveTrigger.object_added
Autosave was triggered by the addition of an object to the document.

Grasshopper.Kernel.GH_AutoSaveTrigger.object_removed
Autosave was triggered by the removal of an object from the document.

Grasshopper.Kernel.GH_AutoSaveTrigger.wire_event
Autosave was triggered by a change in connector wires.

Grasshopper.Kernel.GH_AutoSaveTrigger.data_matching_event
Autosave was triggered by a change to Data Matching settings.

Grasshopper.Kernel.GH_AutoSaveTrigger.data_modification_event
Autosave was triggered by a change to Data modifier settings.

Grasshopper.Kernel.GH_AutoSaveTrigger.object_generic
Autosave was triggered by a non-trivial change to object data or settings.