Grasshopper.Kernel.Data.GH_Path
Describes the path in structure space of a data item or a list of items.
A path consists of a series of integers, each one of which represents an index in a branch structure.

Grasshopper.Kernel.Data.GH_Path.#ctor
Default constructor, creates a path with zero elements.

Grasshopper.Kernel.Data.GH_Path.#ctor(System.Int32)
Creates a new path with a single element.
index: The index of the first element.

Grasshopper.Kernel.Data.GH_Path.#ctor(System.Int32[])
Creates a new path from a series of elements.
args: The index values of this path, if null, an empty path is created.

Grasshopper.Kernel.Data.GH_Path.#ctor(Grasshopper.Kernel.Data.GH_Path)
Creates an exact copy of another path.
Other: Path to copy, cannot be null.
Throws System.ArgumentNullException: Thrown if Other is a null reference

Grasshopper.Kernel.Data.GH_Path.GetHashCode
Specialized Hash code pattern.

Grasshopper.Kernel.Data.GH_Path.CompareTo(Grasshopper.Kernel.Data.GH_Path)
Compare this path to another path. This function determines the Sorting behaviour of paths.

Grasshopper.Kernel.Data.GH_Path.Compare(Grasshopper.Kernel.Data.GH_Path,Grasshopper.Kernel.Data.GH_Path)
Compare two paths. This function determines the Sorting behaviour of paths.

Grasshopper.Kernel.Data.GH_Path.Dimension(System.Int32)
Gets or sets the value of the path at the given dimension index.
index: Index of dimension.

Grasshopper.Kernel.Data.GH_Path.DebuggerDisplay
Gets the debugger display string for this Path instance.

Grasshopper.Kernel.Data.GH_Path.Indices
Gets or sets the entire index space; the path that identifies an element in structure space.
You should not change the index space when the path is used inside a structure since it will invalidate
the sort order. If you don't know what you're doing, for Pete's sake don't touch this.

Grasshopper.Kernel.Data.GH_Path.InternalPath
Gets or sets the entire index space; the path that identifies an element in structure space.
You should not change the index space when the path is used inside a structure since it will invalidate
the sort order. If you don't know what you're doing, for Pete's sake don't touch this.

Grasshopper.Kernel.Data.GH_Path.Length
Returns the number of dimensions in the path.

Grasshopper.Kernel.Data.GH_Path.Valid
Gets whether this path is valid. Invalid paths either have no
elements or negative elements.

Grasshopper.Kernel.Data.GH_Path.ToString
Concatenates the indices in the path.

Grasshopper.Kernel.Data.GH_Path.ToString(System.Boolean)
Concatenates the indices in the path.
includeBrackets: If True, brackets will be prepended and appended to the path string.

Grasshopper.Kernel.Data.GH_Path.Format(System.String,System.String)
Format a path.
format_provider: The string describing the format. You are allowed to use
{0} as a format placeholder. The placeholder will be filled up with a semi-colon separated list:
0;0;2;4
separator: Character to use for element separators. The default separator is a semi-colon.
Returns: Formatted string.

Grasshopper.Kernel.Data.GH_Path.SplitPathLikeString(System.String,System.String[]@,System.String@)
Try to split up a path-like formatted string "{A;B;C}(i)" into component parts.
s: String to parse.
path_segments: Output - Strings inside the path portion of s.
index_segment: Output - String inside the index portion of s.
Returns: True on success, false on failure.

Grasshopper.Kernel.Data.GH_Path.FromString(System.String)
Try to deserialize a GH_Path from a String.

Grasshopper.Kernel.Data.GH_Path.IsCoincident(Grasshopper.Kernel.Data.GH_Path)
Test to see if this path is coincident with another path.
other: Path to compare to.
Returns: True if both paths are coincident (identical), false if not.

Grasshopper.Kernel.Data.GH_Path.IsCoincident(System.Int32[])
Test to see if this path is coincident with set of integers.
index_list: Integers to compare to.
Returns: True if both paths are coincident (identical), false if not.

Grasshopper.Kernel.Data.GH_Path.IsAncestor(Grasshopper.Kernel.Data.GH_Path,System.Int32@)
Test another path to see if it is an ancestor of this path.
For a path to be considered an ancestor, it must share the initial dimensions.
potential_ancestor: Parental path to test.
additional_generations: This value will hold
the number of generations between parent and child path.
Returns: True if other overlaps completely with this path while
being at least one element shorter.

Grasshopper.Kernel.Data.GH_Path.AppendElement(System.Int32)
Create a new path by appending a new index value to this path.
index: Index value to append.

Grasshopper.Kernel.Data.GH_Path.PrependElement(System.Int32)
Create a new path by prepending a new index value to this path.
index: Index value to prepend.

Grasshopper.Kernel.Data.GH_Path.CullElement
Removes the last index value from the path.
If the path is already empty, nothing will happen.

Grasshopper.Kernel.Data.GH_Path.CullFirstElement
Removes the first index value from the path.
If the path is already empty, nothing will happen.

Grasshopper.Kernel.Data.GH_Path.Increment(System.Int32)
Increment a specific index in this path by one.
index: Index to increment. Valid indices are (-Length+1) to (Length-1).
Returns: A new path with incremented index.

Grasshopper.Kernel.Data.GH_Path.Increment(System.Int32,System.Int32)
Increment a specific index in this path by one.
index: Index to increment. Valis indices are (-Length+1) to (Length-1).
offset: Amount to increment.
Returns: A new path with incremented index.

Grasshopper.Kernel.Data.GH_Path.Write(GH_IO.Serialization.GH_IWriter)
Write this path to an archive.
writer: Object to write with.
Returns: True on success, false on failure.

Grasshopper.Kernel.Data.GH_Path.Read(GH_IO.Serialization.GH_IReader)
Read this path from an archive.
reader: Object to read with.
Returns: True on success, false on failure.