Grasshopper.Kernel.GH_Alias
Represents a single alias|target combo.

Grasshopper.Kernel.GH_Alias.Alias
Gets or sets the alias string.

Grasshopper.Kernel.GH_Alias.Target
Gets or sets the alias target.