Grasshopper.Kernel.GH_DocUndoEventArgs
These arguments are passed along with UndoStateChanged events on GH_Document.

Grasshopper.Kernel.GH_DocUndoEventArgs.Document
Gets the document that raised the event.

Grasshopper.Kernel.GH_DocUndoEventArgs.Operation
Gets the type of undo operation that caused this event.

Grasshopper.Kernel.GH_DocUndoEventArgs.Record
Gets the UndoRecord pertaining to this event.
Not every Event type has a single record associated with it
so be sure to test for null.