Grasshopper.GUI.HTML.GH_HtmlFormatter


Grasshopper.GUI.HTML.GH_HtmlFormatter.Title
Gets or sets the title of this html page
The title is displayed along the top of the document.
Returns:
Remarks:

Grasshopper.GUI.HTML.GH_HtmlFormatter.Description
Gets or sets the description of this html page
The description is displayed directly beneath the title
Returns:
Remarks:

Grasshopper.GUI.HTML.GH_HtmlFormatter.Remarks
Gets the list of remarks.
Remarks are displayed as a bullet list underneath the contact details
Returns:
Remarks:

Grasshopper.GUI.HTML.GH_HtmlFormatter.WebPageURI
Gets or sets the Webpage URI (email address) for this html page
The Webpage details are displayed beneath the Description section
If Null or String.Empty, no webpage details are displayed
Returns:
Remarks:

Grasshopper.GUI.HTML.GH_HtmlFormatter.ContactURI
Gets or sets the Contact URI (name@domain.com) for this html page.
The Contact details are displayed beneath the Webpage URI.
If Null or String.Empty, no contact details are displayed.
Returns:
Remarks:

Grasshopper.GUI.HTML.GH_HtmlFormatter.AddRemark(System.String,Grasshopper.GUI.HTML.GH_HtmlFormatterPalette,Grasshopper.GUI.HTML.GH_HtmlFormatterPalette)
Adds a remark to the list.
Remarks are displayed underneath the contact details
text: The text of the remark
backcolour: The background colour of the remark string
forecolour: The foreground colour of the remark string
Remarks:

Grasshopper.GUI.HTML.GH_HtmlFormatter.ReplaceSpecialCharCodes(System.String)
Replaces special chars (© ® ™ ² ³ ×) from a string with HTML codes for those chars.

Grasshopper.GUI.HTML.GH_HtmlFormatter.ReplaceBoxDrawingCodes(System.String)
Replaces Box Drawing chars from a string with HTML codes for those chars.
Tildes are replaced with Non-Breaking spaces.

Grasshopper.GUI.HTML.GH_HtmlFormatter.HtmlFormat
Converts all the items in this formatter into a single HTML formatted string
Returns:
Remarks: