Grasshopper.Documentation.GH_Target
Enumerates the possible link targets in Grasshopper documentation.

Grasshopper.Documentation.GH_Target.Glossary
Specifies a link into the Glossary.

Grasshopper.Documentation.GH_Target.Topic
Specifies a link to another topic.

Grasshopper.Documentation.GH_Target.External
Specifies a link to some external web-page.