Grasshopper.Kernel.GH_ScriptInstance


Grasshopper.Kernel.GH_ScriptInstance.ClippingBox
Override this method when you draw custom geometry.

Grasshopper.Kernel.GH_ScriptInstance.DrawViewportMeshes(Grasshopper.Kernel.IGH_PreviewArgs)
Override this method to draw meshes in the Rhino viewports.

Grasshopper.Kernel.GH_ScriptInstance.DrawViewportWires(Grasshopper.Kernel.IGH_PreviewArgs)
Override this method to draw points and curves in the Rhino viewports.