Grasshopper.Kernel.GH_PreviewArgs
This class is passed to Objects that implement IGH_PreviewObject during drawing operations.

Grasshopper.Kernel.GH_PreviewArgs.Document
Gets the Grasshopper document that is currently drawing the preview.

Grasshopper.Kernel.GH_PreviewArgs.Display
Gets the Pipeline that is being used to draw the current preview.

Grasshopper.Kernel.GH_PreviewArgs.Viewport
Gets the Viewport in which the current preview is drawn.

Grasshopper.Kernel.GH_PreviewArgs.DefaultCurveThickness
Gets the curve thickness as defined by the viewport display scheme.

Grasshopper.Kernel.GH_PreviewArgs.ShadeMaterial
Gets the document default material for unselected Faces.

Grasshopper.Kernel.GH_PreviewArgs.ShadeMaterial_Selected
Gets the document default material for selected Faces.

Grasshopper.Kernel.GH_PreviewArgs.WireColour
Gets the document default colour for unselected Wires.

Grasshopper.Kernel.GH_PreviewArgs.WireColour_Selected
Gets the document default colour for selected Wires.

Grasshopper.Kernel.GH_PreviewArgs.MeshingParameters
Gets the meshing parameters to be used during meshing breps.