Grasshopper.GUI.Canvas.GH_PaletteStyle
Contains all the colours for a single capsule palette.

Grasshopper.GUI.Canvas.GH_PaletteStyle.#ctor(System.Drawing.Color)
Construct a new GH_Box_Palette_Colours instance with a single base colour.
fill: Colour to use for background fills. All other colours are computed based on this colour.

Grasshopper.GUI.Canvas.GH_PaletteStyle.#ctor(System.Drawing.Color,System.Drawing.Color)
Construct a new GH_Box_Palette_Colours instance.
fill: Colour to use for background fills.
edge: Colour to use for edges.

Grasshopper.GUI.Canvas.GH_PaletteStyle.#ctor(System.Drawing.Color,System.Drawing.Color,System.Drawing.Color)
Construct a new GH_Box_Palette_Colours instance.
fill: Colour to use for background fills.
edge: Colour to use for edges.
text: Colour to use for text objects.

Grasshopper.GUI.Canvas.GH_PaletteStyle.Fill
Gets or sets the fill of this style.

Grasshopper.GUI.Canvas.GH_PaletteStyle.Edge
Gets or sets the edge of this style.

Grasshopper.GUI.Canvas.GH_PaletteStyle.Text
Gets or sets the text of this style.

Grasshopper.GUI.Canvas.GH_PaletteStyle.CreateBrush(System.Drawing.RectangleF,System.Single)
Create a fill brush. At low zoom levels the brush will be solid colour,
at medium to high zoom levels the brush will have a gradient.
rec: Target rectangle of fill brush.
zoom: Zoom level of target graphics surface.
Returns: A brush object that can be used to fill a custom area.