Grasshopper.GUI.Stacks.GH_Interpolation
Interpolation method for time based frame animation.

Grasshopper.GUI.Stacks.GH_Interpolation.linear
perform linear interpolation between keyframes.

Grasshopper.GUI.Stacks.GH_Interpolation.cubic
Perform cubic interpolation between keyframes according to: t² × (3 - (2 × t))