Grasshopper.Kernel.Types.UVInterval
UVInterval data type. Do not confuse this with GH_Interval2D.

Grasshopper.Kernel.Types.UVInterval.U
Gets or sets the U interval.

Grasshopper.Kernel.Types.UVInterval.V
Gets or sets the V interval.

Grasshopper.Kernel.Types.UVInterval.U0
Gets or sets the T0 value of the U domain.

Grasshopper.Kernel.Types.UVInterval.U1
Gets or sets the T1 value of the U domain.

Grasshopper.Kernel.Types.UVInterval.V0
Gets or sets the T0 value of the V domain.

Grasshopper.Kernel.Types.UVInterval.V1
Gets or sets the T1 value of the V domain.

Grasshopper.Kernel.Types.UVInterval.IsValid
Gets a value indicating whether or not this UVInterval is valid.