Grasshopper.Kernel.Parameters.Hints.GH_TypeHintServer.#ctor
This class cannot be constructed, you must use the Shared methods it exposes.

Grasshopper.Kernel.Parameters.Hints.GH_TypeHintServer.FindHintByID(System.Guid)
Search the entire assembly for a type hint that matches the ID.
hint_id: ID to search for.

Grasshopper.Kernel.Parameters.Hints.GH_TypeHintServer.FindHintByName(System.String)
Search the entire assembly for a type hint that matches the name.
The search is not case sensitive.
hint_name: Name to search for.