Grasshopper.Kernel.Types.GH_Light
Represents an implementation of a Rhino Light class.

Grasshopper.Kernel.Types.GH_Light.#ctor
Default constructor, creates an new light

Grasshopper.Kernel.Types.GH_Light.#ctor(Rhino.Geometry.Light)
Create a duplicate of an existing light.
light: Light to duplicate

Grasshopper.Kernel.Types.GH_Light.#ctor(System.Guid)
Create a new referenced light that references a Rhino light with the specified ID.
ref_guid: ID of light object to reference.

Grasshopper.Kernel.Types.GH_Light.#ctor(Grasshopper.Kernel.Types.GH_Light)
Create a duplicate of another GH_Light. This constructor also copies reference data.
other: GH_Light to duplicate

Grasshopper.Kernel.Types.GH_Light.DuplicateGeometry
Create a duplicate of this light.

Grasshopper.Kernel.Types.GH_Light.DuplicateLight
Create a duplicate of this light.

Grasshopper.Kernel.Types.GH_Light.IsValid
Gets the validity of this light. If the light is referenced but cannot be loaded, then the light is not valid.

Grasshopper.Kernel.Types.GH_Light.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Kernel.Types.GH_Light.ToString
Format the dimension using default grasshopper formatting logic.

Grasshopper.Kernel.Types.GH_Light.ClearCaches
Clears all volatile caches for this instance. The boundingbox is cleared, and if the light is referenced,
the local instance of the light is erased.

Grasshopper.Kernel.Types.GH_Light.IsGeometryLoaded
Gets the load state of this light object. The light is considered to be loaded when the local light instance is not null.

Grasshopper.Kernel.Types.GH_Light.LoadGeometry(Rhino.RhinoDoc)
If the light is referenced and not yet loaded, attempts to load the light.
Returns: True if the light is loaded (or if it was already loaded), False on failure.

Grasshopper.Kernel.Types.GH_Light.CastFrom(System.Object)
Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_Light.CastTo``1(``0@)
Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.