Grasshopper.GUI.Theme.GH_WireSettings.DefaultColour
Gets or sets the colour to use for standard wires.

Grasshopper.GUI.Theme.GH_WireSettings.EmptyColour
Gets or sets the colour to use for empty wires.

Grasshopper.GUI.Theme.GH_WireSettings.SelectedColour0
Gets or sets the colour of a wire at the selected extreme.

Grasshopper.GUI.Theme.GH_WireSettings.SelectedColour1
Gets or sets the colour of a wire at the unselected extreme.