Grasshopper.My.Resources.Res_MainMenu
A strongly-typed resource class, for looking up localized strings, etc.

Grasshopper.My.Resources.Res_MainMenu.ResourceManager
Returns the cached ResourceManager instance used by this class.

Grasshopper.My.Resources.Res_MainMenu.Culture
Overrides the current thread's CurrentUICulture property for all
resource lookups using this strongly typed resource class.

Grasshopper.My.Resources.Res_MainMenu.About_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Arrange_MoveDown_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Arrange_MoveToBottom_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Arrange_MoveToTop_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Arrange_MoveUp_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Bake_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.CanvasRadialMenu_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.CanvasRedraw_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.CanvasToolbar_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Cluster_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Component_Icons_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.ComponentCascadeMenus_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.ComponentTabs_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Copy_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Cut_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.DataViewer_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Delete_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.DeleteState_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.DiscardCluster_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Display_Gumballs_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.ExportHighResolution_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.ExportQuickImage_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.ExposureSeparators_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Fancy_Wires_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Find_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Focus_LowerLeft_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Focus_LowerRight_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Focus_UpperLeft_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Focus_UpperRight_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.GHADefaultLoading_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.GHALoadingOptions_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.GHAMemoryLoading_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.GHAPluginLoading_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Group_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.MeshWireDisplay_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.MultiLineEditor_BlankInfo_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.MultiLineEditor_LineInfo_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.MultiLineEditor_PathInfo_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.NamedView_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.NewFile_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.NoPreview_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Object_Enabled_Off_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Object_Enabled_On_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Object_Enabled_Toggle_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Object_Preview_Off_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Object_Preview_On_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Object_Preview_Toggle_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Object_UseTasks_Off_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Object_UseTasks_On_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Open_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.OpenGL_Sprites_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Paste_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.PasteInCenter_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.PasteInPlace_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.PlanePreviewRadius_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.PointStyleControlPoint_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.PointStyleSimplePoint_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.PointStyleX_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.PreviewSettings_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.RCP_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Redo_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.ResetCanvas_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.RibbonLayout_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.RunSolution_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Save_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.SaveAs_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.SelectedOnlyPreview_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.ShadedPreview_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.ShowAllComponents_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.ShowFullName_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.ShowObscure_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.SketchInteraction_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.SolutionState_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.SpecialFolder_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.TooltipWiggle_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Undo_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Ungroup_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.VersionHistory_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Weblink_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.Widgets_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.WireframePreview_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.ZoomDocument_16x16
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.ZoomOnPreview_20x20
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_MainMenu.ZoomSelected_16x16
Looks up a localized resource of type System.Drawing.Bitmap.