Grasshopper.GUI.Canvas.GH_WireType
Enumerates the different kinds of connecting wires.

Grasshopper.GUI.Canvas.GH_WireType.dynamic
Dynamic indicates the wire is in the process of being made.

Grasshopper.GUI.Canvas.GH_WireType.wireless
Wireless connector. Will be drawn dotted when either end is selected.

Grasshopper.GUI.Canvas.GH_WireType.generic
Generic connector wire. Can't go wrong with generic.

Grasshopper.GUI.Canvas.GH_WireType.faint
Similar to generic, but less pronounced.

Grasshopper.GUI.Canvas.GH_WireType.null
Wire with null data transfer.

Grasshopper.GUI.Canvas.GH_WireType.item
Wire with a single data transfer.

Grasshopper.GUI.Canvas.GH_WireType.list
Wire with a single list transfer.

Grasshopper.GUI.Canvas.GH_WireType.tree
Wire with multiple list transfer.

Grasshopper.GUI.Canvas.GH_WireType.dynamicAlternative1
Wire type used by copyname=true wires.