Grasshopper.Kernel.GH_PingDocumentEventArgs
Event arguments passed during PingDocument events.

Grasshopper.Kernel.GH_PingDocumentEventArgs.Document
If you're a GH_Document that owns this object, you must fill out this field.
This is the only way for objects to know which document they belong to.