Grasshopper.GUI.GH_WindowsControlUtil
Exposes some static (Shared) utility functions for setting text-rendering properties en masse.

Grasshopper.GUI.GH_WindowsControlUtil.FixTextRenderingDefault(System.Windows.Forms.Control)
Sets the UseCompatibleTextRendering value to False on the control.

Grasshopper.GUI.GH_WindowsControlUtil.FixTextRenderingDefault(System.Windows.Forms.Control.ControlCollection)
Recursively sets the UseCompatibleTextRendering value to False on each control.
This example shows how to use this function to modify all the controls on a windows Form.
Dim frm As New MyVerySpecialForm()
Grasshopper.GUI.GH_WindowsControlUtil.FixTextRenderingDefault(frm.Controls)
frm.Show()