Grasshopper.Kernel.GH_FileWatcher.FileChanged
Delegate method for file change callbacks.
sender: FileWatcher that invoked the delegate.
filename: Path to file that is being watched.
change: The type of change that occured.