Grasshopper.Kernel.GH_SelectionTopology
Enumerates the possible selection topologies.

Grasshopper.Kernel.GH_SelectionTopology.None
No selected objects.

Grasshopper.Kernel.GH_SelectionTopology.Convex
Selection set is convex, meaning unselected objects are not sandwiched between selected objects.

Grasshopper.Kernel.GH_SelectionTopology.Concave
Selection set is concave, meaning unselected objects are sandwiched between selected objects.