Grasshopper.Kernel.GH_GHALoadingEventArgs
Event arguments used in the GH_GHALoaded event on GH_ComponentServer.

Grasshopper.Kernel.GH_GHALoadingEventArgs.Name
Gets the official name of the GHA file.

Grasshopper.Kernel.GH_GHALoadingEventArgs.Icon
Gets the official icon of the GHA file.

Grasshopper.Kernel.GH_GHALoadingEventArgs.Id
Gets the Id of the GHA file.

Grasshopper.Kernel.GH_GHALoadingEventArgs.FileName
Gets the location of the gha file.

Grasshopper.Kernel.GH_GHALoadingEventArgs.Assembly
Gets the assembly that was loaded from the GHA file.

Grasshopper.Kernel.GH_GHALoadingEventArgs.LoadingMechanism
Gets the mechanism that was used to load the file.