Grasshopper.Kernel.GH_GuidTable
Maintains a quick-access collection of Guids and IGH_ActiveObject references.

Grasshopper.Kernel.GH_GuidTable.Add(System.Guid,Grasshopper.Kernel.IGH_ActiveObject)
Register a new id+object key-value pair with the Table.
If the combination already exists, it won't be added.
id: Rhino object ID to register.
obj: Grasshopper canvas object that references it.

Grasshopper.Kernel.GH_GuidTable.Clear
Clear the entire table.

Grasshopper.Kernel.GH_GuidTable.Contains(System.Guid)
Fast test to see if a Rhino object ID has been registered in the table.
Negative tests are O(1), positive tests are O(N).
id: Object ID to test for.

Grasshopper.Kernel.GH_GuidTable.Objects(System.Guid)
Collect all the objects that are associates with a given ID.
id: ID to test for.

Grasshopper.Kernel.GH_GuidTable.AllObjects
Collect all the objects that are stored in this Table.
The result might contain duplicates.

Grasshopper.Kernel.GH_GuidTable.IsEmpty
Gets a value whether the table is empty.

Grasshopper.Kernel.GH_GuidTable.Count
Gets the number of stored IDs in the table.