Grasshopper.Kernel.Geometry.LineCircleX
Enumerates all possible solutions to the intersection event of a circle and an infinite line segment.

Grasshopper.Kernel.Geometry.LineCircleX.None
No intersection, line is completely outside the circle.

Grasshopper.Kernel.Geometry.LineCircleX.Tangent
Line is tangent to circle.

Grasshopper.Kernel.Geometry.LineCircleX.Secant
Line and circle intersect in 2 points