Grasshopper.Kernel.Types.GH_MeshFace
Represents a tri or quad mesh face. GH_MeshFace works similar to the OpenNURBS OnMeshFace class.

Grasshopper.Kernel.Types.GH_MeshFace.#ctor
Default constructor. Sets all corners to 0.

Grasshopper.Kernel.Types.GH_MeshFace.#ctor(System.Int32,System.Int32,System.Int32)
Create a triangular mesh face from 3 corners indices.
nA: First corner index
nB: Second corner index
nC: Third corner index

Grasshopper.Kernel.Types.GH_MeshFace.#ctor(System.Int32,System.Int32,System.Int32,System.Int32)
Create a quadrangular mesh face from 4 corners indices.
nA: First corner index
nB: Second corner index
nC: Third corner index
nD: Fourth corner index

Grasshopper.Kernel.Types.GH_MeshFace.#ctor(Rhino.Geometry.MeshFace)
Create a duplicate of another mesh face.
other: Mesh face to duplicate.

Grasshopper.Kernel.Types.GH_MeshFace.#ctor(Grasshopper.Kernel.Types.GH_MeshFace)
Create a duplicate of another mesh face
other: Mesh face to duplicate

Grasshopper.Kernel.Types.GH_MeshFace.Duplicate
Create a duplicate of this Mesh face.

Grasshopper.Kernel.Types.GH_MeshFace.DuplicateMeshFace
Create a duplicate of this Mesh face.

Grasshopper.Kernel.Types.GH_MeshFace.EmitProxy
Returns a proxy that represents this mesh face. Do not call this function unless you're

Grasshopper.Kernel.Types.GH_MeshFace.IsValid
Test for validity. No negative indices are allowed and only C and D are allowed to be identical.

Grasshopper.Kernel.Types.GH_MeshFace.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Kernel.Types.GH_MeshFace.ToString
Format the mesh face using default grasshopper formatting logic.

Grasshopper.Kernel.Types.GH_MeshFace.CastFrom(System.Object)
Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_MeshFace.CastTo``1(``0@)
Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.