Grasshopper.Kernel.Types.GH_Line
Represents a 3D line segment. GH_Line re-implements the OpenNURBS OnLine class.

Grasshopper.Kernel.Types.GH_Line.#ctor
Default constructor

Grasshopper.Kernel.Types.GH_Line.#ctor(Rhino.Geometry.Line)
Create a duplicate of another line.
line: Line to copy. If null, a default line will be created.

Grasshopper.Kernel.Types.GH_Line.#ctor(Grasshopper.Kernel.Types.GH_Line)
Create a duplicate of another line.
other: Line to copy. If null, a default line will be created.

Grasshopper.Kernel.Types.GH_Line.DuplicateGeometry
Create a duplicate of this line.

Grasshopper.Kernel.Types.GH_Line.DuplicateLine
Create a duplicate of this line.

Grasshopper.Kernel.Types.GH_Line.IsValid
Gets the validity of this instance. Lines with zero length are not considered to be valid.

Grasshopper.Kernel.Types.GH_Line.IsValidWhyNot
Gets a string describing the state of "invalidness".
If the instance is valid, then this property should return Nothing or String.Empty.

Grasshopper.Kernel.Types.GH_Line.ToString
Format the line using default grasshopper formatting logic.

Grasshopper.Kernel.Types.GH_Line.CastFrom(System.Object)
Remote to Local caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_Line.CastTo``1(``0@)
Local to Remote caster function. This stuff is complex, don't concern yourself with casting logic.

Grasshopper.Kernel.Types.GH_Line.EmitProxy
Returns a proxy that represents this line. Do not call this function unless you're