Grasshopper.Kernel.PluginLoadTracker
Keep track of successful plugin loading.

Grasshopper.Kernel.PluginLoadTracker.TrackerFile
Gets the location of the file which maintains the plugin locations.

Grasshopper.Kernel.PluginLoadTracker.TrackerFileContents
Gets the contents of the tracker file.

Grasshopper.Kernel.PluginLoadTracker.BeginPluginLoad(System.String)
Make sure that a specific plugin path is mentioned in the tracker file.

Grasshopper.Kernel.PluginLoadTracker.EndPluginLoad(System.String)
Make sure that a specific plugin path is not mentioned in the tracker file.

Grasshopper.Kernel.PluginLoadTracker.IsPluginTracked(System.String)
Gets whether a specific plugin is known to the tracker,
probably meaning that Grasshopper crashed during the last time it attempted to load this plugin.